Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Have you forgotten your password? Please introduce your email:
ca: Has oblidat la teva contrasenya? Si us plau, escriu el teu correu electrònic:
es: ¿Has olvidado tu contraseña? Por favor, escribe tu email:
it: Hai dimenticato la tua password? Per favore, inserisci la tua email:
pt: Esqueceu sua senha? Por favor insira seu e-mail:

source: User doesn't exist or the password is incorrect.
ca: L'usuari no existeix o la contrasenya és incorrecta.
es: El usuario no existe o la contraseña es incorrecta.
it: L'utente non esiste o la password è errata.
pt: Usuário não existe ou a senha está incorreta.

source: You must to complete all the fields.
ca: Cal que completis tots els camps correctament.
es: Debes completar todos los campos correctamente.
it: Devi compilare tutti i campi.
pt: Você deve completar todos os campos.

source: Spanish
ca: Espanyol
es: Español
gl: Español
it: Spagnolo
pt: Espanhol
tr: İspanyol

source: English
ca: Anglès
es: Inglés
gl: Inglés
it: Inglese
pt: Inglês
tr: İngilizce

source: Basque
ca: Basc
it: Basco
pt: Basco
tr: Bask

source: Basic
ca: Bàsic
es: Básico
gl: Básico
pt: Básico
tr: Temel

source: Development
ca: Mig
es: Medio
gl: Medio
pt: Em desenvolvimento
tr: Gelişim

source: Master
ca: Avançat
es: Avanzado
gl: Avanzado
tr: Usta

source: Logout
ca: Sortir
es: Salir
pt: Sair
tr: Çıkış Yap

source: Dr. Scratch(Beta Version)
ca: Dr. Scratch(Versió Beta)
es: Dr. Scratch(Versión Beta)
gl: Dr. Scratch(Versión beta)
pt: Dr. Scratch(Versão Beta)
tr: Dr. Scratch (Beta Sürümü)

source: Password
ca: Contrasenya
es: Contraseña
gl: Contrasinal
pt: Senha
tr: Şifre

source: PaintedOrange(100):: looks stack
ca: PintaTaronja(100):: looks stack
es: PintaNaranja(100):: looks stack
gl: DebuxaLaranxa(100):: looks stack

source: PaintedOrange(200):: looks stack
ca: PintaTaronja(200):: looks stack
es: PintaNaranja(200):: looks stack
gl: DebuxaLaranxa(200):: looks stack

source: Costume:
ca: Vestit:
es: Disfraz:
gl: Disfraz:
pt: Roupa:

source: Welcome to the Dr. Scratch website (version for organizations), an analytical tool that evaluates your Scratch projects in a variety of computational areas. This analyzer is a helpful tool to evaluate your students' Scratch projects. You'll have a smart dashboard where you can see the most important information about your students and their development.
ca: Benvingut a la web de Dr. Scratch (versió per a organitzacions), una aplicació que avalua projectes Scratch en relació a diferents aspectes del pensament computacional. Aquest analitzador és una eina molt útil per avaluar els projectes Scratch dels teus alumnes. Tindràs una pàgina personalitzada amb informació dels teus estudiants i el seu desenvolupament.
gl: Benvido ao sitio web de Dr. Scratch, unha ferramenta de análise para avaliar os teus proxectos Scratch en distintos aspectos computacionais. Este analizador é unha ferramenta útil para avaliar os teus propios proxectos, ou os dos teus alumnos.
pt: Bem-vindo ao site do Dr. Scratch, uma ferramenta de análise que avalia seus projetos Scratch em várias áreas da computação. Esse analisador é uma ferramenta muito útil para avaliar seus próprios projetos ou os dos seus estudantes.
tr: Dr. Scratch web sitesine (kuruluşlar için versiyon) hoş geldiniz, Scratch projelerinizi çeşitli bilişim alanlarında değerlendiren analitik bir araçtır. Bu analiz aracı, öğrencilerinizin Scratch projelerini değerlendirmek için yararlı bir araçtır. Öğrencileriniz ve onların gelişimi hakkında en önemli bilgileri görebileceğiniz akıllı bir panele sahip olacaksınız.

source: project.png
ca: projecte.png
es: proyecto.png
gl: proxecto.png
pt: projeto.png

source: You can upload an sb2 file or just provide the project url, avoiding the need to previously download the project to your computer. By analyzing your projects with Dr. Scratch, you can easily check your Computational Thinking Score.
ca: Pots carregar un fitxer amb extensió sb2 o utilitzar la url que Scratch facilita sense necessitat de descarregar prèviament el projecte al teu ordinador. Per mitjà de l'anàlisi de Dr. Scratch pots conèixer fàcilment el teu Nivell de Pensament Computacional.
es: Puedes subir un fichero de extensión sb2 o utilizar la url que Scratch facilita sin necesidad de bajar previamente el proyecto a tu ordenador. Mediante el análisis de Dr. Scratch, puedes conocer fácilmente tu Nivel de Pensamiento Computacional.
gl: Podes subir un ficheiro .sb2 ou simplemente dar a url do proxecto, evitando a necesidade de descargar previamente o proxecto no teu ordenador. Analizando os teus proxectos con Dr. Scratch, podes comprobar dun xeito sinxelo o teu Nivel de Pensamento Computacional.
tr: Bir sb2 dosyası yükleyebilir veya projeyi bilgisayarınıza indirme ihtiyacı olmadan sadece proje URL'sini verebilirsiniz. Dr. Scratch ile projelerinizi analiz ederek, Bilgisayarla Düşünme Puanınızı kolayca kontrol edebilirsiniz.

source: Gamification
ca: Ludificació
es: Gamificación
gl: Gamificación
pt: Gamificação
tr: Oyun oynamak

source: <input type='text' name='username' id='username' placeholder='Username' style='margin-bottom: 15px;'>
ca: <input type='text' name='username' id='username' placeholder='Nom d usuari' style='margin-bottom: 15px;'>
es: <input type='text' name='username' id='username' placeholder='Nombre de usuario' style='margin-bottom: 15px;'>
pt: <input type='text' name='username' id='username' placeholder='Usuário' style='margin-bottom: 15px;'>

source: <input type='password' name='password' id='password' placeholder='Password' style='margin-bottom: 15px;'>
ca: <input type='password' name='password' id='password' placeholder='Contrasenya' style='margin-bottom: 15px;'>
es: <input type='password' class='form-control' name='password' placeholder='Contraseña'>

source: Social network
ca: Xarxa Social
es: Red social
gl: Redes sociais
pt: Rede social

source: Your daily progress
ca: El teu progrés diari
pt: Seu progresso diário

source: Welcome to the Dr. Scratch website,
ca: Benvingut a Dr. Scratch,
gl: Benvido a Dr. Scratch. Resultados do proxecto.
pt: Bem-vindo ao site Dr. Scratch,

source: file CSV
ca: fitxer CSV
es: fichero CSV
gl: ficheiro CSV
pt: arquivo CSV

source: You'll evaluate the projects of all your student in few time. Also, you'll see all the relevant information in a view.
ca: Avaluaràs els projectes de tots els teus alumnes en poc temps. A més, veuràs la informació més important en un cop d'ull.
pt: Você avaliará os projetos de todos os seus estudantes em alguns instantes. Além disso, você visualizará todas as informações relevantes.

source: If you want to be one of the ten first organizations which prove Dr. Scratch send us an email to
ca: Si vols ser una de les 10 primeres organitzacions que proven Dr. Scratch envia'ns un correu electrònic a
pt: Se você quer ser uma das dez primeiras organizações a testar Dr Scratch, envie um e-mail para

source: and we'll give you your hash to can sign up in the web
ca: i et donarem una clau de pas per poder registrar-te a la web
pt: e daremos um código com o qual você pode se cadastrar no site

source: You can download your results. You do click in the following button:
ca: Pots descarregar els teus resultats. Fes clic al següent botó:
pt: Você pode fazer o download de seus resultados. Clique no seguinte botão:

source: Download .csv file
ca: Descarregar el fitxer .csv
pt: Fazer o download do arquivo. .csv

source: Or...you can analyze another file with more projects:
ca: O... analitza un altre fitxer amb més projectes:
pt: Ou... você pode analisar outro arquivo com mais projetos:

source: Analyze again!
ca: Analitzar de nou!
pt: Analise novamente!

source: Error! Please choose a .csv file
ca: Error! Si us plau tria un fitxer .csv
gl: Erro! Por favor elixe un ficheiro .csv
pt: Erro! Por favor, escolha um arquivo .csv

source: <img class='framed' src='../../static/app/images/url-en.png' />
ca: <img class='framed' src='../../static/app/images/url-ca.png' />
pt: <img class='framed' src='../../static/app/images/url-pt.png' />

source: <img class='framed' src='../../static/app/images/project-en.png' />
ca: <img class='framed' src='../../static/app/images/project-ca.png' />
pt: <img class='framed' src='static/app/images/project-pt.png' />

source: Improve the score
ca: Millora la teva puntuació
pt: Melhore sua pontuação

source: You do not like the score that you got? Improve it following our advice.
ca: No t'agrada la puntuació obtinguda? Segueix els nostres consells per millorar-la!
pt: Não gostou da sua pontuação? Melhore-a seguindo nossas dicas.

source: Want to level up?
ca: Vols pujar de nivell?
gl: ¿Quere subir de nivel?
pt: Quer aumentar seu nível?

source: Concept
ca: Concepte
gl: Concepto
pt: Conceito

source: Points
ca: Punts
gl: Puntos
pt: Pontos

source: Details to fix:
ca: Detalls a corregir:
pt: Detalhes a corrigir:

source: You have dead code in
ca: Tins un codi no executat a
pt: Você tem código morto em

source: Welcome to Doctor Scratch. Project results.
ca: Torna al teu projecte Scratch

source: CT Score:
ca: Puntuació:

source: Developing
ca: Mig

source: I have just obtained %(points)s points analyzing my project in Dr. Scratch! Beat it! @DrScratchTool
ca: He aconseguit %(points)s punts analitzant el meu projecte a Dr. Scratch! Pots superar-ho? @DrScratchTool

source: CT Score in detail:
ca: Puntuació al detall

source: Sprites naming
ca: Noms poc encertats

source: Incorrect name:
ca: Noms poc encertats
gl: Nome incorrecto:

source: Sprite attributes initialization
ca: Atributs no inicialitzats correctament

source: Multilingual Website
gl: Sitio web multilingüe
pt: Site Multilíngue
tr: Çok Dilli Web Sitesi

source: Cloud Platform
gl: Plataforma na Nube
pt: Plataforma em Nuvem
tr: Bulut Platformu

source: Social Network
gl: Redes Sociais
pt: Rede Social
tr: Sosyal ağ

source: modified but not initialized correctly.
gl: modificado mais non inicializado correctamente.
pt: modificado mas não inicializado corretamente.

source: HELP
es: AYUDA
tr: YARDIM

source: More thanks
es: Más agradecimientos

source: Pau Nin works as Elementary School teacher and Masters degree in Innovation Pedagogical and Education Leadership in the XXI century. He's an enthusiast of the Programmation and educational robotic. Also he loves sharing with other teachers the possibilities of both(programmation and robotic) as one of the most powerful motivational tools available today to teach in the classroom.
es: Pau Nin es maestro de Educación Primaria y Máster en Innovación Pedagógica y Liderazgo Educativo en el S.XXI. Es un entusiasta de la programación y la robótica educativa y le gusta compartir con el resto de docentes las posibilidades de ambas como recursos motivadores para el aprendizaje.

source: <span class='colored-text'>NEW!! </span>3. Upload projects with a <span class='colored-text'><a data-toggle='modal' href='#modalBatch'>txt</a></span> file:
es: <span class='colored-text'>¡NUEVO! </span>3. Analizar proyectos de un archivo <span class='colored-text'><a data-toggle='modal' href='#modalBatch'>txt</a></span>

source: <span class='colored-text'>NEW!!</span> You also can create your own rubric with your own criteria:
es: <span class='colored-text'>¡NUEVO!</span> También puedes crear tu propia rúbrica con tus propios criterios:

source: <input type='text' name='username' id='username' placeholder='Username' />
es: <input type='text' name='username' id='username' placeholder='Nombre de usuario'>
tr: <input type='text' name='username' id='username' placeholder='Kullanıcı adı' />

source: <input type='password' name='password' id='password' placeholder='Password'/>
es: <input type='password' name='password' id='password' placeholder='Contraseña'>
tr: <input type='password' name='password' id='password' placeholder='Şifre'/>

source: <input type='password' name='password_confirm' id='password_confirm' placeholder='Password'/>
es: <input type='password' name='password_confirm' id='password_confirm' placeholder='Contraseña'/>
tr: <input type='password' name='password_confirm' id='password_confirm' placeholder='Şifre'/>

source: <input type='password' class='form-control' name='password' placeholder='Password'>
es: <input type='password' class='form-control' name='password' placeholder='Contraseña'>

source: Vanilla Mode
tr: Vanilla Modu

source: Extended Mode
tr: Genişletilmiş Modu

source: Backdrop Naming
tr: Arka Plan Adlandırma

source: Try to name them more according to the Function they make
tr: Onları yaptıkları işlevlere daha uygun şekilde adlandırmayı deneyin

source: Erase them in order to have a cleaner Code
tr: Kodunuzu daha temiz hale getirmek için bunları silin

source: <h3 class='text-left dark-text'>The level of your project is... <strong> DEVELOPING! </strong></h3>
tr: <h3 class='text-left dark-text'>Projenizin seviyesi... <strong> GELİŞİYOR! </strong></h3>

source: Display all duplicates
tr: Tüm yinelenenleri göster

source: Dr. Scratch for Organizations
tr: Organizasyonlar için Dr. Scratch

source: Teacher Accounts
tr: Öğretmen Hesapları

source: Do you want to compare two projects?
tr: İki projeyi karşılaştırmak ister misiniz?

source: Upload your two projects to compare them now!
tr: Şimdi iki projenizi yükleyin ve karşılaştırın!

source: Original Project
tr: Orijinal Proje

source: New Project
tr: Orijinal Proje

source: <input name="urlProject" id="cf-name-base" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/your_number" type="text">
tr: <input name="urlProject" id="cf-name-base" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/Numaran" type="text">

source: <input name='zipFile' id='file-base' type='file' class='filestyle' data-buttonText='Choose Project'>
tr: <input name='zipFile' id='file-base' type='file' class='filestyle' data-buttonText='Projeyi Seçin'>

source: <input name='zipFile' id='file' type='file' class='filestyle' data-buttonText='Choose Project'>
tr: <input name='zipFile' id='file' type='file' class='filestyle' data-buttonText='Projeyi Seçin'>

source: Is the new project an update from the original?
tr: Yeni proje, orijinalinin bir güncellemesi mi?

source: Yes
tr: Evet

source: No
tr: Hayir

source: Compare Projects
tr: Projeleri Karşılaştır

source: Error! Please choose a .sb or .sb3 file or input an url
tr: Hata! Lütfen bir .sb veya .sb3 dosyası seçin ya da bir URL girin.

source: You can only submit a URL or a File, not both at the same time.
tr: Yalnızca bir URL veya bir dosya gönderebilirsiniz, aynı anda ikisini birden değil.

source: Close
tr: Kapalı

source: comparing...
tr: karşılaştırma...

source: Analysis Complete!!
tr: Analiz Tamamlandı!!

source: You can download the csv clicking
tr: CSV'yi indirmek için tıklayın

source: HERE
tr: BURADA

source: Summary:
tr: Özet:

source: Projects Analyzed:
tr: Analiz Edilen Projeler:

source: Average Score:
tr: Not ortalaması:

source: Average Mastery:
tr: Ortalama Ustalık:

source: Thanks for using Dr.Scratch!!
tr: Dr. Scratch'i kullandığınız için teşekkürler!!

source: Our servers are processing each of your projects. When finished, we will notify your email with a full report including the CSV with the results.
tr: Sunucularımız projelerinizi işliyor. İşlem tamamlandığında, sonuçları içeren CSV dosyasıyla birlikte ayrıntılı bir raporu e-posta adresinize göndereceğiz.

source: The mean level of your projects is...
tr: Projelerinizin ortalama seviyesi...

source: BEFORE
tr: ÖNCE

source: Blocks and Sprites Usage:
tr: Bloklar ve Karakter Kullanımı:

source: Total Blocks
tr: Toplam Blok Sayısı

source: blocks
tr: bloklar

source: Total Sprites
tr: Toplam Karakter Sayısı

source: sprites
tr: karakter sayısı

source: Bad Smells:
tr: Kötü Kokular:

source: duplicated
tr: çoğaltılmış

source: dead blocks
tr: ölü bloklar

source: backdrops
tr: arka plan

source: Go to Vanilla Mode.
tr: Vanilla Moduna Geç

source: AFTER
tr: SONRA

source: blocks
tr: bloklar

source: sprites
tr: karakter sayısı

source: duplicated
tr: çoğaltılmış

source: dead blocks
tr: ölü bloklar

source: backdrops
tr: arka plan

source: Show more
tr: Daha fazla göster

source: Similarity Percentage
tr: Benzerlik Yüzdesi

source: Percentage of Similarity between the 2 Projects
tr: İki Proje Arasındaki Benzerlik Yüzdesi

source: Block Types Distribution (Before)
tr: Blok Türleri Dağılımı (Önce)

source: Distribution of Block Types in the Projects
tr: Projelerdeki Blok Türlerinin Dağılımı

source: Block Types Distribution (After)
tr: Blok Türleri Dağılımı (Sonra)

source: Original Bad habits
tr: Orijinal Kötü Alışkanlıklar

source: New Bad habits
tr: Yeni Kötü Alışkanlıklar

source: Duplicates
tr: Kopyalar

source: Display Original Blocks!
tr: Orijinal Blokları Göster!

source: Display Solution!
tr: Çözümü Göster!

source: Congrats!!
tr: Tebrikler!!

source: You have improved this project by
tr: Bu projeyi şu kadar geliştirdiniz

source: Oops...
tr: Eyvah...

source: You have dropped this project by
tr: Bu projeyi şu kadar kötüleştirdiniz

source: Show less
tr: Az göster

source: This is the original ' + compareType + '.
tr: Bu orijinal ' + compareType + '.

source: Congratulations!! You have erase all your ' + compareType + ' of your project
tr: Tebrikler!! Projenizdeki tüm ' + compareType + ' öğelerini sildiniz.

source: Congrats!! You have decrease the number of ' + compareType + ' in your project, keep it up !!
tr: Tebrikler!! Projenizdeki ' + compareType + ' sayısını azalttınız, devam edin !!

source: Oops... You have increase the number of ' + compareType + ' in your project, try to erase them !!
tr: Oops... Projenizdeki ' + compareType + ' sayısını artırdınız, onları silmeye çalışın !!

source: You have the same the number of ' + compareType + ' in your project, try to erase them !!
tr: Projenizdeki ' + compareType + ' sayısı aynı kaldı, onları silmeye çalışın !!

source: New Score:
tr: Yeni Puan:

source: The new level of your project is...
tr: Projenizin yeni seviyesi...

source: Want a Ferret-Advice?
tr: Ferret Tavsiyesi mi Almak İstersiniz?

source: Want a Banana-Tip?
tr: Bir Muz-Tavsiyesi Mi İstersiniz?

source: Want a Kitty-Guidance?
tr: Bir Kedi-Kılavuzu Mu İstersiniz?

source: Compare project
tr: Projeyi Karşılaştır

source: Upload the new project in order to compare it with the actual
tr: Yeni projeyi mevcut projeyle karşılaştırmak için yükleyin.

source: Compare projects
tr: Projeyi Karşılaştır

source: Your browser does not support the video tag.
tr: Tarayıcınız video etiketini desteklemiyor.

source: Please paste a project url
tr: Lütfen bir proje URL'si yapıştırın

source: <input name="zipFile" id="cf-upload" type="file" class="filestyle" data-buttonText="Choose Project">
tr: <input name="zipFile" id="cf-upload" type="file" class="filestyle" data-buttonText="Proje Seçin">

source: Please upload a project
tr: Lütfen bir proje yükleyin

source: Please upload a <span class='colored-text'><a data-toggle='modal' href='#modalTxt'>txt</a></span> containing the URLs of the projects, with each URL on a separate line. Or a zip containing the .sb3 (Max. 10)
tr: Lütfen her URL'yi ayrı bir satıra yerleştirerek projelerin URL'lerini içeren bir <span class='colored-text'><a data-toggle='modal' href='#modalTxt'>txt</a></span> dosyası yükleyin. Alternatif olarak, en fazla 10 adet .sb3 dosyasını içeren bir zip dosyası yükleyebilirsiniz.

source: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Choose txt or zip'>
tr: <input name='urlsFile' type='file' class='filestyle' data-buttonText='txt veya zip Seçin'>

source: Please enter an email!
tr: Lütfen bir e-posta adresi girin!

source: Please upload a txt/zip file!
tr: Lütfen bir txt/zip dosyası yükleyin!

source: <input id="input-recom" name="urlProject_recom" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/your_number" type="text">
tr: <input id="input-recom" name="urlProject_recom" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/numaranız" type="text">

source: Comparison Mode
tr: Kıyaslama Modu

source: The comparison mode allows you to compare two different projects, enabling you to highlight their key differences and gain detailed insights into each.
tr: Kıyaslama modu, iki farklı projeyi karşılaştırmanıza olanak tanır, böylece ana farklılıklarını vurgulayabilir ve her birine dair detaylı bilgiler elde edebilirsiniz.

source: What is an txt with scratch's urls?
tr: Scratch URL'leri içeren bir txt nedir?

source: How is the correct format of the txt?
tr: Txt dosyasının doğru formatı nasıl olmalıdır?

source: There are three options to analyze your Scratch project now!
tr: Şu anda Scratch projenizi analiz etmek için üç seçeneğiniz var!

source: 3. Upload projects with a <span class='colored-text'><a data-toggle='modal' href='#modalTxt'>txt</a></span> file:
tr: 3. Projeleri bir <span class='colored-text'><a data-toggle='modal' href='#modalTxt'>txt</a></span> dosyası ile yükleyin:

source: Italiano
tr: İtalyan

source: Russian
tr: Rusça

source: Turkish
tr: Türkçe

source: Project results
gl: Resultados

source: Dashboard
gl: Taboleiro

source: Overview
gl: Resumo

source: Your level:
gl: O teu nivel:

source: Learn more!!!
gl: Aprende máis!!!

source: Well done!!!
gl: Ben feito!!!

source: blocks
gl: bloques
