Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Parallelization is absolutely vital. The ability to perform parallel processing is fundamental for system performance.
ca: La paral·lelització és absolutament vital. La capacitat per realitzar processament paral·lel és fonamental per al rendiment del sistema.
es: La paralelización es absolutamente vital. La capacidad para realizar procesamiento paralelo es fundamental para el rendimiento del sistema.
gl: A paralelización é absolutamente vital. A capacidade para realizar procesamento paralelo é fundamental para o rendemento do sistema.
it: La parallelizzazione è assolutamente vitale. La capacità di eseguire l'elaborazione parallela è fondamentale per le prestazioni del sistema.
pt: A paralelização é absolutamente vital. A capacidade para realizar processamento paralelo é fundamental para o desempenho do sistema.
tr: Paralelleştirme kesinlikle hayati öneme sahiptir. Paralel işleme yeteneği, sistem performansı için temel bir gerekliliktir.

source: Logic Thinking
ca: Pensament Lògic
gl: Pensamento Lóxico
it: Pensiero logico
pt: Pensamento Lógico
tr: Mantıksal Düşünme

source: Logical thinking is not relevant to me at this moment. I am focused on other aspects of the problem.
ca: El pensament lògic no és rellevant per a mi en aquest moment. Estic enfocat en altres aspectes del problema.
es: El pensamiento lógico no es relevante para mí en este momento. Estoy enfocado en otros aspectos del problema.
gl: O pensamento lóxico non é relevante para min neste momento. Estou enfocado noutros aspectos do problema.
it: Il pensiero logico non è rilevante per me in questo momento. Sono concentrato su altri aspetti del problema.
pt: O pensamento lógico não é relevante para mim neste momento. Estou focado em outros aspectos do problema.
tr: Bu anda mantıksal düşünme benim için önemli değil. Problemin diğer yönlerine odaklanıyorum.

source: Logical thinking is minimal. I prefer to follow a more intuitive approach in my decisions and actions.
ca: El pensament lògic és mínim. Prefereixo seguir un enfocament més intuitiu en les meves decisions i accions.
es: El pensamiento lógico es mínimo. Prefiero seguir un enfoque más intuitivo en mis decisiones y acciones.
gl: O pensamento lóxico é mínimo. Prefiro seguir un enfoque máis intuitivo nas miñas decisións e accións.
it: Il pensiero logico è minimo. Preferisco seguire un approccio più intuitivo nelle mie decisioni e azioni.
pt: O pensamento lógico é mínimo. Prefiro seguir uma abordagem mais intuitiva nas minhas decisões e ações.
tr: Mantıksal düşünme minimal. Karar ve eylemlerimde daha sezgisel bir yaklaşımı tercih ediyorum.

source: Logical thinking has some importance, but it is not fundamental. Sometimes, I rely more on my instinct than on pure logic.
ca: El pensament lògic té certa importància, però no és fonamental. A vegades, confio més en el meu instint que en la lògica pura.
es: El pensamiento lógico tiene cierta importancia, pero no es fundamental. A veces, confío más en mi instinto que en la lógica pura.
gl: O pensamento lóxico ten certa importancia, pero non é fundamental. Ás veces, confío máis no meu instinto que na lóxica pura.
it: Il pensiero logico ha una certa importanza, ma non è fondamentale. A volte mi affido più all'istinto che alla pura logica.
pt: O pensamento lógico tem certa importância, mas não é fundamental. Às vezes, confio mais no meu instinto do que na lógica pura.
tr: Mantıksal düşünme bazı önem taşır, ancak temel değildir. Bazen saf mantıktan daha çok içgüdülerime güvenirim.

source: Logical thinking is important. I use logic to solve problems and make decisions more efficiently.
ca: El pensament lògic és important. Utilitzo la lògica per resoldre problemes i prendre decisions de manera més eficient.
es: El pensamiento lógico es importante. Utilizo la lógica para resolver problemas y tomar decisiones de manera más eficiente.
gl: O pensamento lóxico é importante. Utilizo a lóxica para resolver problemas e tomar decisións de maneira máis eficiente.
it: O pensamento lógico é importante. Utilizo a lógica para resolver problemas e tomar decisões de maneira mais eficiente.
pt: O pensamento lógico é importante. Utilizo a lógica para resolver problemas e tomar decisões de maneira mais eficiente.
tr: Mantıksal düşünme önemlidir. Problemleri çözmek ve kararları daha verimli bir şekilde almak için mantığı kullanırım.

source: Logical thinking is crucial. I rely on logic to analyze complex situations and find effective solutions.
ca: El pensament lògic és crucial. Confio en la lògica per analitzar situacions complexes i trobar solucions efectives.
es: El pensamiento lógico es crucial. Confío en la lógica para analizar situaciones complejas y encontrar soluciones efectivas.
gl: O pensamento lóxico é crucial. Confío na lóxica para analizar situacións complexas e atopar solucións efectivas.
it: Il pensiero logico è importante. Utilizzo la logica per risolvere problemi e prendere decisioni in modo più efficiente.
pt: O pensamento lógico é crucial. Confio na lógica para analisar situações complexas e encontrar soluções efetivas.
tr: Mantıksal düşünme kritik öneme sahiptir. Karmaşık durumları analiz etmek ve etkili çözümler bulmak için mantığa güvenirim.

source: Logical thinking is absolutely vital. All code must follow strict logic for problem-solving.
ca: El pensament lògic és absolutament vital. Tot el codi ha de seguir una lògica estricta per resoldre problemes.
es: El pensamiento lógico es absolutamente vital. Todo el código debe seguir una lógica estricta para resolver problemas.
gl: O pensamento lóxico é absolutamente vital. Todo o código debe seguir unha lóxica estrita para resolver problemas.
it: Il pensiero logico è assolutamente vitale. Tutto il codice deve seguire una logica rigorosa per risolvere i problemi.
pt: O pensamento lógico é absolutamente vital. Todo o código deve seguir uma lógica estrita para resolver problemas.
tr: Mantıksal düşünme kesinlikle hayati öneme sahiptir. Tüm kodun problem çözme için sıkı bir mantığa uyması gerekir.

source: Synchronization is not relevant at this moment. I am not concerned about coordinating activities in the code.
ca: La sincronització no és rellevant en aquest moment. No em preocupa coordinar activitats en el codi.
es: La sincronización no es relevante en este momento. No me preocupa coordinar actividades en el código.
gl: A sincronización non é relevante neste momento. Non me preocupa coordinar actividades no código.
it: La sincronizzazione non è rilevante in questo momento. Non mi preoccupa coordinare le attività nel codice.
pt: A sincronização não é relevante neste momento. Não estou preocupado em coordenar atividades no código.
tr: Senkranizasyon şu anda benim için önemli değil. Kodda aktiviteleri koordine etmekle ilgilenmiyorum.

source: Synchronization is minimal. I do not consider managing concurrency or process synchronization crucial.
ca: La sincronització és mínima. No considero crucial gestionar la concurrència o la sincronització de processos.
es: La sincronización es mínima. No considero crucial manejar la concurrencia o la sincronización de procesos.
gl: A sincronización é mínima. Non considero crucial xestionar a concorrencia ou a sincronización de procesos.
it: La sincronizzazione è minima. Non considero cruciale gestire la concorrenza o la sincronizzazione dei processi.
pt: A sincronização é mínima. Não considero crucial gerir a concorrência ou a sincronização de processos.
tr: Senkranizasyon minimaldir. Eşzamanlılık veya süreç senkronizasyonunu yönetmenin önemli olduğunu düşünmüyorum.

source: Synchronization has some importance. I can allow some operations to run asynchronously.
ca: La sincronització té certa importància. Puc permetre que algunes operacions s'executin de forma asincrònica.
es: La sincronización tiene cierta importancia. Puedo permitir que algunas operaciones se ejecuten de forma asincrónica.
gl: A sincronización ten certa importancia. Podo permitir que algunhas operacións se executen de forma asíncrona.
it: La sincronizzazione ha una certa importanza. Posso consentire che alcune operazioni vengano eseguite in modo asincrono.
pt: A sincronização tem certa importância. Posso permitir que algumas operações sejam executadas de forma assíncrona.
tr: Senkranizasyonun bazı önemi var. Bazı işlemlerin eşzamanlı olarak çalışmasına izin verebilirim.

source: Synchronization is important. It is crucial to ensure that shared resources are handled correctly.
ca: La sincronització és important. És crucial assegurar que els recursos compartits es gestionin correctament.
es: La sincronización es importante. Es crucial asegurar que los recursos compartidos se manejen correctamente.
gl: A sincronización é importante. É crucial asegurar que os recursos compartidos se xestionen correctamente.
it: La sincronizzazione è importante. È cruciale garantire che le risorse condivise vengano gestite correttamente.
pt: A sincronização é importante. É crucial assegurar que os recursos compartilhados sejam gerenciados corretamente.
tr: Senkranizasyon önemlidir. Paylaşılan kaynakların doğru şekilde yönetilmesini sağlamak kritik öneme sahiptir.

source: Synchronization is crucial. It is essential to control concurrency to ensure data consistency and integrity in the code.
ca: La sincronització és crucial. És essencial controlar la concurrència per garantir la consistència i integritat de les dades en el codi.
es: La sincronización es crucial. Es esencial controlar la concurrencia para garantizar la consistencia e integridad de los datos en el código.
gl: A sincronización é crucial. É esencial controlar a concorrencia para garantir a consistencia e integridade dos datos no código.
it: La sincronizzazione è cruciale. È essenziale controllare la concorrenza per garantire la coerenza e l'integrità dei dati nel codice.
pt: A sincronização é crucial. É essencial controlar a concorrência para garantir a consistência e integridade dos dados no código.
tr: Senkranizasyon kritik öneme sahiptir. Veri tutarlılığını ve bütünlüğünü sağlamak için eşzamanlılığı kontrol etmek gereklidir.

source: Synchronization is absolutely vital. Efficient concurrency is fundamental for system performance and reliability.
ca: La sincronització és absolutament vital. La concurrència eficient és fonamental per al rendiment i la fiabilitat del sistema.
es: La sincronización es absolutamente vital. La concurrencia eficiente es fundamental para el rendimiento y la fiabilidad del sistema.
gl: A sincronización é absolutamente vital. A concorrencia eficiente é fundamental para o rendemento e a fiabilidade do sistema.
it: La sincronizzazione è assolutamente vitale. Una concorrenza efficiente è fondamentale per le prestazioni e l'affidabilità del sistema.
pt: A sincronização é absolutamente vital. A concorrência eficiente é fundamental para o desempenho e a confiabilidade do sistema.
tr: Senkranizasyon kesinlikle hayati öneme sahiptir. Verimli eşzamanlılık, sistem performansı ve güvenilirliği için temeldir.

source: Flow control is not relevant at this moment. I do not need control structures to direct code execution.
ca: El control de flux no és rellevant en aquest moment. No necessito estructures de control per dirigir l'execució del codi.
es: El control de flujo no es relevante en este momento. No necesito estructuras de control para dirigir la ejecución del código.
gl: O control de fluxo non é relevante neste momento. Non necesito estruturas de control para dirixir a execución do código.
it: Controllo del flusso non è rilevante in questo momento. Non ho bisogno di strutture di controllo per dirigere l'esecuzione del codice.
pt: O controle de fluxo não é relevante neste momento. Não necessito de estruturas de controle para direcionar a execução do código.
tr: Akış kontrolü şu anda benim için geçerli değil. Kodun yürütülmesini yönlendirmek için kontrol yapılarına ihtiyacım yok.

source: Flow control is minimal. I prefer to follow a more linear approach in code execution without many control structures.
ca: El control de flux és mínim. Prefereixo seguir un enfocament més lineal en l'execució del codi sense moltes estructures de control.
es: El control de flujo es mínimo. Prefiero seguir un enfoque más lineal en la ejecución del código sin muchas estructuras de control.
gl: O control de fluxo é mínimo. Prefiro seguir un enfoque máis linear na execución do código sen moitas estruturas de control.
it: Il controllo del flusso è minimo. Preferisco seguire un approccio più lineare nell'esecuzione del codice senza molte strutture di controllo.
pt: O controle de fluxo é mínimo. Prefiro seguir uma abordagem mais linear na execução do código sem muitas estruturas de controle.
tr: Akış kontrolü minimum seviyede. Kod yürütülmesinde çok fazla kontrol yapısı olmadan daha lineer bir yaklaşımı tercih ediyorum.

source: Flow control has some importance. I can manage code execution with a few basic control structures.
ca: El control de flux té certa importància. Puc gestionar l'execució del codi amb algunes estructures de control bàsiques.
es: El control de flujo tiene cierta importancia. Puedo gestionar la ejecución del código con algunas estructuras de control básicas.
gl: O control de fluxo ten certa importancia. Podo xestionar a execución do código con algunhas estruturas de control básicas.
it: Il controllo del flusso ha una certa importanza. Posso gestire l'esecuzione del codice con alcune strutture di controllo di base.
pt: O controle de fluxo tem certa importância. Posso gerenciar a execução do código com algumas estruturas de controle básicas.
tr: Akış kontrolü bazı önem taşır. Kod yürütülmesini birkaç temel kontrol yapısı ile yönetebilirim.

source: Flow control is important. Code execution must be directed and decisions made based on different conditions.
ca: El control de flux és important. L'execució del codi ha de ser dirigida i les decisions preses en funció de diferents condicions.
es: El control de flujo es importante. La ejecución del código debe ser dirigida y las decisiones tomadas en función de diferentes condiciones.
gl: O control de fluxo é importante. A execución do código debe ser dirixida e as decisións tomadas en función de diferentes condicións.
it: Il controllo del flusso è importante. L'esecuzione del codice deve essere diretta e le decisioni devono essere prese in base a diverse condizioni.
pt: O controle de fluxo é importante. A execução do código deve ser direcionada e as decisões tomadas com base em diferentes condições.
tr: Akış kontrolü önemlidir. Kod yürütülmesi yönlendirilmelidir ve farklı koşullara dayanarak kararlar verilmelidir.

source: Flow control is crucial. Ensuring logic and coherence of program execution flow is necessary.
ca: El control de flux és crucial. És necessari assegurar la lògica i coherència del flux d'execució del programa.
es: El control de flujo es crucial. Es necesario asegurar la lógica y coherencia del flujo de ejecución del programa.
gl: O control de fluxo é crucial. É necesario asegurar a lóxica e coherencia do fluxo de execución do programa.
it: Controllo del flusso è cruciale. Garantire la logica e la coerenza del flusso di esecuzione del programma è necessario.
pt: O controle de fluxo é crucial. É necessário garantir a lógica e coerência do fluxo de execução do programa.
tr: Akış kontrolü kritik öneme sahiptir. Program yürütme akışının mantıklı ve uyumlu olmasını sağlamak gereklidir.

source: Flow control is absolutely vital. Proper flow control management determines the efficiency and effectiveness of the program.
ca: El control de flux és absolutament vital. La gestió adequada del control de flux determina l'eficiència i efectivitat del programa.
es: El control de flujo es absolutamente vital. La gestión adecuada del control de flujo determina la eficiencia y efectividad del programa.
gl: O control de fluxo é absolutamente vital. A xestión adecuada do control de fluxo determina a eficiencia e efectividade do programa.
it: Controllo del flusso è assolutamente vitale. Una corretta gestione del controllo del flusso determina l'efficienza e l'efficacia del programma.
pt: O controle de fluxo é absolutamente vital. A gestão adequada do controle de fluxo determina a eficiência e eficácia do programa.
tr: Akış kontrolü tamamen hayati önemdedir. Doğru akış kontrolü yönetimi, programın verimliliğini ve etkinliğini belirler.

source: User interactivity is not relevant at this moment. I do not need the code to respond to user input.
ca: La interactivitat de l'usuari no és rellevant en aquest moment. No necessito que el codi respongui a l'entrada de l'usuari.
es: La interactividad del usuario no es relevante en este momento. No necesito que el código responda a la entrada del usuario.
gl: La interactividade do usuario non é relevante neste momento. Non necesito que o código responda á entrada do usuario.
it: L'interattività dell'utente non è rilevante in questo momento. Non ho bisogno che il codice risponda all'input dell'utente.
pt: A interatividade do usuário não é relevante neste momento. Não preciso que o código responda à entrada do usuário.
tr: Kullanıcı etkileşimi şu anda ilgili değil. Kodun kullanıcı girişlerine yanıt vermesi gerekmiyor.

source: User interactivity is minimal. The code does not require much direct interaction with the user.
ca: La interactivitat de l'usuari és mínima. El codi no requereix molta interacció directa amb l'usuari.
es: La interactividad del usuario es mínima. El código no requiere mucha interacción directa con el usuario.
gl: La interactividade do usuario é mínima. O código non require moita interacción directa co usuario.
it: L'interattività dell'utente è minima. Il codice non richiede molta interazione diretta con l'utente.
pt: A interatividade do usuário é mínima. O código não requer muita interação direta com o usuário.
tr: Kullanıcı etkileşimi minimal. Kodun kullanıcı ile doğrudan etkileşime geçmesi gerekmiyor.

source: User interactivity has some importance. The code can be executed without too much direct user interaction.
ca: La interactivitat de l'usuari té certa importància. El codi pot executar-se sense molta interacció directa de l'usuari.
es: La interactividad del usuario tiene cierta importancia. El código puede ejecutarse sin mucha interacción directa del usuario.
gl: A interactividade do usuario ten certa importancia. O código pode executarse sen moita interacción directa do usuario.
it: L'interattività dell'utente ha una certa importanza. Il codice può essere eseguito senza troppa interazione diretta dell'utente.
pt: A interatividade do usuário tem certa importância. O código pode ser executado sem muita interação direta do usuário.
tr: Kullanıcı etkileşimi bazı önem taşıyor. Kod, çok fazla doğrudan kullanıcı etkileşimi olmadan da çalışabilir.

source: User interactivity is important. The code must respond appropriately to user actions.
ca: La interactivitat de l'usuari és important. El codi ha de respondre adequadament a les accions de l'usuari.
es: La interactividad del usuario es importante. El código debe responder adecuadamente a las acciones del usuario.
gl: A interactividade do usuario é importante. O código debe responder axeitadamente ás accións do usuario.
it: L'interattività dell'utente è importante. Il codice deve rispondere adeguatamente alle azioni dell'utente.
pt: A interatividade do usuário é importante. O código deve responder adequadamente às ações do usuário.
tr: Kullanıcı etkileşimi önemlidir. Kod, kullanıcı eylemlerine uygun bir şekilde yanıt vermelidir.

source: User interactivity is crucial. The code must be highly interactive with quick response to user actions.
ca: La interactivitat de l'usuari és crucial. El codi ha de ser altament interactiu amb una resposta ràpida a les accions de l'usuari.
es: La interactividad del usuario es crucial. El código debe ser altamente interactivo con una respuesta rápida a las acciones del usuario.
gl: A interactividade do usuario é crucial. O código debe ser altamente interactivo cunha resposta rápida ás accións do usuario.
it: L'interattività dell'utente è cruciale. Il codice deve essere altamente interattivo con una risposta rapida alle azioni dell'utente.
pt: A interatividade do usuário é crucial. O código deve ser altamente interativo com uma resposta rápida às ações do usuário.
tr: Kullanıcı etkileşimi çok önemlidir. Kod, kullanıcı eylemlerine hızlı bir şekilde yanıt verecek şekilde yüksek derecede etkileşimli olmalıdır.

source: User interactivity is absolutely vital. The ability to interact effectively with the user is fundamental.
ca: La interactivitat de l'usuari és absolutament vital. La capacitat d'interactuar de manera efectiva amb l'usuari és fonamental.
es: La interactividad del usuario es absolutamente vital. La capacidad de interactuar de manera efectiva con el usuario es fundamental.
gl: A interactividade do usuario é absolutamente vital. A capacidade de interactuar de maneira efectiva co usuario é fundamental.
it: L'interattività dell'utente è assolutamente vitale. La capacità di interagire efficacemente con l'utente è fondamentale.
pt: A interatividade do usuário é absolutamente vital. A capacidade de interagir de maneira efetiva com o usuário é fundamental.
tr: Kullanıcı etkileşimi kesinlikle hayati öneme sahiptir. Kullanıcı ile etkili bir şekilde etkileşim kurabilme yeteneği temeldir.

source: Data representation is not crucial at this moment. It does not significantly affect code execution.
ca: La representació de dades no és crucial en aquest moment. No afecta significativament l'execució del codi.
es: La representación de datos no es crucial en este momento. No afecta significativamente la ejecución del código.
gl: La representación dos datos non é crucial neste momento. Non afecta significativamente á execución do código.
it: La rappresentazione dei dati non è cruciale in questo momento. Non influisce significativamente sull'esecuzione del codice.
pt: A representação dos dados não é crucial neste momento. Não afeta significativamente a execução do código.
tr: Veri temsili bu anda kritik değil. Kodun çalışmasını önemli ölçüde etkilemez.

source: Data representation is minimal. A complex structure for storing or manipulating data is not required.
ca: La representació de dades és mínima. No es requereix una estructura complexa per emmagatzemar o manipular dades.
es: La representación de datos es mínima. No se requiere una estructura compleja para almacenar o manipular datos.
gl: La representación dos datos é mínima. Non se require unha estrutura complexa para almacenar ou manipular datos.
it: La rappresentazione dei dati è minima. Non è richiesta una struttura complessa per memorizzare o manipolare i dati.
pt: A representação dos dados é mínima. Não se requer uma estrutura complexa para armazenar ou manipular dados.
tr: Veri temsili minimum düzeyde. Verileri depolamak veya işlemek için karmaşık bir yapı gerekmiyor.

source: Data representation has some importance. Basic structures are needed to manage the data.
ca: La representació de dades té certa importància. Es necessiten estructures bàsiques per gestionar les dades.
es: La representación de datos tiene cierta importancia. Se necesitan estructuras básicas para gestionar los datos.
gl: La representación dos datos ten certa importancia. Necesítanse estruturas básicas para xestionar os datos.
it: La rappresentazione dei dati ha una certa importanza. Sono necessarie strutture di base per gestire i dati.
pt: La representación dos datos tem certa importancia. Necessitam-se estruturas básicas para gerenciar os dados.
tr: Veri temsili biraz önemlidir. Verileri yönetmek için temel yapıların kullanılması gereklidir.
