Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: <input name='zipFile' type='file' class='filestyle' data-buttonText='Choose Project'>
ca: <input name='zipFile' type='file' class='filestyle' data-buttonText='Tria Projecte'>
es: <input name='zipFile' type='file' class='filestyle' data-buttonText='Elige Proyecto'>
gl: <input name='zipFile' type='file' class='filestyle' data-buttonText='Escoller proxecto'>
it: <input name='zipFile' type='file' class='filestyle' data-buttonText='Scegli il progetto'>
pt: <input name='zipFile' type='file' class='filestyle' data-buttonText='Escolha Projeto'>
tr: <input name='zipFile' type='file' class='filestyle' data-buttonText='Projeyi Seç'>

source: Analyze my project
ca: Analitza el meu projecte
es: Analiza mi proyecto
gl: Analiza o meu proxecto
it: Analizza il mio progetto
pt: Analise seus projetos Scratch
tr: Projemi analiz et

source: Error! Please choose a .sb or .sb2 file or input an url
ca: Error! Si us plau tria un fitxer .sb o .sb2 o afegeix una url
es: ¡Error! Por favor elige un fichero .sb o .sb2 o pon una url
gl: Erro! Por favor elixe un ficheiro .sb ou .sb2 ou introduce unha url
it: Errore! Per favore scegli un file di tipo .sb o .sb2 o scrivi un url
pt: Erro! Por favor, escolha um arquivo .sb ou .sb2 ou então entre com uma url
tr: Hata! Lütfen bir .sb veya .sb2 dosyası seçin veya bir URL girin.

source: Error! Your project id is wrong
ca: Error! L'identificador del teu projecte és incorrecte
es: ¡Error! El identificador de tu proyecto es incorrecto
gl: Erro! A id do teu proxecto é inorrecta.
it: Errore! L'ID del tuo progetto non è corretto
pt: Erro! O identificador do projeto está errado
tr: Hata! Proje kimliğiniz yanlış.

source: Error! Your project doesn't exist in Scratch's servers
ca: Error! El teu projecte no existeix en els servidors de Scratch
es: ¡Error! Tu proyecto no existe en los servidores de Scratch
gl: Erro! O teu proxecto non existe nos servidores de Scratch
it: Errore! Il tuo progetto non esiste nei server di Scratch
pt: Erro! Seu projeto não existe nos servidores do Scratch
tr: Hata! Projeniz Scratch sunucularında bulunamadı.

source: Change my password
ca: Canviar contrasenya
es: Cambiar contraseña
gl: Cambiar contrasinal
it: Cambia la mia password
pt: Alterar senha
tr: Şifremi Değiştir

source: Photo
ca: Foto
es: Foto
gl: Foto
it: Foto
pt: Foto
tr: Fotoğraf

source: <input name='img' type='file' class='filestyle' data-buttonText='Choose img'>
ca: <input name='csvFile' type='file' class='filestyle' data-buttonText='Tria el fitxer .csv'>
es: <input name='img' type='file' class='filestyle' data-buttonText='Elige imagen'>
it: <input name='img' type='file' class='filestyle' data-buttonText='Scegli immagine'>
pt: <input name='img' type='file' class='filestyle' data-buttonText='Escolha Projeto'>
tr: <input name='img' type='file' class='filestyle' data-buttonText='img'yi seçin'>

source: Change my photo
ca: Canviar foto
es: Cambiar mi foto
gl: Cambiar a miña foto
it: Cambia la mia foto
pt: Alterar foto
tr: Fotoğrafımı değiştir

source: Statistics
ca: Estadístiques
es: Estadísticas
gl: Estatísticas
it: Statistiche
pt: Estatísitcas
tr: İstatistik

source: What do you think about Dr. Scratch?
es: ¿Qué piensas de Dr. Scratch?
it: Cosa pensi di Dr Scratch?
tr: Dr. Scratch hakkında ne düşünüyorsunuz?

source: Leave your comment
es: Deja un comentario
it: Lascia un commento
tr: Yorumunuzu bırakın

source: Sign up or sign in
es: Regístrate o identifícate
it: Registrati o fai il login
tr: Kaydolun veya giriş yapın

source: Tell us what do you think about Dr. Scratch, your thoughts, suggestions,etc...
es: Cuentanos que piensas de Dr. Scratch, tus ideas, sugerencias, etc...
it: Parlaci di cosa ne pensi di Dr Scratch, i tuoi pensieri, suggerimenti, etc...
tr: Dr. Scratch hakkında ne düşündüğünüzü, görüşlerinizi, önerilerinizi,vb. yazın...

source: says..
es: dice..
it: dire...

source: Hi
es: Hola
it: Ciao

source: Message
es: Mensaje
it: Messaggio

source: Send
ca: Envia
es: Enviar
it: Invia
pt: Enviar

source: Error
it: Errore
pt: Erro
tr: Hata

source: ERROR 404 - Page Not Found
ca: ERROR 404 - Pàgina No Trobada
es: 404 - Página No Encontrada
gl: ERRO 404 - Páxina non atopada
it: ERRORE 404 - Pagina non trovata
pt: ERRO 404 - Página não encontrada
tr: HATA 404 - Sayfa Bulunamadı

source: Ops! This page doesn't exist
ca: Vaja! Aquesta pàgina no existeix
es: Ops! Esta página no existe
gl: Ops! Esta páxina non existe
it: Ops! Questa pagina non esiste
pt: Opa! Esta página não existe
tr: Ops! Bu sayfa mevcut değil

source: Get Started
ca: Començar
es: Empezar
gl: Comezar
it: Iniziamo
pt: Início
tr: Başlayın

source: ©2024 Dr.Scratch Made with
ca: ©2024 Dr.Scratch Fet amb
gl: ©2024 Dr.Scratch Feito con
it: ©2024 Dr.Scratch Realizzato con
pt: ©2024 Dr.Scratch Feito com
tr: ©2024 Dr. Scratch Yapıldı with

source: by
ca: per l'
gl: pola
it: da
pt: pela
tr: tarafından

source: Dr.Scratch Team.
ca: Equip de Dr.Scratch.
gl: Equip de Dr.Scratch.
it: Team di Dr. Scratch.
pt: Equipe do Dr.Scratch.
tr: Dr. Scratch Ekibi.

source: 500 - Internal Server Error
ca: 500 - Error Intern del Servidor
es: 500-Error Interno del Servidor
gl: 500 - Erro interno do servidor
it: 500 - Errore Interno del Server
pt: 500 - Erro interno do servidor
tr: 500 - Sunucu Hatası

source: We apologize for this inconvenience
ca: Sentim les molèsties
es: Sentimos las molestias
gl: Desculpa as molestias
it: Ci scusiamo per l'inconveniente
pt: Pedimos desculpas pela inconveniência
tr: Bu rahatsızlıktan dolayı özür dileriz

source: There was an error analyzing your project
ca: Ha hagut un error analitzant el teu projecte
es: Hubo un error analizando tu proyecto
gl: Houbo un erro analizando teu proxecto
it: Si è verificato un errore durante l'analisi del tuo progetto
pt: Ocorreu um erro durante a análise de seu projeto
tr: Projenizi analiz ederken bir hata oluştu

source: Sometimes we have got problems analyzing some projects. We're working on this.
ca: De vegades tenim problemes analitzant determinats projectes. Hi estem treballant.
es: Algunas veces tenemos problemas analizando determinados proyectos. Estamos trabajando en ello.
gl: Ás veces temos problemas analizando algúns proxectos. Estamos a traballar niso.
it: A volte abbiamo problemi analizzando alcuni progetti. Stiamo lavorando a questo.
pt: Às vezes, encontramos erros ao analisar alguns projetos. Nós estamos trabalhos para melhorar isso.
tr: Bazen bazı projeleri analiz ederken sorunlar yaşıyoruz. Bunun üzerinde çalışıyoruz.

source: This name already exists. Choose another, please.
ca: Aquest nom ja existeix. Escull-ne un altre, si us plau.
es: Ese nombre ya existe. Elige otro, por favor.
it: Questo nome esiste già. Scegline un altro, per favore.
pt: Esse usuário já existe. Escolha outro, por favor.
tr: Bu isim zaten mevcut. Lütfen başka bir tane seçin.

source: This email already exists. Choose another, please.
ca: Aquest correu electrònic ja existeix. Tria'n un altre, si us plau.
es: Ese email ya existe. Elige otro, por favor.
it: Questa email esiste già. Scegline un'altra, per favore.
pt: Esse e-mail já foi cadastrado. Escolha outro, por favor.
tr: Bu e-posta zaten mevcut. Lütfen başka bir tane seçin.

source: This hash doesn't exist.
ca: Aquesta clau de pas no existeix.
es: Esa clave no existe.
gl: Ops! Esta páxina non existe
it: Questo codice di controllo non esiste.
pt: Esse código não existe
tr: Bu hash mevcut değil.

source: You must to complete all fields.
ca: Cal que completis tots els camps correctament.
es: Debes completar todos los campos correctamente.
it: Devi completare tutti i campi.
pt: Você deve completar todos os campos.
tr: Tüm alanları doldurmanız gerekiyor.

source: The password and the password confirmation must be the same.
es: Las dos contraseñas no coinciden.
it: La password e la password di conferma devono essere identiche.
tr: Şifre ve şifre onayı aynı olmalıdır.

source: The email and the email confirmation must be the same..
es: Los dos emails deben coincidir.
it: La email e la conferma della email devono essere identiche.
tr: E-posta ve e-posta onayı aynı olmalıdır.

source: Retry
ca: Torna-ho a intentar
es: Reintentar
it: Riprova
pt: Repetir
tr: Yeniden dene

source: The ability of abstraction and decomposition of problems helps you to <b>break a problem into smaller parts that are easier to understand, program and debug.</b>
ca: La capacitat d'abstracció i descomposició de problemes t'ajuda a <b> dividir un problema en parts més petites que seran més fàcils de comprendre, programar i depurar.</b>
es: La capacidad de abstracción y descomposición de problemas te ayuda a <b>dividir un problema en partes más pequeñas que serán más fáciles de comprender, programar y depurar.</b>
gl: A habilidade de abstracción e descomposición de problemas axúdate a <b>dividir o problema en partes máis pequenas que che son máis fáciles de entender, programar e depurar</b>.
it: La capacità di astrazione e di decomposizione dei problemi ti aiuta a <b>suddividere un problema in parti più piccole che sono più facili da comprendere, programmare e verificare con il debug.</b>
pt: A habilidade de abstrair e decompor problemas lhe ajuda a <b>quebrar um problema em partes menores, mais fáceis de entender, a programar e depurar (corrigir os erros).</b>
tr: Soyutlama ve problemleri ayrıştırma yeteneği, bir problemi <b>anlaması, programlaması ve hata ayıklaması daha kolay olan daha küçük parçalara ayırmanıza</b> yardımcı olur.

source: If you get 0 points...
ca: Si has tret 0 punts...
es: Si has sacado 0 puntos...
gl: Se obtés 0 puntos...
it: Se ottieni 0 punti...
pt: Se você não ganha nenhum ponto...
tr: 0 puan alırsanız...

source: When you start programming with Scratch, sometimes it may seem that the simplest solution is to program all the behavior of a character in a single program. However, <b>ideally is that character behavior is controlled by different programs and each of these programs deal with a particular issue</b>. Here's an example:
ca: Quan es comença a programar amb Scratch, de vegades pot semblar que la solució més senzilla és programar tot el comportament d'un personatge en un únic programa. Tot i això, <b> el millor és que el comportament del personatge estigui controlat per diferents programes i que cada un d'aquests programes s'ocupi d'una qüestió concreta. </b> Vegem un exemple:
es: Cuando se comienza a programar con Scratch, en ocasiones puede parecer que la solución más sencilla es programar todo el comportamiento de un personaje en un único programa. Sin embargo, <b>lo ideal es que el comportamiento del personaje sea controlado por diferentes programas y que cada uno de estos programas se ocupe de una cuestión concreta.</b> Veamos un ejemplo:
gl: Cando empezas a programar con Scratch, ás veces pode parecer que a solución máis sinxela é programar todo o comportamento dun personaxe nun só programa. Entón, o <b>ideal é que o comportamento dese personaxe sexa controlado por diferentes programas e que cada un destes programas trate dun aspecto particular</b>. Aquí tes un exemplo:
it: Quando inizi a programmare con Scratch, a volte può sembrare che la soluzione più semplice sia quella di programmare tutto il comportamento di uno sprite in un singolo script. Tuttavia, <b>idealmente il comportamento dello sprite può essere controllato da diversi script, ognuno di questi script si occupa di un particolare problema</b>. Ecco un esempio:
pt: Quando você começa a programar com Scracth, às vezes, parece que asolução mais simples é programar todo o comportamento de um personagem em um único programa. Entretanto, <b>o melhor é que o comportamento do personagem seja controlado por diferentes programas e que cada um deles cuide de uma questão particular </b>. Aqui tem um exemplo:
tr: Scratch ile programlamaya başladığınızda, bazen en basit çözümün bir karakterin tüm davranışını tek bir programda kodlamak olduğunu düşünebilirsiniz. Ancak, <b>ideal olarak, karakter davranışının farklı programlar tarafından kontrol edilmesi ve her bir programın belirli bir konuyu ele almasıdır</b>. İşte bir örnek:

source: when green flag clicked
ca: quan la bandera verda es premi
es: al presionar bandera verde
gl: Ao premer en ⚑
it: quando si clicca sulla bandiera verde
pt: Quando alguém clicar na bandeira verde

source: clear
ca: esborra-ho tot
es: borrar todo
gl: borrar todos
it: pulisci
pt: apaga tudo do palco

source: go to x:(-100) y:(30)
ca: vés a x:(-100) y:(30)
es: ir a x:(-100) y:(30)
gl: ir a x:(-100) y:(30)
it: vai a x:(-100) y:(30)
pt: vai para a posição x:(-100) y:(30)

source: pen down
ca: baixa el llapis
es: bajar lápiz
gl: baixar o lapis
it: penna giù
pt: baixa a tua caneta

source: move (200) steps
ca: mou-te (200) passos
es: mover (10) pasos
gl: mover (200) pasos
it: fai (200) passi
pt: anda (200) passos

source: pen up
ca: puja el llapis
es: subir lápiz
gl: subir o lapis
it: penna su
pt: levanta a tua caneta

source: wait (1) secs
ca: espera (1) segons
es: esperar (1) segundos
gl: agardar (1) segundos
it: attendi (1) secondi
pt: espera (1) s

source: go to x:(-44) y:(-24)
ca: vés a x:(-44) y:(-24)
es: ir a x:(-44) y:(-24)
gl: ir a x:(-44) y:(-24)
it: vai a x:(-44) y:(-24)
pt: vai para a posição x:(-44) y:(-24)

source: set pen color to [#FFA500]
ca: fixa el color del llapis a [#FFA500]
es: fijar color de lápiz a [#FFA500]
gl: usar un lapis de cor [#FFA500]
it: porta colore penna a [#FFA500]
pt: altera a cor da tua caneta para [#FFA500]

source: move (100) steps
ca: mou-te (100) passos
es: mover (100) pasos
gl: mover (100) pasos
it: fai (100) passi
pt: anda (100) passos

source: This project, which paints a picture on the screen, has been programmed in a single program that draws the two lines that make up the drawing. Although it is a valid option, a simpler option to program and maintain the program is divided into two parts, so that we have two different programs, one to paint the front and another to paint the second:
ca: Aquest projecte pinta una imatge en la pantalla. Ha estat programat en un sol programa que dibuixa les dues línies que formen el dibuix. Encara que és una opció vàlida, una de més senzilla de programar i de mantenir és dividir el programa en dues parts, de manera que tinguem dos programes diferents, un per pintar la primera línia i un altre per pintar la segona:
es: Este proyecto, que pinta un dibujo en la pantalla, ha sido programado en un único programa que dibuja las dos líneas que componen el dibujo. Aunque es una opción válida, una opción más sencilla de programar y de mantener es dividir el programa en dos partes, de forma que tengamos dos programas diferentes, uno para pintar la primera línea y otro para pintar la segunda:
gl: Este proxecto, que fai un debuxo na pantalla, foi codificado nun so programa que debuxa as dúas liñas que constitúen o debuxo. Aínda que esa é unha opción válida, outra máis sinxela para codificar e manter o programa é dividilo en dúas partes, de xeito que teñamos dous programas diferentes, un para debuxar a primeira liña e outro para a segunda:
it: Questo progetto, che fa un disegno sullo schermo, è stato programmato in un unico script che traccia le due righe che compongono il disegno. Anche se è un'opzione valida, un'alternativa più semplice per programmare e mantenere il programma è dividere lo script in due parti, per cui abbiamo due diversi script, uno per tracciare la riga in alto e uno script per tracciare la seconda riga:
pt: Este projeto, que pinta um desenho na tela, foi codificado em um programa único, que desenha as duas linhas. Embora seja uma opção válida, é mais siples programar e manter um programa que seja dividido em duas partes. Assim, teremos dois programas diferentes: um que desenha a primeira e outro que desenha a segunda.
tr: Ekranda bir resim çizen bu proje, resmi oluşturan iki çizgiyi çizen tek bir programda programlanmıştır. Bu geçerli bir seçenek olmakla birlikte, programı daha basit bir şekilde programlamak ve bakımını yapmak için programı iki parçaya bölmek daha iyi bir seçenektir; böylece bir ön planı ve diğerini arka planı çizen iki farklı programımız olur:

source: Thus, if we make any changes eg in one of the lines drawn, it is much easier to know which part of the program we need to go to carry out the changes.
ca: Per tant, si fem algun canvi, per exemple en una de les línies traçades, és molt més fàcil saber quina part del programa necessitem per dur a terme els canvis.
es: De este modo, si queremos por ejemplo realizar alguna modificación en una de las líneas dibujadas, es mucho más sencillo saber a qué parte del programa tenemos que dirigirnos para llevar a cabo los cambios.
gl: Polo tanto, se facemos cambios por exemplo nunha das liñas, é moito máis sinxelo saber en que parte do programa temos que introducir os cambios.
it: Pertanto, se facciamo qualche cambiamento, ad esempio in una delle linee disegnate, è molto più facile sapere in quale parte dello script occorre apportare le modifiche.
pt: Então, se precisarmos mudar alguma coisa, por exemplo, em uma das linhas, ficará muito mais fácil saber em que parte do programa teremos que fazer as alterações.
tr: Böylece, örneğin çizilen çizgilerden birinde değişiklik yaparsak, değişiklikleri yapmak için hangi program parçasına gitmemiz gerektiğini bilmek çok daha kolay olur.

source: If you get 1 point...
ca: Si has tret 1 punt...
es: Si has sacado 1 punto...
gl: Se obtés 1 punto...
it: Se ottieni 1 punto...
pt: Se você ganha 1 ponto...
tr: 1 puan alırsanız...

source: Scratch allows new user-defined blocks that consist of a sequence of instructions. These abstractions allow you to create simple programs to read, program and maintain. Here's an example:
ca: Scratch permet crear nous blocs definits pels usuaris que es componen d'una seqüència d'instruccions. Aquestes abstraccions permeten crear programes més senzills de llegir, de programar i de mantenir. Vegem un exemple:
es: Scratch permite crear nuevos bloques definidos por los usuarios que se componen de una secuencia de instrucciones. Estas abstracciones permiten crear programas más sencillos de leer, de programar y de mantener. Veamos un ejemplo:
gl: Scratch permite novos bloques definidos polo usuario que consisten nunha secuencia de instruccións. Estas abstracción permítenche crear programas fáciles de ler, codificar e manter. Aquí tes un exemplo:
it: Scratch consente di creare nuovi blocchi definiti dall'utente che consistono in una sequenza di istruzioni. Queste astrazioni permettono di scrivere programmi semplici da leggere, programmare e mantenere. Ecco un esempio:
pt: Scratch permite que você crie novos blocos, que consistem em uma sequência de instruções. Essas abstrações permitem que você crie programas fáceis de ler, programar e manter. Aqui tem um exemplo:
tr: Scratch, bir dizi talimattan oluşan yeni kullanıcı tanımlı bloklar oluşturmanıza olanak tanır. Bu soyutlamalar, basit programlar oluşturmanızı, okumanızı, programlamanızı ve bakımını yapmanızı sağlar. İşte bir örnek:

source: go to x:(-200) y:(40)
ca: vés a x:(-200) y:(40)
es: ir a x:(-200) y:(40)
gl: ir a x:(-200) y:(40)
it: vai a x:(-200) y:(40)
pt: vai para a posição x:(-200) y:(40)

source: go to x:(-200) y:(0)
ca: vés a x:(-200) y:(0)
es: ir a x:(-200) y:(0)
gl: ir a x:(-200) y:(0)
it: vai a x:(-200) y:(0)
pt: vai para a posição x:(-200) y:(0)

source: This Scratch project draws two orange lines of different length on the screen. Rather than repeat the code 2 times, as shown in the example, you can define a <i>'DrawOrange'</i> block consisting of blocks that paint an orange line on the screen and that you can tell what is the length of the line. For this you go to the category 'More Blocks' and press the Create button a block:
ca: Aquest projecte Scratch dibuixa dues línies taronges de diferent llargada a la pantalla. En lloc de repetir el codi dues vegades, tal com veiem a l'exemple, és possible definir un bloc <i> "PintaTaronja" </i> que es compon dels blocs que pinten una línia taronja a la pantalla i al qual es pot indicar quina és la llargada de la línia. Per fer-ho cal anar a la categoria "Més Blocs" i fer clic damunt l'opció Crear un bloc:
es: Este proyecto Scratch dibuja dos líneas naranjas de diferente longitud en la pantalla. En lugar de repetir el código 2 veces, tal como vemos en el ejemplo, es posible definir un bloque <i>“PintaNaranja”</i> que se compone de los bloques que pintan una línea naranja en la pantalla y al que se le puede indicar cuál es la longitud de la línea. Para ello hay que irse a la categoría “Más Bloques” y pulsar en el botón Crear un bloque:
gl: Este proxecto de Scratch debuxa dúas liñas laranxa de diferente lonxitude na pantalla. Mellor que repetir o código 2 veces, como mostra o exemplo, podes definir o bloque 'DebuxaLaranxa' que conteña os bloques que debuxen unha liña laranxa na pantalla e aos que lles podas dicir a lonxitude da liña. Para iso vai á categoría ´Máis bloques' e pulsa o botón Crear un bloque.
it: Questo progetto Scratch disegna due linee arancioni di lunghezza diversa sullo schermo. Piuttosto che ripetere il codice 2 volte, come mostrato nell'esempio, puoi definire un blocco <i>'PaintedOrange'</i> costituito da istruzioni che disegnano una linea arancione sullo schermo e gli puoi indicare la lunghezza della linea. Per fare questo vai alla categoria 'Altri blocchi' e premi il pulsante Crea un blocco:
pt: Este projeto Scratch desenha na tela duas linhas de cor laranja, com diferentes tamanhos. Em vez de repetir o código 2 vezes, como mostrado no exemplo, você pode definir um bloco 'DesenhaLaranja' que é formado por blocos que desenham uma linha laranja e que permitem que você informe o tamanho da linha. Para fazer isso, você vai na categoria 'Mais Blocos' e pressiona o botão Criar um bloco:
tr: Bu Scratch projesi ekranda farklı uzunluklarda iki turuncu çizgi çizer. Örnekte gösterildiği gibi kodu 2 kez tekrar etmek yerine, ekranda bir turuncu çizgi çizen ve çizginin uzunluğunu belirtebileceğiniz bir <i>'DrawOrange'</i> bloğu tanımlayabilirsiniz. Bunun için 'Daha Fazla Blok' kategorisine gidin ve bir blok oluşturmak için Oluştur butonuna basın:

source: define PaintedOrange(length)
ca: defineix PintaTaronja(llargada)
es: definir PintaNaranja(longitud)
gl: definir DebuxaLaranxa(lonxitude)
it: definisci PaintedOrange(lunghezza)
pt: define PaintedOrange (comprimento)

source: move (length) steps
ca: mou-te (llargada) passos
es: mover (longitud) pasos
gl: mover (lonxitude) pasos
it: fai (lunghezza) passi
pt: anda (comprimento) passos

source: Having defined the block <i>'DrawOrange'</i> it can be used in any program of the project, as we see below:
ca: Una vegada definit el bloc <i> "PintaTaronja" </i> és possible utilitzar-lo en qualsevol programa del projecte, tal com veiem a continuació:
es: Una vez definido el bloque <i>“PintaNaranja”</i> es posible utilizarlo en cualquier programa del proyecto, tal como vemos a continuación:
gl: Unha vez difinido o bloque 'DebuxaLaranxa' podes usalo en calquera programa do proxecto, como se ve a continuación:
it: Avendo definito il blocco <i>'PaintedOrange'</i> è possibile usarlo in qualsiasi script del progetto, come vediamo qui di seguito:
pt: Depois de definir o bloco 'DesenhaLaranja', ele pode ser usado em qualquer program do projeto, como visto abaixo:
tr: <i>'DrawOrange'</i> bloğunu tanımladıktan sonra, bu bloğu projenin herhangi bir programında kullanabilirsiniz, aşağıda gördüğümüz gibi:
