Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: When you have blocks than modify character's feature, you should always have a program which, when the program begins, asigns the value that we want to start. For example, if it modifies the position of a character, we should have the block 'go to' under the block 'when green flag clicked', in order to place the character in its initial position.
ca: Quan tinguis blocs que modifiquen un atribut d'un personatge, sempre hauries de tenir un programa que quan comenci a executar el projecte assigni el valor amb el que volem que comenci. Per exemple, si es modifica la posició d'un personatge, hauríem de tenir un bloc "vés a" després de "quan la bandera verda es premi", per així col·locar el personatge en la seva posició inicial.
es: Cuando tengas bloques que modifiquen un atributo de un personaje, siempre deberías tener un programa que, al comenzar a ejecutar el proyecto, asigne el valor con el que queremos que comience. Por ejemplo, si se modifica la posición de un personaje, deberíamos tener un bloque “ir a” bajo “al pulsar la bandera verde”, para colocar al personaje en su posición inicial.
gl: Cando tes bloques que modifican un atributo dun personaxe, sempre deberías ter un programa que ao comezar a executar o proxecto asignara o valor co que queremos que comece. Por exemplo, se se modifica a posición dun personaxe, deberiamos ter un bloque "ir a" despois de "cando a bandeira verde é premida", para así colocar o personaxe na súa posición inicial.
it: Quando si dispone di blocchi che modificano le caratteristiche del personaggio, si dovrebbe sempre avere uno script che, quando il programma inizia, assegna il valore che vogliamo avere come predefinito. Ad esempio, se modifica la posizione di un personaggio, dovremmo avere il blocco 'vai a' sotto il blocco "quando si clicca sulla bandiera verde" per poter avere il personaggio nella sua posizione iniziale.
pt: Quando você tem blocos que modificam as características de uma personagem, você deve ter um código que, quando o programa se inicia, ajusta os valores iniciais. Por exemplo, se ele modifica a posição da personagem, nós devemos criar um código que, quando a bandeira verde for clicada, ajusta suas características de posição inicial.
tr: Karakterin özelliklerini değiştiren bloklarınız olduğunda, her zaman program başladığında istediğimiz değeri atayan bir programa sahip olmalısınız. Örneğin, bir karakterin konumunu değiştiriyorsanız, karakteri başlangıç konumuna yerleştirmek için 'when green flag clicked' bloğunun altına 'go to' bloğunu yerleştirmelisiniz.

source: when [right arrow v] key pressed //Not initialized correctly.
ca: quan la tecla [fletxa dreta v] es premi //No inicialitzat correctament.
es: al presionar tecla [flecha derecha v] //No inicializado correctamente.
gl: ao premer a tecla [frexa dereita v] //Non iniciar correctamente.
it: quando si preme il tasto [freccia destra v] //Inizializzazione non corretta.
pt: Quando alguém pressionar a tecla [seta para a direita v] // Inicializada incorretamente.

source: change x by (10)
ca: suma (10) a x
es: sumar a x (10)
gl: sumar (10) a x
it: cambia x di (10)
pt: adiciona (10) ao teu x

source: when [left arrow v] key pressed
ca: quan la tecla [fletxa esquerra v] es premi
es: al presionar tecla [flecha izquierda v]
gl: ao premer a tecla [frexa esquerda v]
it: quando si preme il tasto [freccia sinistra v]
pt: Quando alguém pressionar a tecla [seta para a esquerda v]

source: change x by (-10)
ca: suma (-10) a x
es: sumar a x (-10)
gl: sumar (-10) a x
it: cambia x di (-10)
pt: adiciona (-10) ao teu x

source: when [right arrow v] key pressed //Initialized correctly.
ca: quan la tecla [fletxa dreta v] es premi
es: al presionar tecla [flecha derecha v] // Inicializado correctamente
gl: ao premer a tecla [frexa dereita v] //Inicializada correctamente.
it: quando si preme il tasto [freccia destra v] //Inizializzazione corretta.
pt: Quando alguém pressionar a tecla [seta para a direita v] // Inicializada corretamente.

source: Tutorials
gl: Tutoriais
it: Tutorial
pt: Tutoriais
tr: Öğreticiler

source: Dimensions
gl: Dimensións
it: Dimensioni
pt: Dimensões
tr: Boyutlar

source: Bad Habits
ca: Mals hàbits
gl: Malos hábitos
it: Cattive abitudini
pt: Maus hábitos
tr: Kötü alışkanlıklar

source: Dead code are parts of programs that never are executed. How can it form? For example, when you have a program that isn't start with a hat block, or when there is a program that is waiting for a message that never is sent.
ca: El codi mort són parts dels programes que no arriben a executar-se mai. Com pot formar-se codi mort? Per exemple, quan tens un programa que no comença amb un bloc d'inici, o quan hi ha un programa que està esperant que li arribi un missatge que ningú envia.
es: El código muerto son partes de los programas que no llegan nunca a ejecutarse. ¿Cómo puede formarse código muerto? Por ejemplo, cuando tienes un programa que no comienza con un bloque de tipo sombrero, o cuando hay un programa que está esperando a que le llegue un mensaje que nadie envía.
gl: O código mort son partes dos programas que nunca chegan a executarse. Como pode formarse código mort? Por exemplo, cando tes un programa que non comeza cun bloque de inicio, ou cando hai un programa que está esperando a que chegue un mensaxe que ninguén envía.
it: Il codice morto (dead code) sono parti di script che non vengono mai eseguiti. Come può crearsi? Ad esempio, quando uno script non si avvia con un 'blocco cappello' (hat block), o quando c'è uno script in attesa di un messaggio che non viene mai inviato.
pt: Código morto são pates de programas que nunca são executados. Como isso acontece? Por exemplo, quando você tem um programa que não tem um evento de início, ou quando ele está esperando por uma mensagem que nunca é enviada.
tr: Ölü kod, hiç çalışmayan program parçalarıdır. Nasıl oluşabilir? Örneğin, bir başlık bloğuyla başlamayan bir programınız varsa ya da hiçbir zaman gönderilmeyen bir mesajı bekleyen bir program varsa, ölü kod oluşabilir.

source: forever //Blocks that do not start with a hat block.
ca: per sempre //Blocs que no comencen amb un bloc d'inici.
es: por siempre //Bloques que no empiezan con un bloque sombrero.
gl: para sempre//Bloques que non comenzan cun bloque sombreiro
it: per sempre //Blocchi che non iniziano con un blocco cappello.
pt: repete para sempre //Blocos que não iniciam com um bloco de eventos.

source: if &lt; key [left arrow v] pressed ? &gt; then
ca: si &lt; tecla [fletxa esquerra v] premuda?&gt; llavors
es: si &lt; ¿tecla [flecha izquierda v] presionada?&gt; entonces
gl: se &lt; a tecla [frecha esquerda v] está premida &gt; entón
it: se &lt; tasto [freccia sinistra v] premuto &gt; allora
pt: se &lt; a tecla [seta para a esquerda v] está a ser pressionada &gt; , então

source: when I receive [startcc v] //Blocks that start with a hat block.
ca: quan rebi [startcc v] //Blocs que comencen amb un bloc d'inici.
es: al recibir [startcc v] //Bloques que empiezan con un bloque sombrero.
gl: Ao recibir [startcc v] //Bloques que comenzan cun bloque sombreiro
it: quando ricevo [startcc v] //Blocchi che iniziano con un blocco cappello.
pt: Quando receberes a mensagem [startcc v] //Blocos que iniciam com um bloco de eventos.

source: switch costume to [costume2 v]
ca: canvia el vestit a [vestit2 v]
es: cambiar disfraz a [disfraz2 v]
gl: mudar vestimenta a [vestimenta2 v]
it: passa al costume [costume2 v]
pt: muda o teu traje para [traje2 v]

source: say [Let's start] for (2) secs
ca: digues [Som-hi!] durant (2) segons
es: decir [Vamos!] durante (2) segundos
gl: dicir [Imos a comenzar] durante (2) segundos
it: dire [Cominciamo] per (2) secondi
pt: diz [Vamos começar] durante (2) s

source: These situations usually causes that projects doesn't work as expected of them,so,try to avoid dead code in your programs!
ca: Aquestes situacions acostumen a ser la causa de projectes que no funcionen com s'espera d'ells, així que: mira d'evitar codi mort en els teus programes!
es: Estas situaciones suelen ser la causa de proyectos que no funcionan como se espera de ellos, así que,¡trata de evitar código muerto en tus programas!
gl: Estas situacións adoitan ser a causa de proxectos que non funcionan como se espera deles, así que: trata de evitar código morto nos teus programas!
it: Queste situazioni di solito fanno sì che i progetti non funzionino come previsto, quindi, cerca di evitare il codice morto nei tuoi programmi!
pt: Essas situações normalmente fazem com que os projetos não funcionem como esperado, então tente evitar código morto em seus programas!
tr: Bu durumlar genellikle projelerin beklenen şekilde çalışmamasına neden olur, bu yüzden programlarınızda ölü kodlardan kaçınmaya çalışın!

source: Imagine that in a project we have two programs formed by the same blocks and where only vary the parameters or values of the blocks.
ca: Imagina que en un projecte tenim dos programes que es componen dels mateixos blocs i en els que només varien els paràmetres o valors dels blocs.
es: Imagina que en un proyecto tenemos dos programas que se componen de los mismos bloques y en los que solo varían los parámetros o valores de los bloques.
gl: Imagina que nun proxecto temos dous programas que se compoñen dos mesmos bloques e nos que só varían os parámetros ou valores dos bloques.
it: Immagina che in un progetto abbiamo due script formati dagli stessi blocchi dove variano solo i parametri o i valori dei blocchi.
pt: Imagine que em um projeto você tenha dois programas formados pelo mesmos blocos e variam somente nos parâmetros ou valores dos blocos.
tr: Bir projede, aynı bloklardan oluşan iki program olduğunu ve yalnızca blokların parametrelerinin veya değerlerinin farklılık gösterdiğini hayal edin.

source: set rotation style [left-rigt v]
ca: fixa el tipus de rotació [esquerra-dreta v]
es: fijar estilo de rotación a [izquierda-derecha v]
gl: usar o estilo de rotación (esquerda-dereita v)
it: usa stile rotazione [sinistra-destra v]
pt: altera o teu estilo de rotação para [olha apenas para a esquerda e para a direita v]

source: repeat (10)
ca: repeteix (10)
es: repetir (10)
gl: repetir (10)
it: ripeti (10) volte
pt: repete (10) vezes

source: move (2) steps
ca: mou-te (2) passos
es: mover (2) pasos
gl: mover (2) pasos
it: fai (2) passi
pt: anda (2) passos

source: when I receive [message2 v]
ca: quan rebi [missatge2 v]
es: al recibir [message2 v]
gl: ao recibir [messages2 v]
it: quando ricevo [message2 v]
pt: Quando receberes a mensagem [mensagem2 v]

source: repeat (5)
ca: repeteix (5)
es: repetir (5)
gl: repetir (5)
it: ripeti (5) volte
pt: repete (5) vezes

source: move (4) steps
ca: mou-te (4) passos
es: mover (4) pasos
gl: mover (4) pasos
it: fai (4) passi
pt: anda (4) passos

source: What would happen if we make a small change? We would have to modify both programs, complicating the maintenance of the code. In these situations is more appropriate that the programmer make his own block that defines this behaviour and use this new block in all programs where needed.
ca: Què passaria si volguéssim fer una petita modificació? Hauríem de modificar tots dos programes, la qual cosa complica el manteniment del codi. En aquestes situacions és molt més encertat que el programador creï un bloc propi que defineixi aquest comportament i que utilitzi aquest nou bloc en tots els programes on sigui necessari fer-ho.
es: ¿Qué ocurriría si quisiéramos hacer una pequeña modificación? Tendríamos que modificar ambos programas, lo que complica el mantenimiento del código. En estas situaciones es mucho más adecuado que el programador cree un bloque propio que defina este comportamiento y que utilice este nuevo bloque en todos los programas donde lo necesite.
gl: Que pasaría se quisésemos facer unha pequena modificación? Teríamos que modificar ambos programas, o que complica o mantemento do código. Nestas situacións é moito máis axeitado que o programador crie un bloque propio que defina ese comportamento e que utilice este novo bloque en todos os programas onde sexa necesario facelo.
it: Cosa succederebbe se dovessimo fare un piccolo cambiamento? Dovremmo modificare entrambi gli script, complicando la manutenzione del codice. In queste situazioni è più appropriato che il programmatore crei un proprio blocco che definisca questo comportamento e utilizzi questo nuovo blocco in tutti gli script dove necessario.
pt: O que aconteceria se fizéssemos uma mudança pequena? Teríamos de modificar ambos os programas, complicando a manutenção do código. Nessas situações, é mais apropriado que o programador crie seu próprio bloco que defina esse comportamento e utilizes esse novo bloco em todos os programas onde necessário.
tr: Küçük bir değişiklik yaparsak ne olur? Her iki programı da değiştirmemiz gerekecek ve bu, kodun bakımını zorlaştıracaktır. Bu tür durumlarda, programcının bu davranışı tanımlayan kendi bloğunu oluşturması ve bu yeni bloğu ihtiyaç duyulan tüm programlarda kullanması daha uygun olacaktır.

source: define walk (repetitions)(step)(pause)
ca: defineix camina (cops)(pas)(pausa)
es: definir andar (repeticiones)(paso)(pausa)
gl: definir caminar (repeticións)(paso)(pausa)
it: definisci camminata (ripetizioni)(passi)(pausa)
pt: define anda (repetições)(passos)(pausa)

source: repeat (repetitions)
ca: repeteix (cops)
es: repetir (repeticiones)
gl: repetir(repeticións)
it: ripeti (ripetizioni) volte
pt: repete (repetições) vezes

source: move (step) steps
ca: mou-te (pas) passos
es: mover (paso) pasos
gl: mover (paso) pasos
it: fai (passi) passi
pt: anda (passos) passos

source: wait (pause) secs
ca: espera (pausa) segons
es: esperar (pausa) segundos
gl: agardar (pausa) segundos
it: attendi (pausa) secondi
pt: espera (pausa) s

source: Thus, if you want a change, you just have to go to the block defined by the programmer.
ca: D'aquesta manera, si volem realitzar una modificació, només cal anar al bloc definit pel programador.
es: De este modo, si se quiere realizar una modificación, tan solo hay que ir al bloque definido por el programador.
gl: Desta maneira, se queremos realizar unha modificación, só é necesario ir ao bloque definido polo programador.
it: Quindi, se si desidera fare una modifica, è sufficiente farla solo nel blocco definito dal programmatore.
pt: Assim, se você quer fazer uma mudança, você só precisa alterar o bloco definido pelo programador.
tr: Bu şekilde, bir değişiklik yapmak istediğinizde, yalnızca programcı tarafından tanımlanan bloğa gitmeniz yeterlidir.

source: When you start to programming with Scratch, is very usually to leave the default name of the new characters or scenarios(sprite 1, sprite2, backdrop1, backdrop2 ...). When we have few characters or backdrops, is very easy to know what character or scenario have each name. However, when the number of characters or scenarios increases, it's more complicated. So, is a good practice naming(to recognize easily) each character and scenario of our projects, because our programs can be read more fast. Avoid default names!
ca: Quan comencem a programar amb Scratch és freqüent deixar el nom que Scratch assigna per defecte als nous personatges o scenaris (sprite1, sprite2, fons1, fons2 ...). Quan tenim pocs personatges o scenaris, és prou senzill saber quin nom té assignat cada personatge o scenari; no obstant això, quan el nombre de personatges o scenaris creix, la cosa es complica. Per tant, és molt encertat acostumar-se a posar un nom representatiu (que reconeguem fàcilment) a cada personatge i scenari dels nostres projectes, ja que així els programes es llegiran millor i es programaran més ràpidament. Fuig dels noms per defecte!
es: Al comenzar a programar con Scratch es bastante habitual dejar el nombre que Scratch asigna por defecto a los nuevos personajes o escenarios(objeto1, objeto2, fondo1, fondo2...). Cuando tenemos pocos personajes o escenarios, es bastante sencillo saber qué personaje o escenario tiene cada nombre; no obstante, cuando el número de personajes o escenarios crece, la cosa se complica. Por tanto, es muy bueno acostumbrarse a poner un nombre significativo (que reconozcamos fácilmente) a cada objeto y escenario de nuestros proyectos, ya que nuestros programas se leerán mejor y se programarán más rápidamente. ¡Evita los nombres por defecto!
gl: Cando comezamos a programar con Scratch, é frecuente deixar o nome que Scratch asigna por defecto aos novos personaxes ou cenários (sprite1, sprite2, fondo1, fondo2...). Cando temos poucos personaxes ou cenários, é bastante sinxelo saber que nome ten asignado cada personaxe ou cenário; non obstante, cando o número de personaxes ou cenários crece, a cousa complica. Por iso, é moi acertado acostumarse a poñer un nome representativo (que recoñezamos facilmente) a cada personaxe e cenário dos nosos proxectos, xa que así os programas leranse mellor e programaranse máis rapidamente. Fuxe dos nomes por defecto!
it: Quando si inizia a programmare con Scratch, spesso viene lasciato il nome predefinito dei nuovi personaggi o sfondo (sprite 1, sprite2, sfondo1, sfondo2 ...). Quando abbiamo pochi personaggi o sfondo, è molto facile sapere qual è il nome di ogni sprite. Tuttavia, quando il numero di personaggi o sfondo aumenta, è più complicato. Una buona pratica rinomina (per riconoscere facilmente) ogni personaggio e sfondo dei nostri progetti, perché i nostri programmi possano essere letti più velocemente. Evita i nomi di predefiniti!
pt: Quando você começa a programar com Scratch, é comum não alterar o nome das personagens ou cenários (sprite 1, sprite 2, cenário1, cenário2 ...). Quando temos poucas personagens ou cenários, é muito fácil identificar cada um deles. Contudo, quando o número de personagens ou cenários aumenta, a situação é mais complicada. Então, uma boa prática é nomear (com nomes facilmente identificados) cada personagem e cenário do projeto, pois fica mais fácil de entender o projeto. Evite nomes padrão!
tr: Scratch ile programlamaya başladığınızda, genellikle yeni karakterlerin veya arka planların varsayılan adlarını bırakmak yaygındır (sprite 1, sprite 2, backdrop 1, backdrop 2, vb.). Az sayıda karakter veya arka plan olduğunda, her birinin adını bilmek oldukça kolaydır. Ancak, karakterlerin veya arka planların sayısı arttıkça bu daha karmaşık hale gelir. Bu nedenle, projelerinizde her bir karakteri ve arka planı tanımayı kolaylaştıracak şekilde adlandırmak iyi bir uygulamadır, çünkü programlarınız daha hızlı okunabilir. Varsayılan adlardan kaçının!

source: Sign in
ca: Inicia la sessió
es: Ingresar
it: Registrati
pt: Entrar
tr: Kayıt olmak

source: Remember me
ca: Recorda'm
es: Recordarme
it: Ricordami
pt: Lembre de mim
tr: Beni Hatırla

source: Sign up!
ca: Registra't!
es: ¡Regístrate!
it: Registrati!
pt: Cadastre-se!
tr: Üye olmak!

source: WHY?
ca: Per què?
es: ¿Por qué?
gl: POR QUE?
it: PERCHÉ?
pt: Por quê?
tr: NEDEN?

source: Why
ca: Per què
es: Por qué
gl: Por que
it: Perché
pt: Por que
tr: Neden

source: you’ll love Dr. Scratch
ca: t'encantarà Dr. Scratch
es: te encantará Dr. Scratch
gl: vaiche encantar Dr. Scratch
it: amerai Dr Scratch
pt: você vai adorar Dr. Scratch
tr: Dr. Scratch'ı çok seveceksiniz

source: A powerful tool to analyze your Scratch projects
ca: Analitza els teus projectes de Scratch
es: Analiza tus proyectos de Scratch
gl: Unha ferramenta poderosa para analizar os teus proxectos Scratch
it: Un potente strumento per analizzare i tuoi progetti di Scratch
pt: Uma ferramenta poderosa para analisar seus projetos do Scratch
tr: Scratch projelerinizi analiz etmek için güçlü bir araç

source: Simple & Fun
ca: Fàcil & Divertit
es: Fácil & Divertido
gl: Sinxela e divertida
it: Semplice & Divertente
pt: Simples & Divertido
tr: Basit ve Eğlenceli

source: Your students can easily learn how to improve their programming skills in a fun way.
ca: Els teus estudiants poden aprendre fàcilment com millorar les seves habilitats de programació d'una manera divertida.
es: Tus estudiantes pueden aprender fácilmente cómo mejorar sus habilidades de programación de una forma divertida.
gl: Os teus alumnos poden aprender facilmente como mellorar as súas habilidades de programación de xeito divertido.
it: I tuoi studenti possono facilmente imparare a migliorare le proprie capacità di programmazione in modo divertente.
pt: Seus estudantes podem aprender facilmente a melhorar suas habilidades de programação de um jeito divertido.
tr: Öğrencileriniz, eğlenceli bir şekilde programlama becerilerini nasıl geliştireceklerini kolayca öğrenebilirler.

source: Improve your skills
ca: Millora les teves habilitats
es: Mejora tus habilidades
gl: Mellora as túas habilidades
it: Migliora le tue abilità
pt: Melhore suas habilidades
tr: Becerilerinizi geliştirin

source: We provide feedback on several aspects which are related to Computational Thinking.
ca: Dr. Scratch ofereix retroacció en aspectes relacionats amb el Pensament Computacional ajudant-te a millorar-los.
es: Dr. Scratch ofrece realimentación en aspectos relacionados con el Pensamiento Computacional ayudándote a mejorarlos.
gl: Damos retroalimentación en varios aspectos relacionados co Pensamento Computacional.
it: Forniamo feedback su diversi aspetti legati al Pensiero Computazionale.
pt: Nós damos feedback sobre vários aspectos relacionados ao Pensamento Computacional.
tr: Bilgisayarca Düşünme ile ilgili çeşitli konularda geri bildirim sağlıyoruz.

source: Always improving
ca: Millorant constantment
es: Mejorando constantemente
gl: Sempre mellorando
it: Migliorando sempre
pt: Sempre melhorando
tr: Her zaman gelişiyor

source: We're continually enhancing the features of Dr. Scratch, and we'd love to hear your thoughts
ca: Intentem millorar contínuament, per això ens agradaria escoltar les teves opinions.
es: Intentamos mejorar continuamente, por lo que nos gustaría escuchar tus opiniones.
gl: Estamos mellorando continuamente as funcións de Dr. Scratch, e encantaríanos escoitar as túas ideas
it: Stiamo migliorando continuamente le caratteristiche di Dr Scratch e saremmo lieti di sentire i tuoi suggerimenti
pt: Estamos sempre melhorando o Dr. Scratch, e adoraríamos ouvir sua opinião
tr: Dr. Scratch’ın özelliklerini sürekli geliştiriyoruz ve düşüncelerinizi duymaktan memnuniyet duyarız.

source: How
ca: Com
es: Cómo
gl: Como
it: Come
pt: Como
tr: Nasıl

source: How
ca: Com
es: Cómo
gl: Como
it: Come
pt: Como
tr: Nasıl

source: it works
ca: funciona
es: funciona
gl: funciona
it: funziona
pt: funciona
tr: Çalışıyor

source: NEW FEATURES
ca: NOVES FUNCIONALITATS
es: NUEVAS FUNCIONALIDADES
gl: NOVAS FUNCIONALIDADES
it: NUOVE CARATTERISTICHE
pt: NOVAS FUNÇÕES
tr: YENİ ÖZELLİKLER

source: Coming
ca: Properes
es: Próximas
gl: Proximas
it: In arrivo
pt: Chegando
tr: Gelen

source: Soon
ca: Funcionalitats
es: Funcionalidades
gl: Funcionalidades
it: Presto
pt: Em breve
tr: Yakında

source: We are working on new features to improve Dr. Scratch
ca: Estem treballant en noves característiques que millorin Dr. Scratch
es: Estamos trabajando en nuevas características que mejoren Dr. Scratch
gl: Traballamos en novas funcionalidades para mellorar Dr.Scratch
it: Stiamo lavorando a nuove funzionalità per migliorare Dr Scratch
pt: Estamos trabalhando em novas funções para melhorar Dr. Scratch
tr: Dr. Scratch'ı geliştirmek için yeni özellikler üzerinde çalışıyoruz.
