Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Visibility:
ca: Visibilitat
es: Visibilidad:
gl: Visibilidade:
it: Visibilità:
pt: Visibilidade:

source: show
ca: mostra't
es: mostrar
gl: amosarse
it: mostra
pt: mostra-te

source: hide
ca: amaga't
es: esconder
gl: agocharse
it: nascondi
pt: esconde-te

source: In addition to modifying the attributes of the characters, programmers can use other mechanisms to store information on a Scratch project. <b>One of these mechanisms are variables that can store a value to store different types of data that may need: at what level we are</b>, how many lives you have left, how many points we, how is called the user ...
ca: A més de modificar els atributs dels personatges, els programadors podem utilitzar altres mecanismes per emmagatzemar informació en un projecte Scratch.<b> Un d'aquests mecanismes són les variables, que permeten emmagatzemar un valor per desar diferents tipus de dades que podem necessitar: en quin nivell ens trobem</b>, quantes vides ens queden, quants punts portem, com es diu l'usuari...
es: Además de modificar los atributos de los personajes, los programadores podemos utilizar otros mecanismos para almacenar información en un proyecto Scratch.<b> Uno de estos mecanismos son las variables, que permiten almacenar un valor para guardar distintos tipos de datos que podemos necesitar: en qué nivel nos encontramos</b>, cuántas vidas nos quedan, cuántos puntos llevamos, cómo se llama el usuario...
gl: Ademáis de modificar os atributos dos personaxes, os programadores podemos usar outros mecanismos para almacenar información nun proxecto Scratch.<b> Un desdes mecanismos son as variables que poden almacenar un valor de distintos tipos de datos que podemos necesitar: en que nivel estamos</b>, cantas vidas nos quedan, cantos puntos temos, como se chama o usuario ...
it: Oltre a modificare gli attributi degli sprite, i programmatori possono utilizzare altri metodi per memorizzare informazioni in un progetto Scratch. <b>Uno di questi metodi consiste nel memorizzare i valori in variabili, un valore serve a memorizzare diversi tipi di dati che possono essere necessari: a quale livello siamo</b>, quante vite hai ancora a disposizione, quanti punti, come si chiama l'utente ...
pt: Além de modificar os atributos dos personagens, programadores podem usar outros mecanismos para guardar informação em um projeto com Scratch. <b>Um desses mecanismos é o uso de variáveis que podem guardar um valor que representa diferentes tipos de dados: em que nível estamos</b>, quantas vidas você ainda tem no jogo, quantos pontos já ganhou, qual o nome do jogador...
tr: Karakterlerin niteliklerini değiştirmek dışında, programcılar Scratch projesinde bilgi depolamak için diğer mekanizmaları da kullanabilirler. <b>Bu mekanizmalardan biri, çeşitli veri türlerini depolayabilen değişkenlerdir: hangi seviyede olduğumuz</b>, kaç canımız kaldığı, kaç puanımız olduğu, kullanıcının adı gibi bilgileri saklayabilirler.

source: To create a variable you have to go to the category of data, click on 'Create a variable' and give a name. In the example shown below we have given the name 'Points' as use it to store the number of points you get our character.
ca: Per crear una variable cal anar a la categoria de Dades, clicar damunt "Crea una variable" i anomenar-la. A l'exemple que mostrarem tot seguit l'hem anomenada "Punts", ja que la utilitzarem per desar el nombre de punts que aconsegueix el nostre personatge.
es: Para crear una variable hay que irse a la categoría de Datos, pinchar sobre “Crear una variable” y darle un nombre. En el ejemplo que mostramos a continuación le hemos dado el nombre “Puntos”, ya que la utilizaremos para guardar el número de puntos que consigue nuestro personaje.
gl: Para crear unha variable tes que ir á categoría de datos, premer en 'Crear unha variable' e darlle un nome. No exemplo mostrado a continuación, dímoslle o nome 'Puntos' dado que a usaremos para almacenar os puntos que consegue o noso personaxe.
it: Per creare una variabile devi andare alla categoria dei variabili e liste, fare clic su 'Crea una variabile' e assegnarle un nome. Nell'esempio riportato di seguito abbiamo dato il nome "Punti" per memorizzare il numero di punti che ottiene il nostro personaggio.
pt: Para criar uma variável, você tem que ir na categoria de dados, clicar em 'Criar uma variável' e dar um nome. No exemplo abaixo, nós demos o nome 'Pontos' já que usamos para guardar o número de pontos que nosso personagem ganha.
tr: Bir değişken oluşturmak için veri kategorisine gitmeli, 'Bir değişken oluştur' seçeneğine tıklamalı ve bir ad vermelisiniz. Aşağıdaki örnekte, karakterinizin aldığı puanları saklamak için 'Points' adını verdik.

source: set [Points v] to [0]
ca: assigna a [Punts v] el valor [0]
es: dar a [Puntos v] el valor [0]
gl: asignar [0] a [Puntos v]
it: porta [Punti v] a [0]
pt: altera [Pontos v] para [0]

source: if &lt;touching color [#0000FF]&gt; then
ca: si &lt;tocant el color [#0000FF]?&gt; llavors
es: si &lt;¿tocando el color [#0000FF]?&gt; entonces
gl: se &lt;toca na cor [#0000FF]&gt; entón
it: se &lt;sta toccando il colore [#0000FF]&gt; allora
pt: se &lt; estás a tocar na cor [#0000FF]&gt; , então

source: change [Points v] by (1)
ca: augmenta [Punts v] en (1)
es: sumar a [Puntos v] (1)
gl: sumarlle (1) a [Puntos v]
it: cambia [Punti v] di (1)
pt: adiciona a [Pontos v] o valor (1)

source: In the program of the top, we assign the number of points that we want the character has to the beginning of the game, in this case 0, for which we use the block <i>'fixing points at 0'</i>. However in the program of the right, what we do is that when the character touches the blue color, that could be a target, you will add a point, for which we use the block <i>'change Points by 1'</i>. In this case, the block <i>'change'</i> would check the current value of the variable points would add 1: If set to 0, I add 1 and is now worth 1; when set to 1, I add 1 and is now worth 2 ...
ca: En el programa de l'esquerra assignem el nombre de punts amb els que volem que el personatge comenci la partida, en aquest cas 0, i per això fem ús del bloc <i> "assigna a Punts el valor 0"</i>. En el programa de la dreta el que fem és que quan el personatge toqui el color blau, que podria ser el d'un objectiu, li sumem un punt, i és per això que utilitzem el bloc <i>"augmenta Punts en 1"</i>. En aquest cas, el bloc <i>'augmenta'</i> comprovaria el valor actual de la variable Punts i li sumaria 1: si val 0, suma 1 i ara val 1; si val 1, suma 1 i ara val 2...
es: En el prorgrama de la izquierda asignamos el número de puntos con los que queremos que el personaje comience la partida, en este caso 0, para lo que utilizamos el bloque <i>“fijar Puntos a 0”</i>. Sin embargo en el programa de la derecha lo que hacemos es que cuando el personaje toque el color azul, que podría ser el de un objetivo, le vamos a sumar un punto, para lo que utilizamos el bloque <i>“cambiar Puntos por 1”</i>. En este caso, el bloque <i>'cambiar'</i> comprobaría el valor actual de la variable Puntos y le sumaría 1: si vale 0, le sumo 1 y ahora vale 1; si vale 1, le sumo 1 y ahora vale 2...
gl: No programa da esquerda, asignamos o número de puntos que queremos que o personaxe teña ao principio do xogo, neste caso 0, para o que usamos o bloque <i>'fixar os puntos a 0'</i>. En cambio no programa da dereita, o que facemos é que cando o personaxe toca a cor azul, que pode ser un obxectivo, engades un punto, para o que usamos o bloque <i>'cambiar Puntos nun'</i>. Neste caso, o bloque <i>'cambiar'</i> comprobaría o valor actual da variable puntos e lle engadería 1: se vale 0, engádolle 1 e agora vale 1; se vale 1, engádolle 1 e agora vale 2 ...
it: Nello script sopra, assegniamo il numero di punti che vogliamo che lo sprite abbia all'inizio del gioco, in questo caso 0, per questo usiamo il blocco <i> 'porta Punti a 0' </i>. Tuttavia, nello script di destra, quello che facciamo quando il personaggio tocca il colore azzurro, che potrebbe essere un bersaglio-target, viene aggiunto un punto, per questo usiamo il blocco <i>'cambia Punti di 1'</i>. In questo caso, il blocco <i> 'cambia' </ i> verifica il valore corrente dei punti nella variabile e aggiunge 1: Se impostato su 0, aggiungo 1 e ora vale 1; quando è impostata a 1, aggiungendo 1 il valore diventa 2 ...
pt: No programa da esquerda, nós atribuímos o número de pontos que queremos que o personagem tenha no início do jogo (nesse caso, zero) e, para isso, usamos o bloco <i>'fixar pontos em 0'</i>. Entretanto, no programa da direita, o que fazemos é que quando o personagem toca a cor azul, que pode ser um alvo, somamos um ponto. Para isso, usamos o bloco <i>'mudar Pontos por 1'</i>. Nesse caso, o bloco <i>'mudar'</i> verificaria o valor atual da variável para somar 1: se está em 0, eu somo 1 e agora passa para 1; quando está em 1, somo 1 e agora passa para 2...
tr: Yukarıdaki programda, karakterin oyunun başında sahip olmasını istediğimiz puan sayısını, bu durumda 0, belirliyoruz; bunun için <i>'fixing points at 0'</i> bloğunu kullanıyoruz. Sağdaki programda ise, karakter mavi renge dokunduğunda, bu bir hedef olabilir, bir puan eklenir; bunun için <i>'change Points by 1'</i> bloğunu kullanıyoruz. Bu durumda, <i>'change'</i> bloğu, değişkenin mevcut değerini kontrol eder ve 1 ekler: Eğer başlangıçta 0 ise 1 ekler ve şimdi 1 olur; başlangıçta 1 ise 1 ekler ve şimdi 2 olur...

source: In addition to the variables, Scratch lets you use another data type to store project information: <b>The lists. The lists can store more than one value at the same time, so they are ideal for storing rewards have been recovered by a character or set of names, raise a couple of examples.</b>
ca: A més de les variables, Scratch permet fer ús d'altres tipus de dades per desar informació d'un projecte: <b> les llistes. Les llistes permeten emmagatzemar més d'un valor al mateix temps, és per això que són ideals per desar les recompenses que han estat recuperades per un personatge, o un conjunt de nombres, per posar un parell d'exemples.</b>
es: Además de las variables, Scratch permite utilizar otro tipo de datos para guardar información de un proyecto: <b>las listas. Las listas permiten almacenar más de un valor al mismo tiempo, por lo que son ideales para guardar las recompensas que han sido recuperadas por un personaje, o un conjunto de nombres, por plantear un par de ejemplos.</b>
gl: Ademáis das variables, Scratch permite usar outro tipo de datos para almacenar información do proxecto:<b> as listas. As listas poden almacenar máis dun valor ao mesmo tempo, polo que son ideais para almacenar recompensas que o personaxe pode recuperar ou un conxunto de nomes, por poñer un par de exemplos.</b>
it: Oltre alle variabili, Scratch consente di utilizzare un altro tipo di dati per memorizzare le informazioni di progetto: <b>Le liste. Le liste possono memorizzare più di un valore allo stesso tempo, quindi, per fare un paio di esempi, sono ideali per memorizzare i premi che sono stati recuperati da un personaggio o un insieme di nomi.</b>
pt: Além de variáveis, Scratch permite que você use outro tipo de dado para guardar informações do projeto: <b>listas. As listas podem guardar mais de um valor ao mesmo tempo, então, elas são ideais para guardar recompensas que foram recuperadas por um personagem ou um conjunto de nomes, por exemplo.</b>
tr: Değişkenlerin yanı sıra, Scratch projede bilgi depolamak için başka bir veri türü kullanmanıza da izin verir: <b>Listeler. Listeler birden fazla değeri aynı anda saklayabildiği için, bir karakter tarafından toplanan ödülleri veya bir dizi adı saklamak için idealdir; iki örnek verelim.</b>

source: To create a list, you have to go to the data category, click on 'Create a List' and give a name. In the example, we have named our 'Students' list:
ca: Per crear una llista, cal anar a la categoria de Dades, clicar damunt "Crea una llista" i anomenar-la. A l'exemple, nosaltres hem anomenat la nostra llista "Estudiants":
es: Para crear una lista, hay que irse a la categoría de Datos, pinchar sobre “Crear una lista” y darle un nombre. En el ejemplo, nosotros hemos llamado a nuestra lista “Estudiantes”:
gl: Para crear unha lista, tes que ir á categoría de datos, premer en 'Crear unha Lista' e darlle un nome. No exemplo, nomeamos a nosa lista 'Alumnos':
it: Per creare una lista, devi andare alla categoria dei variabili e liste, fare clic su "Crea una lista" e darle un nome. Nell'esempio abbiamo nominato la lista "Studenti":
pt: Para criar uma lista, você tem que ir na categoria dados, clicar em 'Criar uma lista' e dar um nome. No exemplo, nós demos o nome 'Lista de estudantes':
tr: Bir liste oluşturmak için veri kategorisine gitmeli, 'Bir Liste Oluştur' seçeneğine tıklamalı ve bir ad vermelisiniz. Örnekte, listemize 'Students' adını verdik:

source: delete (all v) of [Students v]
ca: esborra l'element (tots v) de [Estudiants v]
es: eliminar (todos v) de [Estudiantes v]
gl: eliminar (todos v) de [Alumnos v]
it: cancella (tutto v) da [Studenti v]
pt: remove (tudo v) de [Alunos v]

source: repeat (3)
ca: repeteix (3)
es: repetir (3)
gl: repetir (3)
it: ripeti (3) volte
pt: repete (3) vezes

source: ask [Introduce a student name] and wait
ca: pregunta [Introdueix el nom d'un estudiant] i espera
es: preguntar [Introduce el nombre de un estudiante] y esperar
gl: preguntar [Introduza o nome dun estudante] e agardar
it: chiedi [Scrivere un nome di studente] e attendi
pt: pergunta [Introduzir o nome do aluno] e espera pela resposta

source: insert (answer) at (last v) of [Students v]
ca: afegeix (resposta) a la posició [darrer] de [Estudiants v]
es: insertar (respuesta) en [último v] de [Estudiantes v]
gl: insertar(resposta) en (último v) de [Alumnos v]
it: inserisci (risposta) alla posizione (ultimo v) di [Studenti v]
pt: insere (a resposta) como (o último item v) de [Alunos v]

source: What have we done with this program? The first thing we do is, to start execution, <b>delete all items from the list Students</b>, to empty it completely and not appear elements of an previous project implementation. Then we ask three times the user to enter a name, and each name entered insert it in the last position in the list Students.
ca: Què hem fet amb aquest programa? El primer que fem al començar l'execució és <b> esborrar tots els elements de la llista Estudiants</b>, per tal de buidar-la completament i que no apareguin elements d'una execució anterior del projecte. Tot seguit li demanem tres vegades a l'usuari que introdueixi un nom, i cada un d'ells és insertat a la darrera posició de la llista Estudiants.
es: ¿Qué hemos hecho con este programa? Lo primero que hacemos al comenzar la ejecución es <b>borrar todos los elementos de la lista Estudiantes</b>, para vaciarla completamente y que no aparezcan elementos de una ejecución anterior del proyecto. A continuación le pedimos tres veces al usuario que introduzca un nombre, y cada nombre introducido lo insertamos en la última posición de la lista Estudiantes.
gl: Que fixemos con este programa? O primeiro que fixemos foi, para empezar a execución, <b>borrar todos os elementos da lista Alumnos</b>, para valeirala completamente e que non aparezan elementos dunha execución previa do proxecto. Entón, pedimos tres veces ao usuario que introduza o seu nome, e cada nome introducido se inserta na última posición da lista Alumnos.
it: Cosa abbiamo fatto con questo script? La prima cosa che facciamo è di avviare l'esecuzione, <b>eliminare tutti gli elementi dalla lista Studenti</b>, questo per svuotarla completamente e non far apparire elementi di un'esecuzione precedente del progetto. Quindi chiediamo tre volte che l'utente inserisca un nome e ogni nome viene inserito nell'ultima posizione della lista Studenti.
pt: O que fizemos neste programa? A primeira coisa que fizemos é iniciar a execução, <b>apagar todos os itens da lista de Estudantes</b>, deixando-a completamente vazia para não aparecerem os elementos de um projeto anterior. Então, pedimos três vezes para o usuário digitar um nome e cada nome é inserido na última posição da lista Estudantes.
tr: Bu programla ne yaptık? İlk olarak, çalışmayı başlatmak için <b>Students listesindeki tüm öğeleri sileriz</b>, böylece liste tamamen boş olur ve önceki proje uygulamasından kalan öğeler görünmez. Ardından kullanıcıdan üç kez bir isim girmesini isteriz ve her girilen ismi Students listesinin sonuna ekleriz.

source: What we do with the list? We could, for example, use it to get a volunteer to carry out an exercise to the whiteboard. Look at the new instructions added to the program:
ca: Què podem fer amb la llista? Podríem, per exemple, utilitzar-la per triar un alumne i que realitzi un exercici a la pissarra digital. Fixeu-vos en les noves instruccions que afegim al programa:
es: ¿Qué podemos hacer con la lista? Podríamos, por ejemplo, utilizarla para sacar a un voluntario a realizar un ejercicio a la pizarra digital. Fijaos en las nuevas instrucciones que añadimos al programa:
gl: Que facemos coa lista? Poderiamos, por exemplo, usala para escoller un voluntario que faga un exercicio na pizarra. Fixádevos nas novas instruccións que engadimos ao programa:
it: Cosa facciamo con la lista? Potremmo, ad esempio, utilizzarla per selezionare un volontario per fare un esercizio alla lavagna. Guarda le nuove istruzioni aggiunte al programma:
pt: O que fazemos com a lista? Podemos, por exemplo, usá-la para conseguir um voluntário para fazer um exercício no quadro. Confira as novas instruções adicionadas ao programa:
tr: Listeyle ne yaparız? Örneğin, bir gönüllü seçmek için kullanabiliriz; bu gönüllü, tahtada bir egzersizi yapar. İşte programa eklenen yeni talimatlar:

source: end
es: fin
it: fine
pt: fim

source: say [Today's volunteer will be...] for (2) secs
ca: digues [Avui sortirà a la pissarra...] durant (2) segons
es: decir [El voluntario de hoy va a ser...] durante (2) segundos
gl: dicir [O voluntario hoxe será ...] durante (2) segundos
it: dire [Il volontario di oggi sarà...] per (2) secondi
pt: diz [O voluntário de hoje será ...] durante (2) s

source: say (item(pick random (1) to (3)) of [Students v]) for (2) secs
ca: digues (element(nombre a l'atzar entre (1) i (3)) de [Estudiants v]) durant (2) segons
es: decir(elemento(número aleatorio entre (1) y (3)) de [Estudiantes v]) durante (2) segundos
gl: dicir(elemento(número ao chou entre (1) e (3)) de [Alumnos v]) durante (2) segundos
it: dire (elemento(numero a caso tra (1) e (3)) di [Studenti v]) per (2) secondi
pt: diz ((um valor ao acaso entre (1) e (3)) de [Alunos v]) durante (2) s

source: We generated a random number between 1 and 3, which are the elements in the list, we selected the element that occupies that position in the list. Sometimes we take the name that is in position 1, others that it is in position 2 and the other at 3.
ca: Hem generat un nombre a l'atzar entre 1 i 3, que són els elements que hi ha a la llista, i hem seleccionat l'element que ocupa aquesta posició a la llista. Unes vegades agafarem el nombre que està a la posició 1, unes altres al que està a la posició 2 i unes altres al de la posició 3.
es: Hemos generado un número al azar entre 1 y 3, que son los elementos que hay en la lista, y hemos seleccionado al elemento que ocupa esa posición en la lista. Unas veces cogeremos el nombre que está en la posición 1, otras al que está en la posición 2 y otras al de la posición 3.
gl: Xeramos un número ao chou entre 1 e 3, que son os elementos da lista, e seleccionamos o elemento que ocupa esa posición na lista. Ás veces tomaremos o nome que está na posición 1, outras o que está na posición 2 e outras o da 3.
it: Abbiamo generato un numero casuale tra 1 e 3, che sono gli elementi della lista, abbiamo selezionato l'elemento che occupa quella posizione nella lista. A volte prenderemo il nome che è in posizione 1, altre quello in posizione 2 e altre volte quello nella 3.
pt: Nós geramos um número aleatório entre 1 e 3, que são os elementos na lista e selecionamos o elemento que ocupaa essa posição na lista. Uma vez, pegamos o nome que está na posição 1, em outra, o que está na 2 e em uma outra, o da 3.
tr: 1 ile 3 arasında rastgele bir sayı ürettik, bu sayılar listedeki elemanları temsil eder. Bu sayıya karşılık gelen liste elemanını seçtik. Bazen konum 1'deki ismi, bazen konum 2'deki ismi ve diğer zamanlarda konum 3'teki ismi alırız.

source: Lists have many possibilities and many available operations ... you dare to investigate how they work?
ca: Les llistes tenen moltes possibilitats i moltes operacions possibles... t'animes a investigar com funcionen?
es: Las listas tienen muchas posibilidades y muchas operaciones disponibles... ¿te animas a investigar cómo funcionan?
gl: As listas teñen moitas posibilidades e dispoñen de moitas operacións ... anímaste a investigar como funcionan?
it: Le liste hanno molte possibilità e molte operazioni disponibili ... hai il coraggio di vedere come funzionano?
pt: Listas oferecem muitas possibilidades e tem muitas operações ... você gostaria de invertigar como funcionam?
tr: Listelerin birçok olasılığı ve mevcut operasyonları vardır... Nasıl çalıştıklarını araştırmaya cesaret eder misiniz?

source: Default Mode
ca: Mode Vanilla
gl: Mode Vanilla
it: Modalità Vanilla
pt: Mode Vanilla
tr: Varsayılan Modu

source: There are two options to analyze a Scratch project with Dr. Scratch
ca: Hi ha dues opcions per analitzar un projecte de Scratch amb Dr. Scratch
es: Hay dos opciones para analizar un proyecto de Scratch con Dr. Scratch
gl: Hai dúas opcións para analizar un proxecto Scratch con Dr.Scratch
it: Ci sono due modi per analizzare un progetto Scratch con Dr Scratch
pt: Há duas opções para analisar um projeto do Scratch com Dr. Scratch
tr: Dr. Scratch ile bir Scratch projesini analiz etmek için iki seçeneğiniz var

source: You can upload an sb3 file or just provide the project url, avoiding the need to previously download the project to your computer. By analyzing your projects with Dr. Scratch, you can easily check your Computational Thinking Score.
it: Puoi caricare un file sb3 o semplicemente fornire l'url del progetto evitando di scaricare il progetto sul tuo computer. Analizzando i tuoi progetti con Dr Scratch, puoi controllare facilmente il tuo punteggio in Pensiero Computazionale.
pt: Você pode enviar um arquivo sb3 ou entrar com o endereço do projeto, sem precisar carregar o projeto para o seu computador. Analisando seus projetos com Dr. Scratch, você pode facilmente conferir sua Pontuação de Pensamento Computacional.
tr: Bir sb3 dosyası yükleyebilir veya sadece proje URL'sini sağlayabilirsiniz; böylece projeyi önceden bilgisayarınıza indirmenize gerek kalmaz. Dr. Scratch ile projelerinizi analiz ederek Bilgisayarla Düşünme Puanınızı kolayca kontrol edebilirsiniz.

source: Flow Control
ca: Control de flux
gl: Control de fluxo
it: Controllo del flusso
pt: Controlo de fluxo
tr: Akış Kontrolü
