Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: The personalized mode allows you to create a personalized rubric for evaluate projects by your own criteria, after this you can share a link associated to your rubric to evaluate your students.
ca: El mode personalitzat et permet crear rúbriques personalitzades per avaluar projectes sota el teu propi criteri. Després d'això, pots compartir un enllaç associat a la teva rúbrica per avaluar els teus estudiants.
gl: O modo personalizado permite crear rúbricas personalizadas para avaliar proxectos baixo o teu propio criterio. Despois diso, podes compartir unha ligazón asociada á túa rúbrica para avaliar os teus estudantes.
it: La modalità personalizzata ti consente di creare una rubrica personalizzata per valutare i progetti secondo i tuoi criteri. Successivamente, puoi condividere un link associato alla tua rubrica per valutare i tuoi studenti.
pt: O modo personalizado permite criar rubricas personalizadas para avaliar projetos sob o seu próprio critério. Depois disso, você pode compartilhar um link associado à sua rubrica para avaliar seus estudantes.
tr: Özelleştirilmiş mod, projeleri kendi kriterlerinize göre değerlendirmek için kişiselleştirilmiş bir rubrik oluşturmanıza olanak tanır. Sonrasında, öğrencilerinizi değerlendirmek için bu rubrikle ilişkilendirilmiş bir bağlantıyı paylaşabilirsiniz.

source: Create rubric
ca: Crear rúbrica
es: Crear rúbrica
gl: Crear rúbrica
it: Creare una rubrica
pt: Crear rubrica
tr: Rubrik oluştur

source: Recommender Assistant
ca: Assistent de recomanació
gl: Axudante de Recomendación
it: Assistente di Raccomandazione
pt: Assistente de Recomendação
tr: Öneri Asistanı

source: NEW!!!
ca: NOU!!
gl: NOVO!!!
it: NUOVO!!!
pt: NOVO!!!
tr: YENİ!!!

source: This mode gives you a feedback about the bad smells of your project and how to solved them with a assistant style.
ca: Aquest mode us ofereix un comentari sobre les males olors del vostre projecte i comper resoldre'ls amb un estil assistent
gl: Este modo fornece feedback sobre os malos cheiros do teu proxecto e como resolver os con estilo de axudante.
it: Questo modalità fornisce un feedback sui cattivi odori del tuo progetto e come risolverli con uno stile assistente.
pt: Este modo oferece feedback sobre os maus odores do seu projeto e como resolvê-los com um estilo de assistente.
tr: Bu mod, projenizdeki kötü kokuları ve bunları bir asistan tarzında nasıl çözeceğinizi hakkında geri bildirim sağlar.

source: Please enter a project!
ca: Introdueix un projecte!
gl: Por favor, introduce un proxecto!
it: Inserisci un progetto per favore!
pt: Por favor, insira um projeto!
tr: Lütfen bir proje girin!

source: Analyze my Bad Smells
ca: Analitza els meus Bad Smells
gl: Analiza os teus Bad Smells
it: Analizza i miei Bad Smells
tr: Bad Smells'larımı Analiz Et

source: Comparative Mode
ca: Mode comparatiu
gl: Modo Comparativo
it: Modalità Comparativa
pt: Modo Comparativo

source: The comparative mode allows allows users to view and compare different projects or versions side-by-side, highlighting changes and facilitating analysis of coding approaches.
ca: El mode comparatiu permet als usuaris veure i comparar diferentsprojectes o versions al costat de l'altre, destacant els canvis i facilitantanàlisi dels enfocaments de codificació
gl: O modo comparativo permite aos usuarios ver e comparar proxectos ou versións diferentes lado a lado, destacando os cambios e facilitando a análise das abordaxes de codificación.
it: La modalità comparativa consente agli utenti di visualizzare e confrontare progetti o versioni diverse affiancati, evidenziando le modifiche e facilitando l'analisi degli approcci di codifica.
pt: O modo comparativo permite aos usuários visualizar e comparar diferentes projetos ou versões lado a lado, destacando mudanças e facilitando a análise das abordagens de codificação.

source: Winner of
ca: Ha guanyat...
gl: Gañou...
it: Vincitore di
pt: Ganhou...
tr: Kazananı

source: For the first time, a Spanish team, made up of researchers from the Rey Juan Carlos University of Madrid and professors from the Sevillian association Programamos, has been awarded a Google RISE Award, for the project Dr. Scratch.
ca: Per primera vegada, un equip espanyol, format per investigadors de la Universitat Rey Juan Carlos de Madrid i professors de l'associació sevillana Programamos, ha estat guardonat amb un Premi Google RISE pel projecte Dr. Scratch.
gl: Pola primeira vez, un equipo español, formado por investigadores da Universidade Rey Juan Carlos de Madrid e profesores da asociación sevillana Programamos, foi galardoado cun Premio Google RISE polo proxecto Dr. Scratch.
it: Per la prima volta, un team spagnolo, composto da ricercatori dell'Università Rey Juan Carlos di Madrid e docenti dell'associazione Sivigliana Programamos, ha ricevuto un premio Google RISE per il progetto Dr. Scratch.
pt: Pela primeira vez, uma equipe espanhola, composta por pesquisadores da Universidade Rey Juan Carlos de Madrid e professores da associação sevilhana Programamos, foi premiada com um Prêmio Google RISE pelo projeto Dr. Scratch.
tr: İlk kez, Madrid'deki Rey Juan Carlos Üniversitesi'nden araştırmacılar ve Sevilya'daki Programamos derneğinden profesörlerden oluşan bir İspanyol ekibi, Dr. Scratch projesi için bir Google RISE Ödülü ile ödüllendirildi.

source: Article of
ca: Artículo de
gl: Artigo de
it: Articolo di
pt: Artigo de
tr: Makale

source: Check the
ca: Echa un vistazo a la
gl: Echa unha ollada á
it: Dare un'occhiata a
pt: Echa um olhada na
tr: Kontrol edin

source: of Dr.Scratch.
ca: de Dr.Scratch
gl: de Dr.Scratch
it: di Dr. Scratch.
pt: do Dr.Scratch
tr: Dr. Scratch'ın.

source: It's easy -and free- sign up an account in Dr. Scratch
es: Es fácil -y gratis- registrarte en Dr. Scratch
it: È facile - e gratuito - iscriversi con un account in Dr Scratch
tr: Dr. Scratch'ta hesap oluşturmak kolaydır -ücretsizdir-

source: Choose a Dr. Scratch Username
es: Elige un nombre de usuario en Dr. Scratch
it: Scegli uno Username per Dr. Scratch
tr: Dr. Scratch Kullanıcı Adı Seçin

source: Choose a Password
es: Elige una contraseña
it: Scegli una Password
tr: Bir Şifre Seçin

source: Confirm Password
es: Confirma tu contraseña
it: Conferma Password
tr: Şifreyi Onaylayın

source: If you are minor of 16, enter your parent's or guardian's email address and we will send them an email to confirm this account.
es: Si eres menor de 16, introduce la dirección de correo de tus padres o tutores y les enviaremos un email para confirmar esta cuenta.
it: Se sei minore di 16 anni, inserisci l'indirizzo email del tuo genitore o del tutore e gli invieremo un'email per confermare questo account.
tr: 16 yaşından küçükseniz, ebeveyninizin veya vasinizin e-posta adresini girin ve bu hesabı onaylamaları için onlara bir e-posta göndereceğiz.

source: Email address
es: Dirección de email
it: Indirizzo email
tr: E-posta adresi

source: Parent's or guardian's email address
es: Dirección de email del padre/madre/tutor/a
it: Indirizzo email del genitore o del tutore
tr: Veli veya vasinin e-posta adresi

source: Confirm email address
es: Confirma tu dirección de email
it: Conferma l'indirizzo email
tr: E-posta adresini onayla

source: Your responses to these questions will be kept private.
es: Las respuestas a estas preguntas serán privadas.
it: Le tue risposte a queste domande resteranno private.
tr: Bu sorulara verdiğiniz yanıtlar gizli tutulacaktır.

source: Why do we ask for this info?
es: ¿Por qué pedimos esta información?
it: Perché chiediamo queste informazioni?
tr: Neden bu bilgileri istiyoruz?

source: Birth Month and Year
es: Cumpleaños: mes y año
it: Mese e Anno di Nascita
tr: Doğum Ayı ve Yılı

source: We use this information to calculate the age range of people who use Dr. Scratch, and to confirm that you are the owner of the account if you contact us. Your birth month and year will not be made public.
es: Usamos esta información para calcular el rango de edad de las personas que utilizan Dr. Scratch, y confirmar que tu eres el propietario de la cuenta si nos contactas. Esto no será publico.
it: Utilizziamo queste informazioni per calcolare il range di età delle persone che usano Dr Scratch e per confermare di essere il proprietario dell'account se ci contatti. Il mese e l'anno di nascita non saranno resi pubblici.
tr: Bu bilgiyi, Dr. Scratch'ı kullanan kişilerin yaş aralığını hesaplamak ve bizimle iletişime geçtiğinizde hesabın size ait olduğunu doğrulamak için kullanıyoruz. Doğum ayınız ve yılınız kamuya açıklanmayacaktır.

source: Gender
es: Género
it: Genere
tr: Cinsiyet

source: This helps the Dr. Scratch design team understand who is using Dr. Scratch, and provides information that helps us broaden participation. This information is not visible on your account, and is only used to describe overall participation.
es: Sirve para ayudar al equipo de diseño de Dr. Scratch a entender quien está usando Dr. Scratch, y nos proporciona información que nos ayuda a ampliar la participación. Esta información no es visible en tu cuenta, y solo es utilizada para describir la participación.
it: Ciò aiuta il team di design di Dr Scratch a capire chi lo sta utilizzando e fornisce informazioni che ci aiutano ad ampliare il nostro target. Queste informazioni non sono visibili sul tuo account e vengono utilizzate solo per descrivere i partecipanti nel loro insieme.
tr: Bu, Dr. Scratch tasarım ekibine Dr. Scratch'ı kimlerin kullandığını anlamaya yardımcı olur ve katılımı artırmamıza yardımcı olacak bilgiler sağlar. Bu bilgi hesabınızda görünmez ve yalnızca genel katılımı tanımlamak için kullanılır.

source: - Month -
es: - Mes -
it: - Mesi -
tr: - Ay -

source: January
es: Enero
it: Gennaio
tr: Ocak

source: February
es: Febrero
it: Febbraio
tr: Şubat

source: March
es: Marzo
it: Marzo
tr: Mart

source: April
es: Abril
it: Aprile
tr: Nisan

source: May
es: Mayo
it: Maggio
tr: Mayıs

source: June
es: Junio
it: Giugno
tr: Haziran

source: July
es: Julio
it: Luglio
tr: Temmuz

source: August
es: Agosto
it: Agosto
tr: Ağustoso

source: September
es: Septiembre
it: Settembre
tr: Eylül

source: October
es: Octubre
it: Ottobre
tr: Ekim

source: November
es: Noviembre
it: Novembre
tr: Kasım

source: December
es: Diciembre
it: Dicembre
tr: Aralık

source: - Year -
es: - Año -
it: - Anno -
tr: - Yıl -

source: Male
es: Hombre
it: Maschio
tr: Erkek

source: Female
es: Mujer
it: Femmina
tr: Dişi

source: Country
es: País
it: Nazione
tr: Ülke

source: - Country -
es: - Pais -
it: - Nazione -
tr: - Ülke -

source: Why?
ca: Per què?
es: ¿Por qué?
gl: Por que?
it: Perché?
pt: Por quê?
tr: Neden?

source: How?
ca: Com?
es: ¿Cómo?
gl: Como?
it: Come?
pt: Como?
tr: Nasıl?

source: Working on
ca: Properament
es: Próximamente
gl: Proximamente
it: In lavorazione
pt: Trabalhando em
tr: Üzerinde çalışıyoruz

source: Contact us
ca: Contacte
es: Contacto
gl: Contacta con nós
it: Contattaci
pt: Entre em contato
tr: Bize ulaşın

source: Organizations
ca: Organitzacions
es: Organizaciones
gl: Organizacións
it: Organizzazioni
pt: Instituições
tr: Organizasyonlar

source: Analyze your Scratch projects
ca: Analitza els teus projectes de Scratch
es: Analiza tus proyectos de Scratch
gl: Analiza os teus proxectos de Scratch
it: Analizza i tuoi progetti Scratch
pt: Analise seus projetos Scratch

source: Multilingual website
ca: Web Multilingüe
es: Web multilenguaje
gl: Sitio web multilingüe
it: Sito multilingue
pt: Site multilíngue

source: Teacher accounts
ca: Comptes per a professors
es: Cuentas para profesores
gl: Contas de profesor
it: Account degli insegnanti
pt: Contas para professores

source: Cloud platform
ca: Plataforma en el núvol
es: Plataforma en la nube
gl: Plataforma na nube
it: Piattaforma Cloud
pt: Plataforma em nuvem

source: Step 1
es: Paso 1
it: Passo 1

source: Step 2
es: Paso 2
it: Passo 2

source: Step 3
es: Paso 3
it: Passo 3

source: Step 4
es: Paso 4
it: Passo 4

source: You can analyze at the same time all the Scratch proyects of your students!
ca: Pots analitzar alhora tots els projectes de Scratch dels teus alumnes!
es: Puedes analizar de una vez todos los proyectos de Scratch de tus estudiantes.
gl: Pode analizar á vez todos os proxectos Scratch dos seus alumnos
it: Puoi analizzare contemporaneamente tutti i progetti Scratch dei tuoi studenti!
pt: Você pode analisar ao mesmo tempo todos os projetos de seus alunos no Scratch!

source: Only you have to put a
ca: Només cal posar un
es: Sólo tienes que poner un
gl: Basta pór un
it: Devi solo mettere un
pt: Você só precisa inserir um

source: with the urls of the Scratch projects you want to analyze:
ca: amb les urls dels projectes de Scratch que vulguis analitzar:
es: con las urls de los proyectos de Scratch que quieres analizar:
gl: co url de proxectos Scratch que quere analizar:
it: con gli URL dei progetti Scratch che si desidera analizzare:
pt: com as urls dos projetos no Scratch você pode analisar:

source: <input name='csvFile' type='file' class='filestyle' data-buttonText='Choose File .csv'>
ca: <input name='csvFile' type='file' class='filestyle' data-buttonText='Tria el fitxer .csv'>
es: <input name='csvFile' type='file' class='filestyle' data-buttonText='Elige el fichero .csv'>
gl: <input name='csvFile' type='file' class='filestyle' data-buttonText='Escoller proxecto'>
it: <input name='csvFile' type='file' class='filestyle' data-buttonText='Scegli File .csv'>
pt: <input name='csvFile' type='file' class='filestyle' data-buttonText='Escolha Projeto'>

source: Build your rubric!
ca: Elabora la teva rúbrica!
es: ¡Elabora tu rúbrica!
gl: Elabora a túa rúbrica!
it: Crea la tua rubrica!
pt: Elabora a tua rubrica!
tr: Kendi değerlendirmenizi oluşturun!

source: Abstraction is not relevant to me at this moment. I am focused on concrete and specific details of the program.
ca: La abstracció no és rellevant per a mi en aquest moment. Estic enfocat en detalls concrets i específics del programa.
es: La abstracción no es relevante para mí en este momento. Estoy enfocado en detalles concretos y específicos del programa.
gl: A abstracción non é relevante para min neste momento. Estou enfocado en detalles concretos e específicos do programa.
it: L'astrazione non è rilevante per me in questo momento. Sono concentrato sui dettagli concreti e specifici del programma.
pt: A abstração não é relevante para mim neste momento. Estou focado em detalhes concretos e específicos do programa.
tr: Soyutlama şu anda benim için ilgili değil. Programın somut ve belirli detaylarına odaklanıyorum.

source: Abstraction is minimal. I prefer to stay close to the source code and do not need high levels of generalization.
ca: La abstracció és mínima. Prefereixo mantenir-me a prop del codi font i no necessito nivells alts de generalització.
es: La abstracción es mínima. Prefiero mantenerme cerca del código fuente y no necesito altos niveles de generalización.
gl: A abstracción é mínima. Prefiro manterme preto do código fonte e non necesito niveis altos de xeneralización.
it: L'astrazione è minima. Preferisco rimanere vicino al codice sorgente e non ho bisogno di alti livelli di generalizzazione.
pt: A abstração é mínima. Prefiro manter-me perto do código fonte e não necessito de níveis altos de generalização.
tr: Soyutlama minimal. Kaynak koda yakın kalmayı tercih ediyorum ve yüksek seviyede genelleştirmeye ihtiyaç duymuyorum.

source: Abstraction has some importance, but it is not essential. I am interested in understanding the overall functioning.
ca: La abstracció té certa importància, però no és essencial. Estic interessat en entendre el funcionament general.
es: La abstracción tiene cierta importancia, pero no es esencial. Estoy interesado en entender el funcionamiento general.
gl: A abstracción ten certa importancia, pero non é esencial. Estou interesado en entender o funcionamento xeral.
it: L'astrazione ha una certa importanza, ma non è essenziale. Sono interessato a capire il funzionamento generale.
pt: A abstração tem certa importância, mas não é essencial. Estou interessado em entender o funcionamento geral.
tr: Soyutlama bazı öneme sahip, ancak temel bir gereklilik değil. Genel işleyişi anlamakla ilgileniyorum.

source: Abstraction is important. I value patterns in the code to facilitate its maintenance and extension.
ca: La abstracció és important. Valoro els patrons en el codi per facilitar el seu manteniment i extensió.
es: La abstracción es importante. Valoro los patrones en el código para facilitar su mantenimiento y extensión.
gl: A abstracción é importante. Valorizo os patróns no código para facilitar o seu mantemento e extensión.A abstracción é importante. Valorizo os patróns no código para facilitar o seu mantemento e extensión.
it: L'astrazione è importante. Valorizzo i modelli nel codice per facilitarne la manutenzione e l'estensione.
pt: A abstração é importante. Valorizo os padrões no código para facilitar a sua manutenção e extensão.
tr: Soyutlama önemlidir. Kodda desenleri değerlendiriyorum çünkü bu, bakımını ve genişletilmesini kolaylaştırır.

source: Abstraction is crucial. I value modular and reusable code, which abstracts concepts to improve clarity and efficiency.
ca: La abstracció és crucial. Valoro el codi modular i reutilitzable, que abstraeix conceptes per millorar la claredat i l'eficiència.
es: La abstracción es crucial. Valoro el código modular y reutilizable, que abstrae conceptos para mejorar la claridad y la eficiencia.
gl: A abstracción é crucial. Valorizo o código modular e reutilizable, que abstrai conceptos para mellorar a claridade e a eficiencia.
it: L'astrazione è cruciale. Valorizzo un codice modulare e riutilizzabile, che astrae concetti per migliorare chiarezza ed efficienza.
pt: A abstração é crucial. Valorizo o código modular e reutilizável, que abstrai conceitos para melhorar a clareza e a eficiência.
tr: Soyutlama çok önemlidir. Modüler ve yeniden kullanılabilir kodu değerlendiriyorum; bu, kavramları soyutlayarak netlik ve verimliliği artırır.

source: Abstraction is absolutely vital. The code must be abstract and flexible to adapt to future changes and reuse.
ca: La abstracció és absolutament vital. El codi ha de ser abstracte i flexible per adaptar-se a canvis futurs i reutilització.
es: La abstracción es absolutamente vital. El código debe ser abstracto y flexible para adaptarse a cambios futuros y reutilización.
gl: A abstracción é absolutamente vital. O código debe ser abstracto e flexible para adaptarse a cambios futuros e reutilización.
it: L'astrazione è assolutamente vitale. Il codice deve essere astratto e flessibile per adattarsi a cambiamenti futuri e per il riutilizzo.
pt: A abstração é absolutamente vital. O código deve ser abstrato e flexível para se adaptar a mudanças futuras e reutilização.
tr: Soyutlama kesinlikle hayati öneme sahiptir. Kodun soyut ve esnek olması, gelecekteki değişikliklere uyum sağlaması ve yeniden kullanılabilirliği için gereklidir.

source: Parallelization
ca: Paral·lelisme
gl: Paralelismo
it: Paralelismo
pt: Paralelismo
tr: Paralelleştirme

source: Parallelization is not crucial at this moment. There is no need to execute tasks simultaneously in the code.
ca: La paral·lelització no és crucial en aquest moment. No hi ha necessitat d'executar tasques simultàniament en el codi.
es: La paralelización no es crucial en este momento. No hay necesidad de ejecutar tareas simultáneamente en el código.
gl: A paralelización non é crucial neste momento. Non hai necesidade de executar tarefas simultaneamente no código.
it: La parallelizzazione non è cruciale in questo momento. Non c'è bisogno di eseguire compiti contemporaneamente nel codice.
pt: A paralelização não é crucial neste momento. Não há necessidade de executar tarefas simultaneamente no código.
tr: Paralelleştirme şu anda kritik değil. Kodda görevlerin aynı anda yürütülmesine ihtiyaç yok.

source: Parallelization is minimal. There is no significant need for parallel processing in the code.
ca: La paral·lelització és mínima. No hi ha una necessitat significativa de processament paral·lel en el codi.
es: La paralelización es mínima. No hay una necesidad significativa de procesamiento paralelo en el código.
gl: A paralelización é mínima. Non hai unha necesidade significativa de procesamento paralelo no código.
it: La parallelizzazione è minima. Non c'è un bisogno significativo di elaborazione parallela nel codice.
pt: A paralelização é mínima. Não há uma necessidade significativa de processamento paralelo no código.
tr: Paralelleştirme minimal. Kodda paralel işlemeye büyük bir ihtiyaç yok.

source: Parallelization has some importance. There is a moderate need to execute tasks in parallel in the code.
ca: La paral·lelització té certa importància. Hi ha una necessitat moderada d'executar tasques en paral·lel en el codi.
es: La paralelización tiene cierta importancia. Existe una necesidad moderada de ejecutar tareas en paralelo en el código.
gl: A paralelización ten certa importancia. Hai unha necesidade moderada de executar tarefas en paralelo no código.
it: La parallelizzazione ha una certa importanza. C'è un bisogno moderato di eseguire compiti in parallelo nel codice.
pt: A paralelização tem certa importância. Há uma necessidade moderada de executar tarefas em paralelo no código.
tr: Paralelleştirme biraz önemlidir. Kodda görevlerin paralel olarak yürütülmesine orta derecede bir ihtiyaç vardır.

source: Parallelization is important. Proper parallel processing is required to enhance the code performance.
ca: La paral·lelització és important. Es requereix un processament paral·lel adequat per millorar el rendiment del codi.
es: La paralelización es importante. Se requiere un procesamiento paralelo adecuado para mejorar el rendimiento del código.
gl: A paralelización é importante. Requírese un procesamento paralelo adecuado para mellorar o rendemento do código.
it: La parallelizzazione è importante. È necessario un corretto trattamento parallelo per migliorare le prestazioni del codice.
pt: A paralelização é importante. É necessário um processamento paralelo adequado para melhorar o desempenho do código.
tr: Paralelleştirme önemlidir. Kodun performansını artırmak için uygun paralel işleme gereklidir.

source: Parallelization is crucial. Simultaneous execution of tasks is essential to optimize code performance and efficiency.
ca: La paral·lelització és crucial. L'execució simultània de tasques és essencial per optimitzar el rendiment i l'eficiència del codi.
es: La paralelización es crucial. La ejecución simultánea de tareas es esencial para optimizar el rendimiento y la eficiencia del código.
gl: A paralelización é crucial. A execución simultánea de tarefas é esencial para optimizar o rendemento e a eficiencia do código.
it: La parallelizzazione è cruciale. L'esecuzione simultanea dei compiti è essenziale per ottimizzare le prestazioni e l'efficienza del codice.
pt: A paralelização é crucial. A execução simultânea de tarefas é essencial para otimizar o desempenho e a eficiência do código.
tr: Paralelleştirme kritik öneme sahiptir. Görevlerin eşzamanlı olarak yürütülmesi, kodun performansını ve verimliliğini optimize etmek için gereklidir.
