Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: In this way, we avoid repeating code, which makes our projects easier to program and maintain. As can be seen, the first time the block is used <i>DrawOrange</i> prompted a length of 100 steps, whereas the second time length is 200 steps.
ca: D'aquesta manera, evitem la repetició de codi, cosa que fa que els nostres projectes siguin més fàcils de programar i mantenir. Tal com es pot observar, la primera vegada que s'utilitza el bloc <i> PintaTaronja </i> s'indica una llargada de 100 passos, mentre que a la segona vegada la llargada és de 200 passos.
es: De este modo, evitamos la repetición de código, lo que hace que nuestros proyectos sean más fáciles de programar y mantener. Tal como se puede observar, la primera vez que se usa el bloque <i>PintaNaranja</i> se le indica una longitud de 100 pasos, mientras que la segunda vez la longitud es de 200 pasos.
gl: Deste xeito, evitamos repetir código, o que fai os nosos proxectos máis fáciles de programar e de manter. Como se pode ver, a primeira vez que se usa o bloque <i>DebuxaLaranxa</i> se lle indica unha lonxitude de 100 pasos, mentres que a segunda vez a lonxitude é 200 pasos.
it: In questo modo evitiamo di ripetere il codice, rendendo i nostri progetti più semplici da scrivere e da mantenere. Come si può vedere, la prima volta che viene utilizzato il blocco <i>PaintedOrange</i> viene indicata una lunghezza di 100 passi, mentre la seconda volta la lunghezza è di 200 passi.
pt: Dessa forma, nós evitamos repetir código e isso deixa nossos projetos mais fáceis de programar e manter. Como pode ser visto, na primeira vez que o bloco foi usado, <i>DesenhaLaranja</i> recebeu um comprimento de 100 passos, enquanto que na segunda vez, o comprimento foi de 200 passos.
tr: Bu şekilde, kodu tekrar etmekten kaçınırız, bu da projelerimizi programlamayı ve bakımını daha kolay hale getirir. Görüldüğü gibi, <i>DrawOrange</i> bloğu ilk kullanıldığında 100 adım uzunluğunda, ikinci kullanımda ise 200 adım uzunluğunda bir uzunluk belirlenmiştir.

source: If you get 2 points...
ca: Si has tret 2 punts...
es: Si has sacado 2 puntos...
gl: Se obtés 2 puntos...
it: Se ottieni 2 punti...
pt: Se você ganha 2 pontos...
tr: 2 puan alırsanız...

source: In some Scratch projects we have many identical characters that exactly perform the same actions. The first idea that comes to mind to do this is to create a character, schedule all his behavior and once you're ready, make as many copies as you need. Therefore, if we want 20 Martians, create 20 identical objects. However, what if I want to change the program? Would have to go object by object performing this modification.
ca: En alguns projectes Scratch volem tenir molts personatges iguals que realitzen exactament les mateixes accions. La primera idea que se'ns acut per aconseguir-ho és crear un personatge, programar tot el seu comportament i, un cop enllestit, crear tantes còpies com necessitem. Per tant, si volem 20 marcianets, cal crear 20 objectes iguals. Ara bé, què succeiria si volem realitzar un canvi en un programa? Hauríem d'anar personatge per personatge realitzant aquesta modificació.
es: En algunos proyectos Scratch queremos tener muchos personajes iguales que realizan exacatamente las mismas acciones. La primera idea que se nos ocurre para conseguirlo es crear un personaje, programar todo su comportamiento y, una vez que está listo, crear tantas copias como necesitemos. Por tanto, si queremos 20 marcianitos, hay que crear 20 objetos iguales. Sin embargo, ¿qué ocurriría si quiero realizar un cambio en un programa? Tendría que ir objeto por objeto realizando esa modificación.
gl: Nalgúns proxectos de Scratch temos moitos personaxes idénticos que desenvolven as mesmas accións. A primeira idea que nos vén á cabeza para facer isto é crear un personaxe, programar todo o seu comportamento e unha vez que esteamos listos, facer tantas copias coma necesitemos. Así, se queremos 20 Marciáns, creamos 20 obxectos idénticos. Entón, que pasa se queremos modificar o programa? Teriamos que ir obxecto por obxecto introducindo esa modificación.
it: In alcuni progetti di Scratch abbiamo molti personaggi identici che eseguono esattamente le stesse azioni. La prima idea che può venire in mente per realizzare ciò è di creare un personaggio, pianificare tutto il suo comportamento e una volta fatto crei le copie necessarie. Pertanto, se vogliamo 20 Marziani, creiamo 20 oggetti identici. Tuttavia, cosa succede se voglio fare una modifica allo script? Dovremmo eseguire questa modifica oggetto per oggetto.
pt: Em alguns projetos Scratch, nós temos muitos personagens idênticos que fazem exatamente as mesmas ações. A primeira ideia que você pode ter é criar um personagem, prepara todo o seu comportamento e depois de pronto, fazer tantas cópias quanto necessário. Então, se quisermos 20 marcianos, criamos 20 objetos idênticos. O problema é: e se eu quiser mudar o programa? Teria que ir em um por um e fazer a modificação.
tr: Some Scratch projelerinde birçok aynı karakter vardır ve bunlar tam olarak aynı işlemleri gerçekleştirir. Bunu yapmanın ilk fikri, bir karakter oluşturmak, tüm davranışlarını planlamak ve hazır olduğunda ihtiyacınız olan kadar kopyasını yapmaktır. Yani, 20 Marslı istiyorsak, 20 aynı nesne oluştururuz. Ancak, programı değiştirmek istiyorsak ne olur? Her nesneye tek tek gidip bu değişiklikleri yapmak zorunda kalırız.

source: For such situations it is preferable to use <b>clones</b>, a type of abstraction that helps us to program a single object, and dynamically <b>create exact copies with the same behavior.</b>
ca: Per a aquest tipus de situacions és preferible fer ús de <b>còpies</b>, un tipus d'abstracció que ens ajuda a poder programar un sol personatge, i <b> crear de forma dinàmica còpies exactes amb el mateix comportament.</b>
es: Para este tipo de situaciones es preferible utilizar <b>clones</b>, un tipo de abstracción que nos ayuda a poder programar un solo objeto, y <b>crear de forma dinámica copias exactas con el mismo comportamiento.</b>
gl: Para esas situacións é preferible usar <b>clons</b>, un tipo de abstracción que nos axuda a programar un único obxecto, e <b>crear de xeito dinámico copias idénticas co mesmo comportamento.</b>
it: Per questi casi è preferibile utilizzare i <b>cloni</b>, un tipo di astrazione che ci aiuta a programmare un singolo oggetto e dinamicamente <b> crea copie esatte con lo stesso comportamento.</b>
pt: Nessas situalções, é melhor usar <b>clones</b>, um tipo de abstração que nos ajuda a programar um objeto único e <b>criar cópias exatas com o mesmo comportamento.</b>
tr: Böyle durumlar için <b>klonlar</b> kullanmak daha tercih edilir; bu, tek bir nesneyi programlamamıza ve dinamik olarak <b>aynı davranışa sahip tam kopyalar oluşturmamıza</b> yardımcı olan bir soyutlamadır.

source: Let's see how it works with an example. Imagine you want to pretend that it is snowing on a project. We can draw an object that is a snowflake, and once you start implementing the project, constantly be creating clones appear at the top of the screen and they will fall to the bottom:
ca: Vegem com funcionen amb un exemple. Imagina que en un projecte volem simular que està nevant. Podem dibuixar un personatge que sigui un floc de neu i que, una vegada comenci l'execució del programa, es creïn constantment còpies que apareguin a la part superior de la pantalla i vagin caient fins a la part inferior:
es: Veamos cómo funcionan con un ejemplo. Imagina que queremos simular que está nevando en un proyecto. Podemos dibujar un objeto que sea un copo de nive, y una vez que comience la ejecución del proyecto, ir creando clones constantemente que aparezcan en la parte superior de la pantalla y vayan cayendo hasta la parte inferior:
gl: Vexamos como funciona cun exemplo. Imaxina que queres simular que neva nun proxecto. Podemos debuxar un obxecto que é unha folerpa, e unha vez que empezas a implementar o proxecto, crear constantemente clons que aparezan no extremo superior da pantalla e caian cara abaixo:
it: Vediamo come funziona con un esempio. Immagina di voler simulare una nevicata in un progetto. Possiamo disegnare un oggetto che è un fiocco di neve e una volta avviato il progetto, costantemente, verranno creati dei cloni che appariranno nella parte superiore dello schermo e cadranno in basso:
pt: Vamos ver como isso funciona através de um exemplo. Imagine que você quer simular que está nevando em um projeto. Podemos desenhar um objeto que é um floco de neve, definir que clones são criados constantemente na parte de cima da tela e que caem até a parte de baixo:
tr: Bir örnekle nasıl çalıştığını görelim. Bir projede kar yağıyormuş gibi görünmesini istiyorsunuz. Bir kar tanesi nesnesi çizebiliriz ve projeyi uygulamaya başladığınızda, ekranda sürekli olarak klonlar oluşturup üstten düşmeye başlayacaklar:

source: forever
ca: per sempre
es: por siempre
gl: para sempre
it: per sempre
pt: repete para sempre

source: create clone of [myself v]
ca: crea una còpia de [jo mateix v]
es: crear clon de [yo v]
gl: crear clon de [a min mesmo v]
it: crea clone di [me stesso v]
pt: cria um clone de [ti mesmo v]

source: wait (0.2) secs
ca: espera (0.2) segons
es: esperar (0.2) segundos
gl: agardar (0.2) segundos
it: attendi (0.2) secondi
pt: espera (0.2) s

source: go to x:(pick random(-200) to (200)) y:(200)
ca: vés a x:(nombre a l'atzar entre (-200) i (200)) y:(200)
es: ir a x:(número aleatorio entre (-200) y (200)) y:(200)
gl: ir a x:(número ao chou entre(-200) e (200)) y:(200)
it: vai a x:(numero a caso tra (-200) e (200)) y:(200)
pt: vai para a posição x:(um valor ao acaso entre (-200) e (200)) y:(200)

source: glide (3) secs to x:(x position) y:(-180)
ca: llisca en (3) segons fins a x:(posició x) y:(-180)
es: deslizar en (3) segs a x:(posicion en x) y:(-180)
gl: esvarar durante (3) seg a x:(posición en x) y:(-180)
it: scivola in (3) secondi a x:(x position) y:(-180)
pt: desliza em (3)s para a posição x:(a coordenada x da posição) y:(-180)

source: delete this clone
ca: esborra aquesta còpia
es: eliminar este clon
gl: eliminar este clon
it: elimina questo clone
pt: remove-te como clone

source: Thus, just by programming a character, we can have infinite clones which are created at a particular time of project implementation and are deleted when they are no longer needed.
ca: Així, només programant un personatge podem tenir infinites còpies que es creen en un moment determinat de l'execució del projecte i s'esborren quan ja no són necessàries.
es: De este modo, tan solo programando un personaje podemos tener infinitos clones, que se crean en un momento determinado de la ejecución del proyecto y se borran cuando ya no son necesarios.
gl: Ou sexa, simplemente programando un personaxe, podemos crear infinitos clons que aparezan nun determinado momento da implementación do proxecto e que se borren cando xa non se necesiten máis.
it: Quindi, programmando un solo sprite, possiamo avere infiniti cloni che vengono creati in un determinato momento del programma e vengono eliminati quando non sono più necessari.
pt: Assim, só por programr um personagem, nós podemos ter clones infinitos que são criados em um instante particular da implementação do projeto e que são apagados quando não são mais necessários.
tr: Böylece, sadece bir karakteri programlayarak, belirli bir projede oluşturulup ihtiyaç kalmadığında silinen sonsuz sayıda klon elde edebiliriz.

source: Batch Mode
ca: Anàlisi per lots
gl: Análise por lotes
it: Analisi in batch
pt: Análise em lotes
tr: Toplu Modu

source: You only have to upload a .txt file with the urls of the Scratch's Projects.
ca: Només has de pujar un fitxer .txt amb les URL dels projectes de Scratch.
gl: Tan só debes cargar un ficheiro .txt coas URL dos proxectos de Scratch.
it: Devi solo caricare un file .txt con gli URL dei Progetti di Scratch.
pt: Só precisas carregar um arquivo .txt com as URLs dos projetos do Scratch.
tr: Sadece Scratch projelerinin URL'lerini içeren bir .txt dosyası yüklemeniz gerekiyor.

source: It is extremely easy to use, both for begginers and expert programmers.
ca: És increïblement fàcil d'utilitzar, tant si ets principiant com si ets un programador expert.
es: Es increiblemente fácil de usar, tanto si eres principiante como si eres un programador experto.
gl: É extremadamente fácil de usar, tanto para principiantes coma para programadores expertos.
it: Estremamente facile da usare, sia per i principianti e sia per i programmatori esperti.
pt: É muito fácil de usar, para iniciantes e programadores experientes.
tr: Bu, hem yeni başlayanlar hem de uzman programcılar için son derece kolay kullanılabilir.

source: You receive feedback to improve your coding skills.
ca: Rebràs retroacció per millorar les teves habilitats de programació.
es: Recibirás realimentación para mejorar tus habilidades de programación.
gl: Recibes retroalimentación para mellorar as túas habilidades de programación.
it: Ricevi feedback per migliorare le tue capacità di programmazione.
pt: Você recebe feedback para melhorar suas habilidades de programação.
tr: Kodlama becerilerinizi geliştirmek için geri bildirim alırsınız.

source: You can keep on improving your programming skills by yourself even from home.
ca: Pots seguir millorant les teves habilitats com a programador pel teu compte, fins i tot des de casa.
es: Puedes seguir mejorando tus habilidades como programador por ti mismo, incluso desde casa.
gl: Podes continuar mellorando as túas habilidades de programación por ti mesmo incluso desde a casa.
it: Puoi continuare a migliorare le tue capacità di programmazione anche da solo a casa.
pt: Você pode continuar melhorando suas habilidades de programação até em casa.
tr: Evden bile kendi başınıza programlama becerilerinizi geliştirmeye devam edebilirsiniz.

source: You can track your progress through charts and stats.
ca: Pots realitzar un seguiment del teu progrés a través de gràfics i estadístiques.
es: Puedes realizar un seguimiento de tu progreso a través de gráficos y estadísticas.
gl: Podes seguir o teu progreso a través de táboas e estatísticas.
it: Puoi monitorare i tuoi progressi attraverso grafici e statistiche.
pt: Você pode conferir seu progresso usando gráficos e estatísticas.
tr: İlerlemenizi grafikler ve istatistiklerle takip edebilirsiniz.

source: Data Representation
ca: Representació de les dades
es: Representación de los datos
gl: Representación dos datos
it: Rappresentazione dei Dati
pt: Representação de dados
tr: Temsili veri

source: Every Scratch project needs a set of information about the characters in order to run properly. For example, <b>we need to know the position of each character, the direction it is pointing, size, etc.</b> In addition, programmers can create new information repositories to store other data such as the level at which we find ourselves, elapsed time, the rating, the lives, the rewards collected ...
ca: Cada projecte Scratch necessita un conjunt d'informació sobre els personatges per poder executar-se correctament. Per exemple, <b> necessita conèixer la posició de cada personatge, la direcció a la qual està apuntant, la seva mida, etc.</b> A més, els programadors podem crear nous repositoris d'informació per tal d'emmagatzemar altres tipus de dades, com el nivell en el que ens trobem, el temps transcorregut, la puntuació, les vides, les recompenses recollides...
es: Cada proyecto Scratch necesita un conjunto de información sobre los personajes para poder ejecutarse correctamente. Por ejemplo, <b>necesita conocer la posición de cada personaje, la dirección a la que está apuntando, su tamaño, etc.</b> Además, los programadores podemos crear nuevos depósitos de información para guardar otro tipo de datos, como el nivel en el que nos encontramos, el tiempo transcurrido, la puntación, las vidas, las recompensas recogidas...
gl: Cada proxecto Scratch necesita certa información sobre os personaxes para poder funcionar correctamente. Por exemplo, necesitamos coñecer a posición de cada personaxe, a dirección na que apunta, o seu tamaño, etc. Ademáis, os programadores poden crear novos repositorios de información para almacenar datos tales como o nivel ao que nos atopamos, o tempo transcorrido, a puntuación, as vidas, as recompensas obtidas ...
it: Ogni progetto di Scratch necessita di una serie di informazioni sugli sprite per poter eseguire correttamente il programma. Ad esempio, <b>dobbiamo conoscere la posizione di ciascuno sprite, la direzione in cui punta, la dimensione, ecc.</b> Inoltre, i programmatori possono creare nuovi archivi di informazioni per memorizzare altri dati come il livello a cui ci troviamo, il tempo trascorso, il punteggio, le vite a disposizione, i premi raccolti ...
pt: Cada projeto Scratch precisa de um conjunto de informações sobre os personagens para funcionar corretamente. Por exemplo, <b>precisamos saber a posição de cada personagem, a direção que está apontando, tamanho, etc.</b> Além disso, programadores podem criar novos repositórios de informação para armazenar dados como o nível em que nos encontramos, o tempo decorrido, a classificação, as vidas, as recompensas coletadas...
tr: Her Scratch projesinin düzgün çalışabilmesi için karakterlerle ilgili bir dizi bilgiye ihtiyacı vardır. Örneğin, <b>her karakterin konumunu, hangi yöne baktığını, boyutunu vb. bilmemiz gerekir.</b> Ayrıca, programcılar, bulunduğumuz seviyeyi, geçen süreyi, puanı, canları, toplanan ödülleri gibi diğer verileri saklamak için yeni bilgi havuzları oluşturabilirler...

source: Each character of a Scratch project has a number of features, or attributes, that every moment of the project have value, and can be modified by programs. For example, a character has a certain size that can be modified by block 'resize for 10', making the character appear slightly larger. Following is the list of attributes that each character and blocks that can be used to modify:
ca: Cada personatge d'un projecte Scratch té una sèrie de característiques, o atributs, que en cada moment de l'execució del projecte tenen un valor, i que poden ser modificades pels programes. Per exemple, un personatge té un tamany determinat que pot ser modificat pel bloc "augmenta 10 la mida", fent que el personatge aparegui una mica més gran. A continuació mostrarem el llistat d'atributs que té cada personatge i els blocs que poden emprar-se per modificar-los:
es: Cada personaje de un proyecto Scratch tiene una serie de características, o atributos, que en cada momento de ejecución del proyecto tienen un valor, y que pueden ser modificadas por los programas. Por ejemplo, un personaje tiene un tamaño determinado que puede ser modificado por el bloque “cambiar tamaño por 10”, haciendo que el personaje aparezca un poco más grande. A continuación mostramos la lista de atributos que tiene cada personaje y los bloques que pueden utilizarse para modificarlos:
gl: Cada personaxe dun proxecto Scratch ten certas características, ou atributos, que teñen valor en cada momento do proxecto, e que poden ser modificadas con programas. Por exemplo, un personaxe ten un certo tamaño que pode ser modificado co bloque 'redimensiona por 10', facendo que o personaxe apareza un pouco máis grande. A continuación mostramos a lista de atributos que ten cada personaxe e os bloques que poden usarse para modificalos:
it: Ogni sprite di un progetto di Scratch ha una serie di funzionalità o attributi che ogni momento del progetto hanno un valore che può essere modificato da programma. Ad esempio, uno sprite ha una certa dimensione che può essere modificata dal blocco 'cambia dimensione di 10', rendendo lo sprite leggermente più grande. Di seguito è riportato l'elenco degli attributi che ogni carattere e i blocchi istruzione che possono essere utilizzati per modificarli:
pt: Cada personagem de um projeto Scracth tem um número de características ou atributos que a cada instante do projeto tem um valor e podem ser modificados por programas. Por exemplo, um personagem tem um certo tamanho que pode ser mudado por um bloco 'aumente por 10', fazendo com que o personagem pareca maior. A seguir, tem uma lista de atributos de cada personagem e os blocos que podem ser usados para modificá-los:
tr: Bir Scratch projesindeki her karakterin, proje süresince her an bir değere sahip olan ve programlar tarafından değiştirilebilen bir dizi özelliği veya nitelikleri vardır. Örneğin, bir karakterin boyutunu 'resize for 10' bloğu ile değiştirerek karakteri biraz daha büyük gösterebilirsiniz. Aşağıda, her karakterin sahip olduğu ve değiştirilebilecek nitelikler ile kullanılabilecek blokların listesi verilmiştir:

source: Position:
ca: Posició:
es: Posición:
gl: Posición:
it: Posizione:
pt: Posição:

source: move (10) steps
ca: mou-te (10) passos
es: mover (10) pasos
gl: mover (10) pasos
it: fai (10) passi
pt: anda (10) passos

source: go to x:(0) y:(0)
ca: vés a x:(0) y:(0)
es: ir a x:(0) y:(0)
gl: ir a x:(0) y:(0)
it: vai a x:(0) y:(0)
pt: vai para a posição x:(0) y:(0)

source: glide (1) secs to x:(0) y:(0)
ca: llisca en (1) segons fins a x:(0) y:(0)
es: deslizar en (1) segs a x:(0) y:(0)
gl: esvarar durante (1) seg a x:(0) y:(0)
it: scivola in (1) secondi a x:(0) y:(0)
pt: desliza em (1) s para a posição x:(0) y:(0)

source: set x to (0)
ca: assigna el valor (0) a x
es: dar a x el valor (0)
gl: asignar a x o valor (0)
it: vai dove x è (0)
pt: altera o teu x para (0)

source: set y to (0)
ca: assigna el valor (0) a y
es: dar a y el valor (0)
gl: asignar a y o valor (0)
it: vai dove y è (0)
pt: altera o teu y para (0)

source: change x by (0)
ca: suma (0) a x
es: sumar a x (0)
gl: sumar (0) a x
it: cambia x di (0)
pt: adiciona (0) ao teu x

source: change y by (0)
ca: suma (0) a y
es: sumar a y (0)
gl: sumar (0) a y
it: cambia y di (0)
pt: adiciona (0) ao teu y

source: Size:
ca: Mida:
es: Tamaño:
gl: Tamaño:
it: Dimensioni:
pt: Tamanho:

source: change size by (10)
ca: augmenta (10) la mida
es: cambiar tamaño por (-1)
gl: cambiar tamaño por (10)
it: cambia dimensione di (10)
pt: adiciona (10) ao teu tamanho

source: set size to (120)
gl: pór o tamaño ao (120) &percnt;
it: porta dimensione a (120) &percnt;
pt: altera o teu tamanho para (120) &percnt;

source: Orientation:
ca: Orientació:
es: Orientación:
gl: Orientación:
it: Orientamento:
pt: Orientação:

source: point in direction (90 v)
ca: apunta en direcció (90 v)
es: apuntar en dirección (90 v)
gl: apuntar na dirección (90 v)
it: punta in direzione (90)
pt: altera a tua direcção para (90 v) °

source: point towards [v]
ca: apunta cap a [v]
es: apuntar hacia [v]
gl: apuntar cara a [v]
it: punta verso [v]
pt: aponta em direcção a [v]

source: turn cw (15) degrees
ca: gira ↻ (15) graus
es: girar ↻ (15) grados
gl: xirar ↻ (15) graos
it: ruota in senso orario di (15) gradi
pt: gira ↺ (15) °

source: turn ccw (15) degrees
ca: gira ↺ (15) graus
es: girar ↺ (15) grados
gl: xirar ↺ (15) graos
it: ruota in senso antiorario di (15) gradi
pt: gira ↻ (15) °

source: switch costume to [butterfly v]
ca: canvia el vestit a [butterfly v]
es: cambiar disfraz a [butterfly v]
gl: mudar vestimenta a [bolboreta v]
it: passa al costume [costume 2]
pt: muda o teu traje para [borboleta v]

source: next costume
ca: següent vestit
es: siguiente disfraz
gl: vestimenta seguinte
it: passa al costume seguente
pt: passa para o teu próximo traje

source: change [color v] effect by (25)
ca: augmenta l'efecte [color v] en (25)
es: sumar al efecto [color v] (25)
gl: sumar ao efecto [cor v] o valor (25)
it: cambia effetto [colore v] di (25)
pt: adiciona ao teu efeito [cor v] o valor (25)

source: set [color v] effect to (0)
ca: fixa l'efecte [color v] a (0)
es: dar al efecto [color v] el valor (25)
gl: aplicar o efecto [cor v] como (0)
it: porta effetto [colore v] a (0)
pt: altera o teu efeito [cor v] para (0)
