Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: We know the importance of receiving feedback on your own language to understand every little detail or hint, so we'll translate Dr. Scratch to facilitate coding learning to as many people as possible.
ca: Sabem que és més fàcil entendre cada detall o indicació si la reps en el teu propi idioma, és per això que traduirem Dr. Scratch; així alhora facilitem l'aprentatge d'un major nombre de persones.
es: Sabemos que es más fácil entender cada detalle o indicación si la recibes en tu propio idioma, por ello traduciremos Dr. Scratch para facilitar el aprendizaje del mayor número de personas posible.
gl: Sabemos da importancia de recibir retroaliamentación na túa propia lingua para entender cada detalle ou pista, por iso traducimos Dr.Scratch para facer máis sinxela a aprendizaxe da programación á maior cantidade de xente posible.
it: Sappiamo l'importanza di ricevere feedback nella tua lingua per comprendere ogni dettaglio o suggerimento, tradurremo Dr Scratch per facilitare l'apprendimento del coding per il maggior numero di persone possibile.
pt: Nós sabemos a importância de receber feedback em sua própria língua para entender cada pequeno detalhe ou dica. É por isso que vamos traduzir o Dr.Scratch para facilitar o aprendizado de programação para o maior número possível de pessoas.
tr: Her detay veya ipucunu anlamanın önemini biliyoruz, bu yüzden Dr. Scratch'i mümkün olduğunca çok kişiye kodlama öğrenimini kolaylaştırmak için kendi dilinize çevireceğiz.

source: Teachers will be able to group (and follow) their students to keep track of their progress in a fast and simple way.
ca: Els professors podran agrupar (i seguir) els seus estudiants i realitzar un seguiment dels seus progressos d'una manera ràpida i simple.
es: Los profesores podrán agrupar(y seguir) a sus estudiantes y realizar un seguimiento de sus progresos de una forma rápida y simple.
gl: Os profesores poderán agrupar (e seguir) aos seus alumnos para levar conta do seu progreso do xeito más rápido e sinxelo.
it: Gli insegnanti saranno in grado di raggruppare (e seguire) i propri studenti per tenere traccia dei loro progressi in modo veloce e semplice.
pt: Professores poderão agrupar (e seguir) seus estudantes para acompanhar seu progresso de uma forma rápida e simples.
tr: Öğretmenler, öğrencilerini gruplandırabilir (ve takip edebilir) ve ilerlemelerini hızlı ve basit bir şekilde takip edebilirler.

source: We are in the process of migrating our servers to the Cloud with the aim of providing a better performance.
ca: Estem migrant els nostres servidors al núvol amb l'objectiu d'oferir un millor rendiment.
es: Estamos migrando nuestros servidores a la Nube con el objetivo de ofrecer un mejor rendimiento.
gl: Estamos en proceso de migración dos nosos servidores á Nube co obxectivo de ofrecer unhas mellores prestacións.
it: Siamo in fase di migrazione dei nostri server verso sistemi Cloud allo scopo di offrire una migliore prestazione.
pt: Estamos migrando nossos servidores para a Nuvem, com o objetivo de prover um melhor desempenho.
tr: Sunucularımızı daha iyi bir performans sağlamak amacıyla buluta taşıma sürecindeyiz.

source: With Dr. Scratch plug-ins for Chrome and Firefox, students will analyze their project WHILE programming on the Scratch website.
ca: Amb les extensions de Dr. Scratch per a Chrome i Firefox, els estudiants podran analitzar els seus projectes MENTRE programen en la web de Scratch.
es: Con los plugins de Dr. Scratch para Chrome y Firefox, los estudiantes podrán analizar sus proyectos MIENTRAS programan en la web de Scratch.
gl: Cos plugins de Dr. Scratch para Chrome e Firefox, os alumnos poderán analizar o seu proxecto MENTRES programan no sitio web de Scratch.
it: Con i plugin di Dr Scratch per Chrome e Firefox, gli studenti analizzeranno il loro progetto DURANTE la programmazione sul sito web Scratch.
pt: Com os plugins do Dr. Scratch para Chrome e Firefox, os estudantes analisarão seus projetos ENQUANTO programam no site do Scratch.
tr: Dr. Scratch eklentileri ile Chrome ve Firefox için öğrenciler, Scratch web sitesinde programlama yaparken projelerini analiz edebilecekler.

source: We'd like to take learners curiosity one step further. Do you have cool ideas to gamify our platform?
ca: Ens agradaria dur la curiositat dels estudiants un pas més enllà. Tens bones propostes per ludificar la nostra plataforma?
es: Nos gustaría conseguir motivar la curiosidad de los estudiantes. ¿Tienes ideas interesantes para gamificar nuestra plataforma?
gl: Queremos levar a curiosidade dos estudantes un paso máis aló. Tes boas ideas para gamificar a nosa plataforma?
it: Vorremmo suscitare curiosità negli studenti come ulteriore passo avanti. Hai idee cool per rendere più accattivante la nostra piattaforma?
pt: Gostaríamos de elevar a curiosidade dos aprendizes um nível acima. Você tem ideias para gameficar nossa plataforma?
tr: Öğrencilerin merakını bir adım daha ileriye taşımak istiyoruz. Platformumuzu oyunlaştırmak için harika fikirleriniz var mı?

source: The new social network funcionalities will allow users to communicate with each other to exchange ideas and challenges.
ca: Les funcionalitats de xarxa social que inclourem permetran als usuaris comunicar-se entre ells i intercanviar idees i reptes.
es: Las funcionalidades de red social que incluiremos permitirán a los usuarios comunicarse entre ellos e intercambiar ideas y retos.
gl: As novas funcionalidades de red social permiten aos usuarios comunicarse entre eles para intercambiar ideas e retos.
it: Le nuove funzionalità di social network consentiranno agli utenti di comunicare tra loro per scambiarsi idee e sfide.
pt: As novas funcionalidades da rede social vão permir que os usuários se comuniquem para trocar ideias e desafios.
tr: Yeni sosyal ağ özellikleri, kullanıcıların birbirleriyle iletişim kurarak fikir ve zorlukları paylaşmalarını sağlayacak.

source: Contact
ca: Contacte
es: Contacto
gl: Contacto
it: Contatti
pt: Contato
tr: Temas etmek

source: <strong>Contact </strong> Dr. Scratch team</h2>
ca: <strong>Contacta </strong>amb l'equip de Dr. Scratch</h2>
es: <strong>Contacta </strong>con el equipo Dr. Scratch</h2>
gl: <strong>Contacta co</strong> equipo Dr. Scratch</h2>
it: <strong>Contatti</strong> team di Dr Scratch</h2>
pt: <strong>Entre em contato com </strong> o time do Dr. Scratch</h2>
tr: <strong>Temas etmek </strong> Dr. Scratch Ekibi</h2>

source: We would be pleased to receive your feedback
ca: Ens agradaria conèixer la teva opinió i escoltar les teves idees
es: Nos gustaría conocer tu opinión y escuchar tus ideas
gl: Encantados de recibir a túa retroalimentación
it: Saremo lieti di ricevere i tuoi commenti
pt: Gostaríamos de receber seus comentários
tr: Geri bildiriminizi memnuniyetle bekliyoruz

source: We would like to thank many people for their collaboration and we have done one special section.
ca: Ens agradaria agrair a molta gent la seva col·laboració i hem inclòs una secció especial.
es: Nos gustaría agradecer a mucha gente su colaboración y hemos incluido una sección especial para ello.
it: Vorremmo ringraziare molte persone per la loro collaborazione e abbiamo fatto una sezione speciale.
pt: Gostaríamos de agradecer a todos por sua colaboração e para isso fizemos essa seção especial.
tr: Birçok kişinin katkılarına teşekkür etmek istiyoruz ve bunun için özel bir bölüm oluşturduk.

source: Collaborators
ca: Col·laboradors
es: Colaboradores
it: Collaboratori
pt: COlaboradores
tr: İşbirlikçiler

source: Are you a Dr. Scratch user?
ca: Ets usuari de Dr. Scratch?
es: ¿Eres usuario de Dr. Scratch?
gl: Es un usuario de Dr. Scratch?
it: Sei un utente di Dr Scratch?
pt: Você é um usuário do Dr. Scratch?
tr: Dr. Scratch kullanıcısı mısınız?

source: Join now!
ca: Prova-ho!
es: ¡Pruébalo!
gl: Únete!
it: Iscriviti adesso!
pt: Inscreva-se agora!
tr: Şimdi Katıl!

source: <img class='framed' src='static/app/images/url-en.png' />
ca: <img class='framed' src='static/app/images/url-ca.png' />
es: <img class='framed' src='static/app/images/url-es.png' />
it: <img class='framed' src='static/app/images/url-it.png' />
pt: <img class='framed' src='static/app/images/url-pt.png' />

source: <img class='framed' src='static/app/images/project-en.png' />
ca: <img class='framed' src='static/app/images/project-ca.png' />
es: <img class='framed' src='static/app/images/project-es.png' />
it: <img class='framed' src='static/app/images/project-it.png' />
pt: <img class='framed' src='static/app/images/project-pt.png' />

source: Wait a moment please
es: Espere un momento, por favor.
gl: Agarda un intre, por favor
it: Per favore, attendi un momento
pt: Espere um pouco, por favor
tr: Bir dakika lütfen

source: Sign up
ca: Registra't!
es: Regístrate
it: Registrati
pt: Cadastre-se!
tr: Üye olmak

source: <input class='form-control' type='password' name='hashkey' id='hashkey' placeholder='Hashkey' style='margin-bottom: 15px;'>
ca: <input class='form-control type='password' name='hashkey' id='hashkey' placeholder='Clave' style='margin-bottom: 15px;'>
es: <input type='password' class='form-control' name='hashkey' id='hashkey' placeholder='Clave' style='margin-bottom: 15px;'>
it: <input class='form-control' type='password' name='hashkey' id='hashkey' placeholder='Codice di controllo' style='margin-bottom: 15px;'>
pt: <input type='password' name='hashkey' id='hashkey' placeholder='hashkey' style='margin-bottom: 15px;'>

source: <input type='submit' value='Sign up' id='sign-up' class='btn-group btn-group-justified colored-text'>
ca: <input type='submit' value='Registra't' id='sign-up' class='btn-group btn-group-justified colored-text'>
es: <input type='submit' value='Regístrate' id='sign-up' class='btn-group btn-group-justified colored-text'>
it: <input type='submit' value='Registrati' id='sign-up' class='btn-group btn-group-justified colored-text'>

source: I forgot my password
ca: Has oblidat la teva contrasenya?
es: ¿Has olvidado tu contraseña?
it: Ho dimenticato la mia password
pt: Esqueci minha senha
tr: Şifremi unuttum

source: <input type='submit' value='Sign in' id='sign-in' class='btn-group btn-group-justified colored-text'>
ca: <input type='submit' value='Accedeix' id='sign-in' class='btn-group btn-group-justified colored-text'>
es: <input type='submit' value='Ingresar' id='sign-in' class='btn-group btn-group-justified colored-text'>
it: <input type='submit' value='Registrati' id='sign-in' class='btn-group btn-group-justified colored-text'>

source: Thanks all of you!
ca: Gràcies a tots!
es: ¡Gracias a todos!
gl: Grazas a todos!
it: Grazie a tutti voi!
pt: Obrigado a todos!
tr: Size hepinize teşekkürler!

source: We are so pleased to receive so much help of you and we thought that the best way of show our appreciation is including your work in the website. In this space you can see who people help us to improve Dr. Scratch!
ca: Estem molt agraïts de rebre la vostra ajuda i hem pensat que la millor manera de mostrar el nostre apreci és incloent el vostre treball a la web. En aquest espai podràs veure la gent que ens ha ajudat a millorar Dr. Scratch.
es: Estamos muy agradecidos de recibir vuestra ayuda y hemos pensado que la mejor manera de mostrar nuestro aprecio es incluyendo vuestro trabajo en la web. En este espacio podrás ver la gente que nos ha ayudado a mejorar Dr. Scratch.
gl: Estamos moi agradecidos de recibir a vosa axuda e pensamos que a mellor maneira de mostrar o noso aprecio é incluíndo o voso traballo na web. Neste espazo podedes ver a xente que nos axudou a mellorar Dr. Scratch.
it: Siamo lieti di ricevere così tanto aiuto da parte vostra e abbiamo pensato che il modo migliore per mostrare il nostro apprezzamento è includere il vostro lavoro nel sito web. In questo spazio puoi vedere chi ci aiuta a migliorare Dr Scratch!
pt: Ficamos muito agradecidos de receber a ajuda de todos e pensamos que a melhor maneira de mostrar nossa gratidão é incluir o seu trabalho em nosso site. Aqui você pode ver quem tem ajudado a melhorar o Dr. Scratch!
tr: Sizden bu kadar çok yardım aldığımız için çok mutluyuz ve minnettarlığımızı göstermek için en iyi yolun çalışmalarınızı web sitesinde sergilemek olduğuna karar verdik. Bu alanda, Dr. Scratch'ı geliştirmemize yardımcı olan kişileri görebilirsiniz!

source: Who we are
ca: Qui som
es: Quiénes somos
gl: Quen somos
it: Chi siamo
pt: Quem somos
tr: Biz kimiz

source: Dr. Scratch's team likes to thank you for your contributions.
ca: L'equip de Dr. Scratch agraeix les vostres contribucions.
es: El equipo de Dr. Scratch agradece vuestras contribuciones.
gl: O equipo de Dr. Scratch agradece as vosas contribucións.
it: La squadra di Dr Scratch è lieta di ringraziarvi per i vostri contributi.
pt: A equipe do Dr. Scratch gostaria de agradecer a todos por sua contribuição.
tr: Dr. Scratch ekibi katkılarınız için teşekkür etmek ister.

source: Team Members
ca: Membres de l'Equip
gl: Membros do Equipo
it: Membri del Team
pt: Membros da Equipe
tr: Takım üyeleri

source: Would you like help us to translate Dr. Scratch to your language? Many people have already helped us!
ca: T'agradaria ajudar-nos a traduir Dr. Scratch a la teva llengua? Molta gent ens ha ajudat ja!
es: ¿Te gustaría ayudarnos a traducir Dr. Scratch a tu lengua? ¡Mucha gente nosha ayudado ya!
gl: M'agradaría axudarvos a traducir Dr. Scratch á túa lingua? Moita xente xa nos axudou!
it: Vuoi aiutarci a tradurre Dr Scratch nella tua lingua? Molte persone ci hanno già aiutato!
pt: Você gostaria de traduzir Dr. Scratch para o seu idioma? Muitas pessoas já nos ajudaram!
tr: Dr. Scratch'ı kendi dilinize çevirmemize yardım etmek ister misiniz? Birçok kişi bize zaten yardımcı oldu!

source: Developer
ca: Desenvolupador
gl: Desenvolvedor
it: Sviluppatore
pt: Desenvolvedor
tr: Geliştirici

source: Translations
ca: Traduccions
es: Traducciones
gl: Traducións
it: Traduzioni
pt: Traduções
tr: Çeviriler

source: Portuguese
ca: Portuguès
es: Portugués
it: Portoghese
pt: Português
tr: Portekizce

source: Greek
ca: Grec
es: Griego
it: Greco
pt: Grego
tr: Yunan

source: Catalan
ca: Català
es: Catalán
it: Catalano
pt: Catalão
tr: Katalanca

source: Galician
ca: Gallec
es: Gallego
it: Galiziano
pt: Galício
tr: Galiçyaca

source: Workshops
ca: Tallers
es: Talleres
gl: Talleres
it: Workshop
pt: Oficinas
tr: Atölyeler

source: We are collaborating with several schools where we can prove the website with children and see which features they need.
ca: Estem col·laborant amb moltes escoles on es pot provar el nostre lloc web i veure quines funcionalitats necessiten.
es: Estamos colaborando con muchas escuelas donde pueden probar nuestrositio web y ver qué funcionalidades necesitan.
gl: Estamos colaborando con moitas escolas onde se pode probar o noso sitio web e ver qué funcionalidades necesitan.
it: Stiamo collaborando con diverse scuole dove possiamo provare Dr Scratch con i bambini e vedere di quali caratteristiche hanno bisogno.
pt: Trabalhamos em parceria com várias escolas, onde podemos testar a plataforma com crianças e identificar suas necessidades.
tr: Çocuklarla web sitesini test edebileceğimiz ve hangi özelliklere ihtiyaç duyduklarını görebileceğimiz birkaç okul ile iş birliği yapıyoruz.

source: Thanks all of children and teachers who help us with the development!
ca: Gràcies a tots els infants i professors que ens ajuden amb el desenvolupament!
es: ¡Gracias a todos los niños y profesores que nos ayudan con el desarrollo!
gl: Gracias a todos os nenos e profesores que nos axudan co desenvolvemento!
it: Grazie a tutti i bambini e agli insegnanti che ci aiutano con lo sviluppo!
pt: Obrigado a todos os alunos e professores que nos ajudam com o desenvolvimento da plataforma!
tr: Yardım eden tüm çocuklara ve öğretmenlere teşekkürler!

source: Teacher: Jorge Lobo
ca: Professor: Jorge Lobo
es: Profesor: Jorge Lobo
gl: Profesor: Jorge Lobo
it: Insegnante: Jorge Lobo
pt: Professor: Jorge Lobo
tr: Öğretmen: Jorge Lobo

source: Teacher: Chema Gonzalez
es: Profesor: Chema Gonzalez
gl: Profesor: Chema Gonzalez
it: Insegnante: Chema Gonzalez
tr: Öğretmen: Chema Gonzalez

source: <strong>More thanks</strong></h2>
ca: <strong>Més agraïments</strong></h2>
es: <strong>Más agradecimientos</strong></h2>
gl: <strong>Máis grazas</strong></h2>
it: <strong>Molte grazie</strong></h2>
pt: <strong>Mais graças</strong></h2>
tr: <strong>Daha fazla teşekkürler</strong></h2>

source: Tell us how your experience went...
ca: Explica'ns com ha estat la teva experiència...
gl: Explícanos como foi a túa experiencia...
it: Dicci com'è andata la tua esperienza...
pt: Explique-nos como foi a tua experiência...
tr: Deneyiminizi bize anlatın...

source: Fill out the form and we will contact you as soon as possible
ca: Omple el formulari i ens posarem en contacte amb tu el més aviat possible.
gl: Preenche o formulario e poñerémonos en contacto contigo o antes posible.
it: Compila il modulo e ti contatteremo il prima possibile.
pt: Preencha o formulário e entraremos em contato contigo o mais breve possível.
tr: Formu doldurun ve en kısa sürede sizinle iletişime geçeceğiz.

source: Your name
ca: Nom:
gl: Nome:
it: Il tuo nome
pt: Nome:
tr: Adınız

source: Enter your name
ca: Introdueix el teu nom:
gl: Introduce o teu nome:
it: Inserisci il tuo nome
pt: Introduza o seu nome:
tr: Adınızı giriniz

source: Obligatory
ca: Obligatori
gl: Obrigatorio
it: Obbligatorio
pt: Obrigatório
tr: Zorunlu

source: Your email
ca: Correu electrònic:
gl: Correo electrónico:
it: Il tuo indirizzo email
pt: Correo eletrónico:
tr: E-posta adresiniz

source: Enter email
ca: Introdueix el teu correu electrònic:
gl: Introduce o teu correo electrónico:
it: Inserisci l'email
pt: Introduza o seu endereço de email:
tr: E-posta girin

source: <input name='contact_media' type='file' class='filestyle' data-buttonText='Upload media'>
ca: <input name='contact_media' type='file' class='filestyle' data-buttonText='Adjuntar foto/video'>
gl: <input name='contact_media' type='file' class='filestyle' data-buttonText='Anexar foto/vídeo'>
it: <input name='contact_media' type='file' class='filestyle' data-buttonText='Carica foto/vídeo'>
pt: <input name='contact_media' type='file' class='filestyle' data-buttonText='Anexar foto/vídeo'>
tr: <input name='contact_media' type='file' class='filestyle' data-buttonText='Medya yükle'>

source: Specific parts of the project that do not contribute to good programming practices
ca: Parts específiques del projecte que no contribueixen a bones pràctiques de programació
gl: Partes específicas do proxecto que non contribúen a boas prácticas de programación
it: Parti specifiche del progetto che non contribuiscono a buone pratiche di programmazione
pt: Partes específicas do projeto que não contribuem para boas práticas de programação
tr: İyi programlama uygulamalarına katkıda bulunmayan projedeki belirli kısımlar

source: Dimensions Evaluated in your Scratch Project
ca: Dimensions avaluades en el teu projecte de Scratch
gl: Dimensións avaliadas no teu proxecto de Scratch
it: Dimensioni valutate nel tuo Progetto Scratch
pt: Dimensões avaliadas no teu projeto de Scratch
tr: Scratch Projenizde Değerlendirilen Boyutlar

source: Grade of each Dimension
ca: Escala de puntuació de cada dimensió
gl: Escala de puntuación de cada dimensión
it: Voto di ciascuna Dimensione
pt: Escala de pontuação de cada dimensão
tr: Her Boyutun Puanı

source: Certificate of the Evaluation of your Scratch Project
ca: Certificat de l'Avaluació del teu projecte de Scratch
gl: Certificado da Avaliación do teu proxecto de Scratch
it: Certificato di Valutazione del tuo Progetto Scratch
pt: Certificado de Avaliação do teu projeto de Scratch
tr: Scratch Projenizin Değerlendirme Sertifikası

source: Grade from 1 to 3 of each Dimension
ca: Escala de 1 a 3 de la puntuació de cada Dimensió
gl: Escala de 1 a 3 da puntuación de cada Dimensión
it: Voto da 1 a 3 per ogni Dimensione
pt: Escala de 1 a 3 da pontuação de cada Dimensão
tr: Her Boyutun 1'den 3'e Derecelendirmesi

source: The level of your project is...
ca: El nivell del teu projecte és...
gl: O nivel do teu proxecto é...
it: Il livello del tuo progetto è...
pt: O nível do teu projeto é...
tr: Projenizin seviyesi...

source: This is a Beta version
ca: Això és una versió Beta
gl: Esto é unha versión Beta
it: Questa è una versione Beta
pt: Esta é uma versão Beta
tr: Bu bir Beta sürümüdür.

source: We are still working on it. If you have any comments or ideas please contact us
ca: Continuem treballant en això. Si tens algun comentari o idea, si us plau, posa't en contacte amb nosaltres
es: Seguimos trabajando en ello. Si tienes algún comentario o idea por favor contáctanos
gl: Continuamos traballando niso. Se tes algún comentario ou idea, por favor, ponte en contacto connosco.
it: Stiamo ancora lavorando su di esso. Se hai commenti o idee, per favore contattaci
pt: Continuamos trabalhando nisso. Se você tiver algum comentário ou ideia, por favor, entre em contato conosco.
tr: Üzerinde çalışmaya devam ediyoruz. Yorumlarınız veya fikirleriniz varsa lütfen bizimle iletişime geçin.

source: here
ca: aquí
es: aquí
gl: aquí
it: qui
pt: aquí
tr: Burada

source: Welcome to the Dr. Scratch website, an analytical tool that evaluates your Scratch projects in a variety of computational areas. This analyzer is a helpful tool to evaluate your own projects, or those of your Scratch students.
ca: Benvingut a la web de Dr. Scratch, una aplicació que avalua projectes Scratch en relació a diferents aspectes del pensament computacional. Aquest analitzador és una eina molt útil tant per avaluar els teus projectes Scratch com els dels teus alumnes.
es: Bienvenido a la Web de Dr. Scratch, es una aplicación que evalúa proyectos Scratch en relación a varios aspectos del pensamiento computacional. Este analizador es una herramienta muy útil tanto para evaluar tus proyectos Scratch como los de tus estudiantes.
gl: Benvido ao sitio web de Dr. Scratch, unha ferramenta de análise para avaliar os teus proxectos Scratch en distintos aspectos computacionais. Este analizador é unha ferramenta útil para avaliar os teus propios proxectos, ou os dos teus alumnos.
it: Benvenuti nel sito web di Dr Scratch, uno strumento analitico che valuta i tuoi progetti Scratch in diverse aree computazionali. Questo analizzatore è uno strumento utile per valutare i propri progetti Scratch o quelli dei tuoi studenti.
pt: Bem-vindo ao site do Dr. Scratch, uma ferramenta de análise que avalia seus projetos Scratch em várias áreas da computação. Esse analisador é uma ferramenta muito útil para avaliar seus próprios projetos ou os dos seus estudantes.
tr: Dr. Scratch web sitesine hoş geldiniz, Scratch projelerinizi çeşitli hesaplamalı alanlarda değerlendiren bir analiz aracı. Bu analiz aracı, kendi projelerinizi veya Scratch öğrencilerinizin projelerini değerlendirmek için yararlı bir araçtır.

source: IMPORTANT!
gl: ¡IMPORTANTE!
it: IMPORTANTE!
pt: IMPORTANTE!
tr: ÖNEMLİ!

source: Please upload a txt containing the URLs of the projects, with each URL on a separate line. (Max. 10)
ca: Per favor, puja un fitxer de text que contingui les URL dels projectes, només una URL per línia. (Màx. 10)
gl: Por favor, sobe un ficheiro de texto que conteña as URLs dos proxectos, só unha URL por liña. (Máx. 10)
it: Si prega di caricare un file di testo contenente gli URL dei progetti, con ogni URL su una riga separata. (Max. 10)
pt: Por favor, suba um arquivo de texto que contenha os URLs dos projetos, apenas um URL por linha. (Máx. 10)

source: Analyze my projects
ca: Analitza els meus projectes
es: Analiza mis proyectos
gl: Analiza os teus proxectos
it: Analizza i miei progetti
pt: Analise seus projetos Scratch
tr: Projelerimi analiz et
