Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: when backdrop switches to [Spring v]
ca: quan l'escenari canviï al fons [Primavera v]
es: cuando el fondo cambie a [Primavera v]
gl: Ao mudar o fondo a [Primavera v]
it: quando lo sfondo passa a [Primavera v]
pt: Quando o cenário mudar para [Primavera v]

source: say [Spring has come!] for (2) secs
ca: digues [La primavera ha arribat!] durant (2) segons
es: decir [La primavera ha llegado] durante (2) segundos
gl: dicir [A primavera chegou] durante (2) segundos
it: dire [La Primavera è arrivata!] per (2) secondi
pt: diz [A primavera chegou!] durante (2) s

source: In the first example, when program execution reaches that point will stop until the condition is met in this case, until life is equal to 0. When lives equal to 0, then continue execution of the remaining blocks, this case, <i>'said Game Over'</i> and <i>'stop all'</i>, which ends the execution of the project.
ca: En el primer exemple, quan l'execució del programa arribi a aquest punt s'aturarà fins que es compleixi la condició; en aquest cas, fins que les vides siguin igual a 0. Quan això passi, aleshores procedirà a l'execució de la resta de blocs, en aquest cas <i>"digues Fi del joc"</i> i <i>"atura tot", la qual cosa finalitzarà l'execució del projecte.
es: En el primer ejemplo, cuando la ejecución del programa llegue a ese punto se detendrá hasta que se cumpla la condición, en este caso hasta que vidas sea igual a 0. Cuando vidas valga 0, entonces continuará la ejecución del resto de bloques, en este caso <i>“decir Game Over”</i> y <i>“detener todos”</i>, lo que finalizará la ejecución del proyecto.
gl: No primeiro exemplo, cando a execución do programa acada ese punto, esperará ata que a condición se cumpra, neste caso ata que as vidas sexan 0. No momento en que o número de vidas sexa 0, entón continúa a execución dos bloques restantes, neste caso, <i>'dicir Xogo finalizado'</i> e <i>'parar todo'</i>, que termina a execución do proxecto.
it: Nel primo esempio, quando l'esecuzione del programma raggiunge quel punto asspetterà fino a quando la condizione non viene soddisfatta in questo caso, finché la variabile vite non avrà il valore uguale a 0. Quando vite è uguale a 0, continua l'esecuzione dei blocchi rimanenti, in questo caso, <i>'dire Game Over '</i> e <i>'ferma tutto '</i>, che termina l'esecuzione dell'intero progetto.
pt: No primeiro exemplo, quando a execução do programa chega naquele ponto, vai ficar parada até que a condição seja atendida: nesse caso, até que a vida seja igual a 0. Quando a vida chega a 0, continua a execução dos blocos restantes: nesse caso, <i>'diga Fim do jogo'</i> e <i>'pára tudo'</i>, que termina a execução do projeto.
tr: In the first example, when program execution reaches that point, it will stop until the condition is met—in this case, until the lives are equal to 0. Once the lives equal 0, the program continues executing the remaining blocks, which in this case are <i>'say Game Over'</i> and <i>'stop all'</i>, ending the execution of the project.

source: In the second example, the moment when the scene changes to the backdrop with the name 'Spring', the character will execute the blocks placed after the instruction 'when the backdrop changes to Spring', ie to be displayed and will say 'spring has come!'.
ca: En el segon exemple, en el moment en què l'escenari canviï al fons amb el nom "Primavera", el personatge executarà els blocs col·locats a continuació de la instrucció "quan l'escenari canviï al fons Primavera" i per tant dirà "La primavera ha arribat!".
es: En el segundo ejemplo, en el momento en el que el escenario cambie al fondo con el nombre “Primavera”, el personaje ejecutará los bloques colocados a continuación de la instrucción “cuando el fondo cambia a Primavera”, es decir, que se mostrará y dirá “¡Ha llegado la primavera”.
gl: No segundo exemplo, no momento en que o fondo da escena cambia ao chamado 'Primavera', o personaxe executará os bloques situados a continuación da instrucción 'cando o fondo cambie a Primavera', ou sexa que o mostrará e dirá 'chegou a primavera!'
it: Nel secondo esempio, il momento in cui la scena cambia sfondo con quello che ha nome 'Primavera', il personaggio eseguirà i blocchi posti dopo l'istruzione 'quando lo sfondo passa a Primavera', vale a dire mostra e dire 'La Primavera è arrivata!'.
pt: No segundo exemplo, no momento em que o palco muda para o fundo com o nome 'Primavera', o personagem irá executar os blocos colocados depois da instrução 'quando o fundo muda para Primavera', ou seja, irá mostrar esse novo fundo e irá falar 'a primavera chegou!'
tr: In the second example, when the scene changes to the backdrop named 'Spring', the character will execute the blocks placed after the instruction 'when the backdrop changes to Spring'. This will result in the character being displayed and saying 'Spring has come!'.

source: User Interactivity
ca: Interactivitat de l'usuari
gl: Interactividade do susario
it: Interattività dell'utente
pt: Interatividade do usuário
tr: ullanıcı Etkileşimi

source: The instructions related to user interactivity can <b>help your Scratch projects be more interactive</b>, ie the person who is running it can perform actions that provoke new situations in the project. For example, I can use the keyboard or mouse to move a character, you can answer questions or playing computer webcam, among many other possibilities.
ca: Les instruccions relacionades amb la interactivitat amb l'usuari <b>poden ajudar-te a fer els projectes de Scratch més interactius</b>, és a dir, que la persona que estigui executant-lo pugui realitzar accions que provoquin noves situacions en el projecte. Per exemple, que pugui utilitzar el teclat o el ratolí per moure un personatge, respondre preguntes o jugar amb la càmera web de l'ordinador, entre moltes altres possibilitats.
es: Las instrucciones relacionadas con la interactividad con el usuario <b>pueden ayudarte a que tus proyectos Scratch sean más interactivos</b>, es decir, que la persona que esté ejecutándolo pueda realizar acciones que provoquen nuevas situaciones en el proyecto. Por ejemplo, puedo utilizar el teclado o el ratón para mover un personaje, puede contestar preguntas o jugar con la webcam del ordenador, entre otras muchas posibilidades.
gl: As instrucción relacionadas coa interactividade do usuario poden <b>axudar a facer os teus proxectos Scratch máis interactivos</b>, é dicir, que a persoa que os estea executando poda desenvolver accións que provoquen novas situación no proxecto. Por exemplo, podo usar o teclado ou o rato para mover un personaxe, podes responder preguntas ou acender a cámara web do ordenador, entre outras posibilidades.
it: Le istruzioni di interattività utente possono <b>rendere più interattivi i tuoi progetti di Scratch</b>, cioè la persona che lo esegue può fare azioni che provocano nuove situazioni nel progetto. Ad esempio, posso usare la tastiera o il mouse per spostare un personaggio, puoi rispondere alle domande o giocare con la webcam del computer, queste sono alcune tra molte altre possibilità.
pt: As instruções sobre interatividade com o usuário podem <b>ajudar seus projetos Scratch a ficarem mais interativos</b>, ou seja, permitir que quem rode seus projetos possa criar situações novas no projeto. Por exemplo, eu poderia usar o teclado ou mouse para mover um personagem, você poderia responder perguntas ou usar a webcam, entre outras possibilidades.
tr: Kullanıcı etkileşimi ile ilgili talimatlar, <b>Scratch projelerinizi daha etkileşimli hale getirmeye yardımcı olabilir</b>, yani projeyi çalıştıran kişi, projede yeni durumlar yaratan eylemler gerçekleştirebilir. Örneğin, bir karakteri hareket ettirmek için klavye veya fare kullanabilir, soruları yanıtlayabilir veya bilgisayar kamerasıyla oynayabilirsiniz; bunlar ve daha pek çok olasılık mevcuttur.

source: The most basic block you can start working interactivity with the user is <i>'when green flag clicked'</i>.
ca: El bloc més bàsic amb el que pots començar a treballar la interactivitat amb l'usuari és <i>"Quan la bandera verda es premi"</i>
es: El bloque más básico con el que puedes comenzar a trabajar la interactividad con el usuario es <i>“Al presionar la bandera verde”</i>
gl: O bloque máis básico para empezar a traballar a interactividade co usuario é <i>'cando se preme na bandeira verde'</i>.
it: Il blocco più semplice con cui puoi iniziare a lavorare con l'utente è <i>'quando si clicca sulla bandiera verde'</i>.
pt: O bloco mais simples que você pode começar a usar para incluir interatividade com o usuário é <i>'quando a bandeira verde for clicada'</i>.
tr: En temel etkileşimli blok, kullanıcı ile etkileşime geçmeye başlamanın yolu <i>'yeşil bayrağa tıklandığında'</i>' bloğudur.

source: How this block works? When the user who wants to run your project Scratch clicks on the green flag, all blocks were placed under the block <i>'when green flag clicked'</i> begin to run. You can have as many programs as you need to start with this block.
ca: Com funciona aquest bloc? Quan l'usuari que vol executar el teu projecte Scratch faci clic a la bandera verda, començaran a executar-se tots els blocs que s'hagin col·locat després del bloc <i>"Quan la bandera verda es premi"</i>. Pots tenir tants programes com siguin necessaris que comencin amb aquest bloc.
es: ¿Cómo funciona este bloque? Cuando el usuario que quiere ejecutar tu proyecto Scratch pinche en la bandera verde, comenzarán a ejecutarse todos los bloques que se hayan colocado bajo el bloque <i>“al presionar la bandera verde”</i>. Puedes tener tantos programas como necesites que comiencen con este bloque.
gl: Como funciona este bloque? Cando o usuario que quere executar o teu proxecto de Scratch <i>preme sobre a bandeira verde</i>, todos os bloques situados baixo o bloque 'cando se prema na bandeira verde' comezan a executarse. Podes ter cantos programas necesites para comezar con este bloque.
it: Come funziona questo blocco? Quando l'utente che desidera eseguire il tuo progetto fa clic sulla bandiera verde, tutti i blocchi che sono stati collocati sotto il blocco <i>'quando si clicca sulla bandiera verde'</i> inizia l'azione. Puoi avere fare iniziare con questo blocco tutti gli script che ti servono.
pt: Como esse bloco funciona? Quando o usuário que quer rodar seu projeto Scratch cloca na bandeira verde, todos os blocos colocados sob o bloco <i>'quando a bandeira verde for clicada'</i> começam a rodar. Você pode ter quantos programas você precise que comecem com esse bloco.
tr: Bu blok nasıl çalışır? Scratch projenizi çalıştırmak isteyen kullanıcı yeşil bayrağa tıkladığında, <i>'yeşil bayrağa tıklandığında'</i> bloğunun altına yerleştirilmiş tüm bloklar çalışmaya başlar. Bu blok ile başlamak için ihtiyacınız olan kadar çok programınız olabilir.

source: Now that you have begun to interact with the user running your Scratch project, perhaps you can try some of the following blocks:
ca: Ara que ja has començat a interactuar amb l'usuari que executi el teu projecte Scratch, potser puguis provar alguns dels següents blocs:
es: Ahora que has comenzado a interactuar con el usuario que ejecute tu proyecto Scratch, quizás puedes probar algunos de los siguientes bloques:
gl: Agora que xa empezaches a experimentar coa interactividade có usuario nos teus proxectos de Scratch ao mellor podes probar algún dos seguintes bloques:
it: Ora che hai iniziato a interagire con l'utente che esegue il tuo progetto Scratch, puoi provare alcuni dei seguenti blocchi:
pt: Agora, que você começou a interagir com o usuário que usa seu projeto Scratch, talvez você possa testar algum dos seguintes blocos:
tr: Artık Scratch projenizi çalıştıran kullanıcı ile etkileşime geçtiğinize göre, belki de aşağıdaki bloklardan bazılarını deneyebilirsiniz:

source: when [right arrow v] key pressed
ca: quan la tecla [fletxa dreta v] es premi
es: al presionar tecla [flecha derecha v]
gl: ao premer a tecla [frecha dereita v]
it: quando si preme il tasto [freccia destra v]
pt: Quando alguém pressionar a tecla [seta para a direita v]

source: say [Hello] for (2) secs
ca: digues [Hola] durant (2) segons
es: decir [Hola] durante (2) segundos
gl: dicir [Ola] durante (2) segundos
it: dire [Ciao] per (2) secondi
pt: diz [Olá] durante (2) s

source: ask [What's your name?] and wait
ca: pregunta [Com et dius?] i espera
es: preguntar [¿Cuál es tu nombre?] y esperar
gl: preguntar [Cal é seu nome?] e agardar
it: chiedi [Come ti chiami?] e attendi
pt: pergunta [Qual o seu nome?] e espera pela resposta

source: say (join [Hello] [answer])
ca: digues (uneix [Hola] i [resposta])
es: decir (unir [Hola] [respuesta])
gl: dicir (concatenar [Hola] [respuesta])
it: dire (unione di [Ciao] e [risposta])
pt: diz (a junção de [Olá] com [resposta])

source: if &lt;touching [mouse-pointer v] &gt; then
ca: si &lt; tocant [punter del ratolí v]? &gt; llavors
es: si &lt; ¿tocando [puntero del raton v]? &gt; entonces
gl: se &lt;toca [punteiro do rato v] &gt; entón
it: se &lt;sta toccando [puntatore del mouse v] &gt; allora
pt: se &lt; estás a tocar em [o ponteiro do rato v] &gt; , então

source: say [You caught me!]
ca: digues [M'has atrapat!]
es: decir [¡Me has pillado!]
gl: dicir [Vostede me collido!]
it: dire [Mi hai catturato!]
pt: diz [Você me pegou!]

source: mouse down?
ca: ratolí clicat?
es: ¿ratón presionado?
gl: o rato está premido
it: pulsante del mouse premuto?
pt: o botão do rato está pressionado

source: go to [mouse-pointer v]
ca: vés a [punter del ratolí v]
es: ir a [puntero del ratón v]
gl: ir a [punteiro do rato v]
it: raggiungi [puntatore del mouse v]
pt: vai para [o ponteiro do rato v]

source: As you see, you can allow users to interact with your characters by pressing keys to move, writing answers to questions and your characters use user responses, move characters with the mouse, or perform actions when the user clicks an object.
ca: Com veus, és possible permetre als usuaris interactuar amb els teus personatges prement tecles per a que es moguin, escrivint respostes a preguntes i que els teus personatges utilitzin les respostes de l'usuari, moure els personatges amb el ratolí, o realitzar accions quan l'usuari faci clic sobre un objecte.
es: Como ves, es posible permitir a los usuarios interactuar con tus personajes presionando teclas para que se muevan, escribiendo respuestas a preguntas y que tus personajes usen las respuestas del usuario, mover a los personajes con el ratón, o realizar acciones cuando el usuario pincha sobre un objeto.
gl: Como podes ver, podes permitir que os usuarios interactúen cos teus personaxes a través da pulsación de teclas para movelos, contestando preguntas de xeito que os teus personaxes usen as respostas dos usuarios, movendo personaxes co rato, ou desenvolvendo accións cando o usuario preme nun obxecto.
it: Come vedi, è possibile consentire agli utenti di interagire con i tuoi personaggi premendo i tasti per spostarsi, scrivere risposte alle domande e far utilizzare le risposte dell'utente ai tuoi personaggi, spostare i personaggi con il mouse o fargli eseguire azioni quando l'utente fa clic su uno sprite.
pt: Como você vê, você pode permitir que os usuários interajam com seus personagens pressionando as teclas de movimento, escrevendo respostas para perguntas, movendo personagens com o mouse ou fazendo ações quando o usuário clica um objeto.
tr: Gördüğünüz gibi, kullanıcıların karakterlerinizle etkileşime geçmesine izin verebilirsiniz: tuşlara basarak hareket etmelerini sağlamak, sorulara yanıt yazarak karakterlerinizin kullanıcı yanıtlarını kullanmasını sağlamak, fareyle karakterleri hareket ettirmek veya kullanıcı bir nesneye tıkladığında eylemler gerçekleştirmek gibi.

source: One of the funniest Scratch possibilities in terms of user interactivity is the possibility that <b>the user can use your webcam or microphone to interact with characters from Scratch or sound to trigger certain actions.</b>
ca: Una de les possibilitats més divertides de Scratch pel que fa a la interactivitat amb l'usuari és la possibilitat que <b>l'usuari pugui utilitzar la càmera web o el micròfon per interactuar amb els personatges de Scratch o el so per provocar determinades accions.</b>
es: Una de las posibilidades más divertidas de Scratch en cuanto a la interactividad con el usuario es la posibilidad de que <b>el usuario pueda utilizar su webcam o el micrófono para interactuar con los personajes de Scratch o el sonido para provocar ciertas acciones.</b>
gl: Unha das posibilidades máis divertidas de Scratch en termos de interactividade é a posibilidade de que <b>o usuario poda utilizar a súa cámara web ou micrófono para interactuar cos personaxes desde Scratch ou utilizar sonidos como iniciadores de algunhas accións.</b>
it: Una delle possibilità più divertenti di Scratch in termini di interattività dell'utente è la possibilità che <b>l'utente possa utilizzare la webcam o il microfono per interagire con i personaggi di Scratch o attivare del suono con determinate azioni.</b>
pt: Uma das coisas mais divertidas no Scratch, em termos de interação com o usuário é a possibilidade de <b>usar a webcam ou o microfone para interagir com personagens do Scratch ou usar som para ativar algumas ações.</b>
tr: Scratch'in kullanıcı etkileşimi açısından en eğlenceli olanaklarından biri, <b>kullanıcının webcam'ini veya mikrofonunu kullanarak Scratch karakterleriyle etkileşime geçebilmesi veya ses kullanarak belirli eylemleri tetikleyebilmesidir.</b>

source: if &lt;(loudness) >[30]&gt; then
ca: si &lt;(volum del so) >[30]&gt; llavors
es: si &lt;(volumen del sonido) >[30]&gt; entonces
gl: se &lt;(volume no micrófono) >[30]&gt; entón
it: se &lt;(volume microfono) >[30]&gt; allora
pt: se &lt;(o volume) >[30]&gt; , então

source: say [There is much noise...]
ca: digues [Hi ha molt soroll ...]
es: decir [Hay mucho ruido...]
gl: dicir [Hai unha morea de ruído]
it: dire [C'è molto rumore ...]
pt: diz [Há muito barulho...]

source: video [motion v] on [sprite v]
ca: vídeo [motion v] a [sprite v]
es: [movimiento v] de vídeo en [objeto v]
gl: [movemento v] de vídeo a [figura v]
it: [movimento v] del video su [sprite v]
pt: ([o movimento v] do vídeo em [ti mesmo v])

source: video [direction v] on [sprite v]
es: [dirección v] de vídeo en [objeto v]
gl: [dirección v] de vídeo a [figura v]
it: [direzione v] del video su [sprite v]
pt: ([a direção v] do vídeo em [ti mesmo v])

source: As you can see in the examples, we can make certain sets of blocks are executed when the ambient sound captured by the microphone is greater than a certain threshold, or when video motion occurs over an object or background. The possibilities of these blocks are very large and allows your creations Scratch are fully interactive with users.
ca: Com veus als exemples, podem fer que certs conjunts de blocs s'executin quan el so ambient capturat pel micròfon sigui major que un determinat llindar, o quan es produeix moviment del vídeo sobre un objecte o el fons. Les possibilitats d'aquests blocs són molt grans i permetran que les teves creacions Scratch siguin totalment interactives amb els usuaris.
es: Como ves en los ejemplos, podemos hacer que ciertos conjuntos de bloques se ejecuten cuando el sonido ambiente capturado por el micrófono sea mayor que un determinado umbral, o cuando se produce movimiento del vídeo encima de un objeto o del fondo. Las posibilidades de estos bloques son muy grandes y permitirán que tus creaciones Scratch sean totalmente interactivas con los usuarios.
gl: Como podes ver nos exemplos, podemos facer que certos conxuntos de bloques se executen cando o sonido ambiente recollido polo micrófono sexa máis forte que certo limiar, ou cando o movemento do vídeo aconteza sobre un obxecto ou o fondo. As posibilidades destes bloques son moi grandes e permiten que as túas creacións con Scratch sexan totalmente interactivas cos usuarios.
it: Come si può vedere negli esempi, possiamo fare in modo che determinati insiemi di blocchi vengano eseguiti quando il suono ambientale catturato dal microfono è maggiore di una determinata soglia o quando la webcam percepisce del movimento su un oggetto o sullo sfondo. Le possibilità di questi blocchi sono molteplici e consentono che le vostre creazioni Scratch siano pienamente interattive con gli utenti.
pt: Como você pode conferir nos exemplos, podemos fazer com que alguns blocos sejam executados quando o som capturado pelo micirofone for maior que um certo limiar, ou quando ocorre algum movimento de algum objeto ou do fundo no vídeo. As possibilidades desses blocos são muito grandes e permitem que suas criações com Scratch sejam completamente interativas com os usuários.
tr: Görüldüğü gibi, mikrofon tarafından yakalanan çevresel ses belirli bir eşiği aştığında veya bir nesne ya da arka plandaki video hareketi gerçekleştiğinde belirli blok setlerinin çalışmasını sağlayabiliriz. Bu blokların olanakları oldukça geniştir ve Scratch projelerinizin kullanıcılarla tamamen etkileşimli olmasına olanak tanır.

source: Attribute Initialization
ca: Atributs no inicialitzats correctament
es: Atributos no inicializados correctamente
gl: Inicialización de atributos incorrecta
it: Inizializzazione degli Attributi
pt: Inicialização de atributos
tr: Öznitelik Başlatma

source: One of the mistakes that many programmers repeat when they learn to program is not initialize correctly the objects's attributes. What are the attributes? They are character's features that can be modified in the execution of a project, like their position, their size, their color, their orientation...
ca: Un dels errors que més cometem tots els programadors a l'hora d'aprendre a programar és no inicialitzar correctament tots els atributs dels objectes. Què són els atributs? Són característiques d'un personatge que poden ser modificades en l'execució d'un projecte, com ara la seva posició, el seu tamany, el seu color, la seva orientació...
es: Uno de los errores que más repetimos todos los programadores al aprender a programar es no inicalizar correctamente los atributos de los objetos. ¿Qué son los atributos? Son características de un personaje que pueden ser modificadas en la ejecución de un proyecto, como su posición, su tamaño, su color, su orientación...
gl: Un dos erros máis comúns que cometemos todos os programadores á hora de aprender a programar é non inicializar correctamente todos os atributos dos obxectos. Que son os atributos? Son características dun personaxe que poden ser modificadas na execución dun proxecto, como a súa posición, o seu tamaño, a súa cor, a súa orientación...
it: Uno degli errori che molti programmatori ripetono quando iniziano a programmare è quello di non inizializzare correttamente gli attributi degli oggetti. Quali sono gli attributi? Sono le caratteristiche del personaggio che possono essere modificate nell'esecuzione di un progetto, come la loro posizione, la loro dimensione, il loro colore, il loro orientamento ...
pt: Um dos erros que muitos programadores cometem quando estão aprendendo a programar é não iniciar corretamente os atributos dos objetos. O que são atributos? São características dos personagens que podem ser modificadas durante a execução de um projeto, como posição, tamanhão, cor, orientação...
tr: Birçok programcının programlamayı öğrenirken tekrar ettiği hatalardan biri, nesnelerin özniteliklerini doğru bir şekilde başlatmamaktır. Öznitelikler nedir? Bunlar, bir projenin çalıştırılması sırasında değiştirilebilen karakterlerin özellikleridir; örneğin, konumları, boyutları, renkleri, yönelimleri...
