Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Instructions related to algorithmic notions of flow control can help you to <b>control the behavior of your characters</b>, making, for example, certain blocks that are repeated a number of times, or until a situation arises.
ca: Les instruccions relaciones amb les nocions algorísmiques de control de flux poden ajudar-te a <b>controlar el comportament dels teus personatges</b>, fent per exemple que repeteixin determinats blocs un nombre de vegades concret o que el repeteixin fins que es produeixi una situació.
es: Las instrucciones relacionadas con las nociones algorítmicas de control de flujo pueden ayudarte a <b>controlar el comportamiento de tus personajes</b>, haciendo, por ejemplo, que repitan ciertos bloques un número de veces concreto o que lo repitan hasta que se produzca una situación.
gl: As instruccións relacionadas con nocións algorítmicas de control de fluxo poden axudar a <b>controlar o comportamento dos teus personaxes</b>, facendo, por exemplo, repetir certos bloques un número de veces, ou ata que aconteza unha situación.
it: Le istruzioni relative alle nozioni algoritmiche del controllo di flusso possono aiutarti a <b>controllare il comportamento dei tuoi personaggi</b>, ad esempio, alcuni blocchi possono essere ripetuti più volte o fino a quando non si verifica una certa situazione.
pt: Instruções relacionadas a noções de controle de fluxo podem ajudá-lo a <b>controlar o comportamento de seus personagens</b>, fazendo, por exemplo, alguns blocos que são repetidos um número de vezes ou até que uma situação ocorra.
tr: Algoritmik akış kontrolü ile ilgili talimatlar, <b>karakterlerinizin davranışını kontrol etmenize</b> yardımcı olabilir; örneğin, belirli blokların bir sayı kadar tekrar edilmesini veya bir durum ortaya çıkana kadar devam etmesini sağlar.

source: The most basic way to control the behavior of your characters is creating a <b>program composed of a set of blocks are executed one after another</b>, as we see in the picture:
ca: La forma més bàsica de controlar el comportament dels teus personatges és creant un <b>programa compost per un conjunt de blocs que s'executen un darrere l'altre</b>, tal com veiem en la imatge:
es: La forma más básica de controlar el comportamiento de tus personajes es creando un <b>programa computesto por un conjunto de bloques que se ejecutan uno detrás de otro</b>, tal como vemos en la imagen:
gl: O xeito máis básico de controlar o comportamento dos teus personaxes é crear un programa composto dun conxunto de bloques que se executan un despois do outro, como se poder ver na imaxe:
it: Il modo più semplice per controllare il comportamento dei tuoi personaggi è quello di creare un programma <b>composto da un insieme di blocchi che vengono eseguiti uno dopo l'altro</b>, come si vede nell'immagine:
pt: A forma mais simples de controlar o comportamento de seus personagens é criando um <b>programa composto por um conjunto de blocos que são executados um após o outro</b>, como vemos na figura:
tr: Karakterlerinizin davranışını kontrol etmenin en temel yolu, <b>birbiri ardına yürütülen bir dizi bloktan oluşan bir program oluşturmak</b>tır, bunu resimde görüyoruz:

source: say [I'm a dancer cat] for (2) secs
ca: digues [Sóc un gat ballarí] durant (2) segons
es: decir [Soy un gato bailarin] durante (2) segundos
gl: dicir [Eu son un bailarín gato] durante (2) segundos
it: dire [Sono un gatto ballerino] per (2) secondi
pt: diz [Eu sou um gato dançarino] durante (2) s

source: wait (0.5) secs
ca: espera (0.5) segons
es: esperar (0.5) segundos
gl: agardar (0.5) segundos
it: attendi (0.5) secondi
pt: espera (0.5) s

source: move (-10) steps
ca: mou-te (-10) passos
es: mover (-10) pasos
gl: mover (-10) pasos
it: fai (-10) passi
pt: anda (-10) passos

source: How does this program works? When the user click on the green flag run behind one another all blocks that have been included in the program. Start with the first block <i>'say I'm a cat dancing for 2 seconds'</i>, then run <i>'move 10 steps'</i> then <i>'turn 15 degrees right'</i>, and so on to the last block of the program.
ca: Com funciona aquest programa? Quan l'usuari prem la bandera verda s'executaran un rere l'altre tots els blocs que hem inclòs en el programa. Començarà pel primer <i>"digues sóc un gat ballarí durant 2 segons"</i>"mou-te 10 passos"</i>, a continuació <i>"gira 15 graus cap a la dreta"</i>, i així fins arribar al darrer bloc del programa.
es: ¿Cómo funciona este programa? Cuando el usuario presione sobre la bandera verde se ejecutarán uno detras de otro todos los bloques que se han incluido en el programa. Comenzará por el primero <i>“decir soy un gato que baila por 2 segundos”</i>, luego ejecutará <i>“mover 10 pasos”</i>, a continuación <i>“girar 15 grados a la derecha”</i>, y así hasta llegar al último bloque del programa.
gl: Como funciona este programa? Cando o usuario preme na bandeira verde todos os bloques incluidos no programa se executan un tras o outro. Empeza co bloque <i>'dicir son un gato que baila durante 2 segundos'</i>, entón executa <i>'mover 10 pasos'</i> entón <i>'xirar 15 grados á dereita'</i> e así sucesivamente ata o derradeiro bloque do programa.
it: Come funziona questo programma? Quando l'utente fa clic sulla bandierina verde vengono eseguiti uno dietro l'altro tutti i blocchi che sono messi nello script. Si inizia con il primo blocco <i>'dire sono un gatto che balla per 2 secondi'</i>, quindi <i>'muovi 10 passi</i> poi <i>' ruota 15 gradi a destra'</i> e così via all'ultimo blocco del programma.
pt: Como esse programa funciona? Quando o usuário clica na bandeira verde todos os blocos incluídos no programa são executados um após o outro. Começa com o primeiro bloco 'diga Eu sou um gato dançando por 2 segundos', então executa 'move 10 passos', depois 'cire 15 graus à direita', e assim até o último bloco do programa.
tr: Bu program nasıl çalışır? Kullanıcı yeşil bayrağa tıkladığında, programa dahil edilen tüm bloklar sırasıyla çalıştırılır. İlk olarak <i>'2 saniye boyunca ben bir kedi dans ediyorum'</i> bloğu ile başlar, ardından <i>'10 adım ilerle'</i> bloğunu çalıştırır, sonra <i>'15 derece sağa dön'</i> bloğunu uygular ve programın son bloğuna kadar devam eder.

source: Sometimes when we want a set of blocks is constantly repeated, instead of repeating the same blocks over and over again, you can use a repeat instruction allowing achieve the same effect, but more comfortable and manageable way. Consider a couple of examples:
ca: De vegades, quan volem que un conjunt de blocs es repeteixi constantment, enlloc de repetir els mateixos blocs una i altra vegada, és possible fer ús d'instruccions de repetició que permetin aconseguir el mateix efecte, però d'una manera més còmode i manejable. Vegem un parell d'exemples:
es: En ocasiones, cuando queremos que un conjunto de bloques se repita constantemente, en lugar de repetir los mismos bloques una y otra vez, es posible utilizar instrucciones de repetición que permiten conseguir el mismo efecto, pero de forma más cómoda y manejable. Veamos un par de ejemplos:
gl: Ás veces, cando queremos que un conxunto de bloques se repita constantemente, no canto de repetir os mesmos bloques unha e outra vez, podemos usar unha instrucción de repetición que consegue o mesmo efecto, pero de un xeito máis cómodo e controlable. Vexamos un par de exemplos:
it: A volte, quando vogliamo che una serie di blocchi sia ripetuta più volte, invece di ripetere gli stessi blocchi, puoi utilizzare un'istruzione ripeti che consente di ottenere lo stesso effetto, ma è un modo più comodo e gestibile. Consideriamo un paio di esempi:
pt: Às vezes, qunado queremos que um conjunto de blocos seja constantemente repetido, em vez de repetir os mesmos blocos várias vezes, você pode usar uma instrução de repetição que chega no mesmo resultado, mas de uma forma mais fácil. Considere alguns exemplos:
tr: Bazen bir dizi bloğun sürekli olarak tekrar edilmesini istediğimizde, aynı blokları tekrar tekrar yazmak yerine, aynı etkisi sağlayan ancak daha konforlu ve yönetilebilir bir şekilde yapılmasına olanak tanıyan bir tekrar talimatı kullanabilirsiniz. İşte iki örnek:

source: if on edge, bounce
ca: rebota en tocar una vora
es: si toca un borde, rebotar
gl: se toca un bordo, rebotar
it: rimbalza quando tocchi il bordo
pt: se estiveres a bater na borda, ressalta

source: How these control blocks works?
ca: Com funcionen aquests blocs de control?
es: ¿Cómo funciona estos bloques de control?
gl: Como funcionan estes bloques de control?
it: Come lavora questo blocco?
pt: Como esses blocos de controle funcionam?
tr: Bu kontrol blokları nasıl çalışır?

source: In the block <i>'repeat'</i> when execution reaches this point is repeated as often as has been indicated in the parameter block 'repeat', in the example would be 3 times, all blocks included within this block. We can see that the block 'repeat' has an arrow at the bottom indicating that <b>when they finish executing the blocks back again up</b>.
ca: En el bloc <i>"repeteix"</i>, quan l'execució arriba a aquest punt es repetiran tantes vegades com haguem indicat en el paràmetre del bloc 'repeteix'; en l'exemple serien tres vegades, tots els blocs inclosos dins d'aquest bloc. Podem veure que el bloc 'repeteix' té una fletxeta a la part inferior que indica que <b>quan s'acaben d'executar els blocs, aquests es tornen a repetir de nou</b>
es: En el bloque <i>“repetir”</i>, cuando la ejecución llega a este punto se repetirán tantas veces como se haya indicado en el parámetro del bloque 'repetir', en el ejemplo serían 3 veces, todos los bloques incluidos dentro de este bloque. Podemos ver que el bloque 'repetir' tiene una flechita en la parte inferior que indica que <b>cuando se terminan de ejecutar los bloques se vuelve otra vez para arriba</b>.
gl: No bloque <i>'repetir'</i>, cando a execución chega a este punto, todos os bloques incluidos neste bloque se repiten tanta veces coma estea especificado no parámetro do bloque 'repetir', no caso do exemplo serán 3 veces. Podemos ver que o bloque 'repetir' ten unha frechiña na parte inferior que, <b>cando remata a execución dos bloques, vólvese outra vez cara arriba</b>.
it: Nel blocco <i>'ripeti'</i> quando l'esecuzione raggiunge questo punto viene ripetuta tante volte quante sono state indicate nel parametro dell'istruzione "ripeti", nell'esempio sarebbe ripeti 3 volte tutti i blocchi racchiusi da questo blocco. Possiamo vedere che il blocco "ripeti" ha una freccia in basso che indica che <b>quando l'esecuzione dei blocchi è terminata torna su ed esegui di nuovo</b>.
pt: No bloco <i>'repete'</i>, quando a execução atinge esse ponto, é repetida tantas vezes quantas indicadas no parâmetros do bloco 'repete'. No exemplo, seriam 3 vezes, todos os blocos inclusos dentro do bloco. Nós podemos ver que o bloco 'repete' tem uma flecha no final, indicando que <b>quando eles terminam a execução, os blocos voltam para cima</b>.
tr: <i>'repeat'</i> bloğunda, yürütme bu noktaya geldiğinde, 'repeat' bloğundaki parametrede belirtilen sayı kadar, örnekte olduğu gibi 3 kez, bu bloğun içine dahil olan tüm bloklar tekrar edilir. <b>Yürütme tamamlandığında, blokların tekrar yukarıya döneceğini</b> belirten aşağıda bir ok bulunan 'repeat' bloğunu görebiliriz.

source: The block <i>'forever'</i> works like the 'repeat' but never finish executing the blocks containing in its interior.
ca: El bloc <i>"per sempre"</i> funciona de la mateixa manera que el 'repeteix' però no deixa mai d'executar els blocs que conté en el seu interior.
es: El bloque <i>“por siempre”</i> funciona igual que el 'repetir' pero sin terminar nunca de ejecutar los bloques que contiene en su interior.
gl: O bloque <i>'para sempre'</i> funciona coma o 'repetir' pero nunca remata a execución dos bloques contidos nel.
it: Il blocco <i>'per sempre'</i> funziona come il 'ripeti' ma non finisce mai di eseguire i blocchi contenuti al suo interno.
pt: O bloco <i>'para sempre'</i> funciona como o 'repete', mas nunca termina de executar os blocos em seu interior.
tr: <i>'forever'</i> bloğu, 'repeat' bloğu gibi çalışır ancak içindeki blokları hiç bitirmeden sürekli olarak yürütür.

source: Sometimes we don't know previously the number of times you want a set of blocks is executed, as this depends on a given situation. In these cases, the block 'repeat until ...' is really useful. Here's an example:
ca: De vegades no sabem prèviament el nombre de vegades que volem que un conjunt de blocs s'executi, ja que això depèn d'una determinada situació. En aquestes ocasions, el bloc 'repetir fins que...' és realment útil. Vegem un exemple:
es: En algunas ocasiones no sabemos previamente el número de veces que queremos que un conjunto de bloques se ejecute, ya que esto depende de una determinada situación. En estas ocasiones, el bloque 'repetir hasta que...' es realmente útil. Veamos un ejemplo:
gl: Ás veces non sabemos exactamente o número de veces que queremos executar un conxunto de bloques, dado que depende da situación. Nestes casos, o bloque 'repetir ata...' é realmente útil. Velaquí un exemplo:
it: A volte non sappiamo prima quante volte vogliamo ripetere un insieme di blocchi, in quanto ciò dipende da una determinata situazione. In questi casi, è veramente utile il blocco "ripeti fino a quando ...". Ecco un esempio:
pt: Às vezes, não sabemos previamente o número de vezes que você quer repetir um boco, pois isso depende de outras condições. Nesses casos, o bloco 'repete até...' é realmente muito útil. Aqui vai um exemplo:
tr: Bazen bir dizi bloğun kaç kez çalıştırılacağını önceden bilemeyiz çünkü bu, belirli bir duruma bağlıdır. Bu tür durumlarda, 'repeat until ...' bloğu gerçekten kullanışlıdır. İşte bir örnek:

source: repeat until &lt; touching [Enemy v] ?&gt;
ca: repeteix fins &lt; tocant [Enemic v]? &gt;
es: repetir hasta que &lt; ¿tocando [Enemigo v]? &gt;
gl: repetir até &lt; toca [Inimigo v] ?&gt;
it: ripeti fino a quando &lt; sta toccando [Nemico v] ?&gt;
pt: até que &lt; estás a tocar em [Inimigo v] ?&gt; , repete

source: say [You don't catch me]
ca: digues [No m'atrapes...]
es: decir [No me pillas]
gl: dicir [Non me atrapas]
it: dire [Non mi hai preso]
pt: diz [Você não me pega]

source: say [You catch me]
ca: digues [M'has atrapat!]
es: decir [Me has pillado]
gl: dicir [Ti me atrapas]
it: dire [Mi hai preso]
pt: diz [Você me pegou]

source: In the example, the character will constantly repeat the instruction say 'You don't caught me...' while he don't touch the enemy. At the time that the condition is met instruction <i>'repeat until ...'</i>, the contents inside will finish run and will jump to the next instruction, in this case say 'You caught me!'.
ca: A l'exemple, el personatge repetirà constantment la instrucció "digues 'No m'atrapes...'" mentre no estigui tocant l'enemic. En el moment en què es compleixi la condició de la instrucció <i>'repeteix fins que...'</i>, deixarà d'executar-se el bloc contingut en el seu interior i saltarà a la següent instrucció, en aquest cas "digues 'M'has atrapat!'".
es: En el ejemplo, el personaje repetirá constantemente la instrucción decir 'No me pillas...' mientras no esté tocando al enemigo. En el momento que se cumpla la condición de la instrucción <i>'repetir hasta que...'</i>, terminará de ejecutarse el bloque contenido en su interior y saltará a la siguiente instrucción, en este caso decir' Me pillaste!'.
gl: No exemplo, o personaxe repetirá constantemente a instrucción 'dicir Non me colles...' mentres que non toque o inimigo. No momento en que a condición se cumpre o contido dentro da instrucción <i>'repetir ata...'</i> rematará de executarse e saltará á seguinte instrucción, neste caso 'dicir Colléchesme!'
it: Nell'esempio, il personaggio ripeterà costantemente l'istruzione dire 'Non mi hai preso...' mentre non tocca il nemico. Al momento in cui la condizione viene rispettata, istruzione <i>'ripetere fino a quando...'</i>, le istruzioni all'interno verranno terminate e salterà all'istruzione successiva, in questo caso dire 'Mi hai preso!'.
pt: No exemplo, o personagem irá repetir constantemente a instrução 'fala Você não me pegou...' enquanto ele não toca o inimigo. Quando a condição é satisfeita, a instrução <i>'repita enquanto ...'</i>, os conteúdos no seu interior serão executados e passará para a próxima instrução, neste caso, 'diga Você me pegou!'.
tr: Örnekte, karakter 'You don't caught me...' talimatını sürekli olarak tekrar edecek, düşmana dokunmadığı sürece. Koşul sağlandığında, <i>'repeat until ...'</i> bloğundaki içerik çalışmayı bitirecek ve bir sonraki talimata, bu durumda 'You caught me!' demeye geçecektir.

source: Instructions related to logical thinking can help your projects are dynamic, <b>so that they behave differently depending on the situation</b>. In the stories, for example, these instructions are not as important as they usually have a linear structure we always want to run the same way, but in other projects, such as video games are essential to perform different actions depending on the situation.
ca: Les instruccions relacionades amb el pensament lògic poden ajudar-te a fer que els teus projectes siguin dinàmics <b>per tal que es comportin de forma diferent en funció de la situació</b>. En les històries, per exemple, aquest tipus d'instruccions no són tan importants, ja que acostumen a tenir una estructura linial que sempre volem que s'executi de la mateixa manera; ara bé, en altres tipus de projectes, com ara els videojocs, són fonamentals per executar accions diferents depenent de la situació.
es: Las instrucciones relacionadas con el pensamiento lógico pueden ayudarte a que tus proyectos sean dinámicos,<b> de forma que se comporten de modo distinto en función de la situación</b>. En las historias, por ejemplo, este tipo de instrucciones no son tan importantes, ya que suelen tener una estrucutura lineal que siempre queremos que se ejecute del mismo modo, pero en otro tipo de proyectos, como los videojuegos, son fundamentales para ejecutar acciones diferentes dependiendo de la situación.
gl: As instrucción relacionadas co pensamento lóxico poden axudar a que os teus proxectos sexan dinámicos, de xeito que se comporten de forma diferente dependendo da situación. Estas instruccións non son tan importantes, por exemplo, nas historias porque estas normalmente teñen unha estrutura linear que queremos que se execute sempre do mesmo xeito, pero noutros proxectos, coma en videoxogos son esenciais para desenvolver diferentes accións dependendo da situación.
it: Le istruzioni relative al pensiero logico possono aiutarti a rendere dinamici i tuoi progetti, <b>così che si comportino in modo diverso a seconda della situazione</b>. Nelle storie, ad esempio, queste istruzioni non sono altrettanto importanti in quanto, le storie, hanno solitamente una struttura lineare che vogliamo venga eseguita sempre nello stesso modo, ma in altri progetti, come i videogiochi, sono essenziali per eseguire diverse azioni a seconda della situazione.
pt: Instruções sobre pensamento lógico podem ajudar seus projetos a se tornar dinâmicos, <b>de modo a se comportarem de forma diferente dependendo da situação</b>. Essas instruções não são tão importantes em histórias, porque essas últimas geralmente tem uma estrutura linear; e aí, queremos que rodem sempre do mesmo jeito. Mas em outros projetos, como videogames, as instruções de lógica são essenciais para criar ações diferenets dependendo das situações.
tr: Mantıksal düşünmeyle ilgili talimatlar projelerinizin dinamik olmasına yardımcı olabilir, <b>bu sayede durumlara bağlı olarak farklı şekilde davranabilirler</b>. Örneğin hikayelerde, genellikle lineer bir yapı olduğundan ve her zaman aynı şekilde çalışmasını istediğimizden bu talimatlar o kadar önemli değildir. Ancak video oyunları gibi diğer projelerde, duruma bağlı olarak farklı eylemler gerçekleştirmek için gereklidirler.

source: The most basic block you can start working logical thinking is this:
ca: El bloc més bàsic amb el que pots començar a treballar el pensament lògic és aquest:
es: El bloque más básico con el que puedes comenzar a trabajar el pensamiento lógico es éste:
gl: O bloque máis básico co que podes comezar a traballar o pensamento lóxico é este:
it: Il blocco più semplice con cui puoi iniziare a lavorare con il pensiero logico è questo:
pt: O bloco mais simples de pensamento lógico que você pode começar a usar é esse:
tr: Mantıksal düşünmeye başlamak için kullanabileceğiniz en temel blok şudur:

source: if &lt; touching color [#0000FF]? &gt;then
ca: si &lt; tocant el color [#0000FF]? &gt;llavors
es: si &lt;¿tocando el color [#0000FF] ?&gt; entonces
gl: se &lt; toca na cor [#0000FF]? &gt;entón
it: se &lt; sta toccando il colore [#0000FF]? &gt;allora
pt: se &lt; estás a tocar na cor [#0000FF] &gt; , então

source: say [I have reached the goal!] for (2) secs
ca: digues [He arribat a la meta!] durant (2) segons
es: decir [He alcanzado la meta!] durante (2) segundos
gl: dicir [Eu alcance a meta] durante (2) segundos
it: dire [Ho raggiunto l'obiettivo!] per (2) secondi
pt: diz [Eu alcancei a meta!] durante (2) s

source: How this block works? When execution reaches this point, the condition on the block is evaluated, and if this is true, the set of blocks that are within the if executed.
ca: Com funciona aquest bloc? Quan l'execució arriba a aquest punt, s'avalua la condició que apareix en el bloc i, si aquesta és certa, s'executa el conjunt de blocs que estan dins d'aquesta.
es: ¿Cómo funciona este bloque? Cuando la ejecución llega a este punto, se evalúa la condición que aparece en el bloque, y si ésta es verdadera, se ejecuta el conjunto de bloques que están dentro del si.
gl: Como funciona este bloque? Cando a execución chega a este punto, a condición do bloque se evalúa, e se é verdade, o conxunto de bloques que contén se executa.
it: Come funziona questo blocco? Quando l'esecuzione raggiunge questo punto, la condizione sul blocco viene valutata e, se la condizione è vera, l'insieme di blocchi che si trovano al suo interno viene eseguito.
pt: Como esse bloco funciona? Quando a execução atinge esse ponto, acondição do bloco é avaliada. Se for verdadeira, o conjunto de blocos do interior são executados.
tr: Bu blok nasıl çalışır? Yürütme bu noktaya geldiğinde, bloktaki koşul değerlendirilir ve eğer bu koşul doğruysa, 'if' bloğunun içindeki bloklar çalıştırılır.

source: In the example, if the character is touching the blue color, he says 'I reached the goal.'
ca: En l'exemple, si el personatge està tocant el color blau diria "He arribat a la meta!".
es: En el ejemplo, si el personaje está tocando el color azul diría “Llegué a la meta”.
gl: No exemplo, se o personaxe toca a cor azul, di 'Acadei o obxectivo.'
it: Nell'esempio, se il personaggio sta toccando il colore blu, dice 'Ho raggiunto l'obiettivo.'
pt: No exemplo, se o personagem estiver tocando a cor azul, ele fala 'Eu atingi o objetivo.'
tr: Örnekte, eğer karakter mavi renge dokunuyorsa, 'I reached the goal.' der.
