Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Scores of 2019
ca: Puntuacions de 2019
es: Puntuación de 2019
gl: Puntuación de 2019
it: Punteggi del 2019
pt: Pontuações de 2019
tr: 2019 puanları

source: points
ca: punts
es: puntos
gl: puntos
it: punti
pt: pontos
tr: puan

source: Total score
ca: Puntuació total
es: Puntuación total
gl: Puntuación
it: Punteggio totale
pt: Pontuação total:
tr: Toplam puan

source: Number of projects analyzed in 2019
ca: Nombre de projectes analitzats el 2019
es: Número de proyectos analizados en 2019
it: Numero di progetti analizzati nel 2019
pt: Número de projetos analisados em 2019
tr: 2019'da analiz edilen proje sayısı

source: projects
ca: projectes
es: proyectos
gl: proxectos
it: progetti
pt: projetos
tr: projeler

source: Total projects
ca: Projectes totals
es: Projectos totales
it: Progetti totali
pt: Total de projetos
tr: Toplam proje

source: Percent levels
ca: Porcentatge de nivells
es: Porcentaje de niveles
it: Percentuale dei livelli
pt: Nível percentual
tr: Yüzde seviyeleri

source: Level
ca: Nivell
es: Nivel
it: Livello
pt: Nível
tr: Seviye

source: Average rate by code smell
ca: Puntuació mitja per mal hàbit de programació
es: Puntuación media por mal hábito de programación
it: Tasso medio di "code smell" (codice debole)
pt: Taxa média por código
tr: Kod kokusu başına ortalama oran

source: Code smell
ca: Mals hàbits
es: Malos hábitos
it: Code smell - codice debole
pt: Código
tr: Kod kokusu

source: Dead code
ca: Codi mort
es: Código Muerto
gl: Código morto
it: Codice inutilizzato
pt: Código morto
tr: Ölü kod

source: Duplicated scripts
ca: Programes duplicats
es: Programas duplicados
gl: Programas duplicados
it: Script duplicati
pt: Scripts duplicados
tr: Yinelenen betikler

source: Attribute initialization
ca: Atributs no inicialitzats correctament
es: Atributos no inicializados correctamente
gl: Inicialización de atributos incorrecta
it: Inizializzazione degli attributi
pt: Inicialização de atributos
tr: Özellik başlatma

source: Sprite naming
ca: Noms poc encertats
es: Nombres de objetos
gl: Nomes non axeitados
it: Denominazione degli sprite
pt: Nomeação de personagens
tr: Sprite adlandırma

source: Average rate by programming skill
ca: Puntuació mitja per habilitat de programació
es: Puntuación media por habilidad de programación.
it: Tasso medio dell'abilità di programmazione
pt: Taxa média por habilidade de pogramação
tr: Programlama becerisine göre ortalama oran

source: Programming skill
ca: Habilitat de programació
es: Habilidad de programación
it: Abilità di programmazione
pt: Habilidade de programação
tr: Programlama becerisi

source: Parallelism
ca: Paral·lelisme
es: Paralelismo
gl: Paralelismo
it: Parallelismo
pt: Paralelismo
tr: Paralellik

source: Logic
ca: Lògica
es: Lógica
gl: Lóxica
it: Logica
pt: Lógica
tr: Mantık

source: Flow control
ca: Controls de flux
es: Control de flujo
gl: Control de fluxo
it: Controllo di flusso
pt: Controle de fluxo
tr: Akış kontrolü

source: User interactivity
ca: Interactivitat de l'usuari
es: Interactividad del usuario
gl: Interactividade do susario
it: Interattività utente
pt: Interatividade com o usuário
tr: Kullanıcı etkileşimi

source: Data representation
ca: Representació de dades
es: Representación de los datos
gl: Representación dos datos
it: Rappresentazione dei dati
pt: Representação de dados
tr: Temsili veri

source: Abstraction
ca: Abstracció
es: Abstracción
gl: Abstracción
it: Astrazione
pt: Abstração
tr: Soyutlama

source: Synchronization
ca: Sincronització
es: Sincronización
gl: Sincronización
it: Sincronizzazione
pt: Sincronização
tr: Senkronizasyon

source: <input type='submit' value='Change language' class='btn-group btn-group-justified colored-text'/>
es: <input type='submit' value='Cambia el idioma' class='btn-group btn-group-justified colored-text'>
it: <input type='submit' value='Cambia lingua' class='btn-group btn-group-justified colored-text'/>
tr: <input type='submit' value='Dili değiştir' class='btn-group btn-group-justified colored-text'/>

source: Logged in as
ca: Connectat com
es: Conectado como
it: Collegato come
pt: Inciiado como
tr: Olarak giriş yapıldı

source: Change password
ca: Canviar contrasenya
es: Cambiar contraseña
it: Cambia password
pt: Alterar senha
tr: Şifreyi değiştir

source: Analysis
ca: Anàlisi
es: Análisis
it: Analisi
pt: Análise
tr: Analiz

source: Stats
ca: Estadístiques
es: Gráficas
it: Statistiche
pt: Estatísitcas
tr: İstatistikler

source: Learn more
ca: Aprèn més
es: Aprende más
gl: Aprende máis
it: Per saperne di più
pt: Aprenda mais
tr: Daha fazla bilgi edin

source: Incorrect names
ca: Noms poc encertats
es: Nombres inadecuados
gl: Nomes incorrectos
it: Nomi non corretti
pt: Nomes incorretos
tr: Yanlış isimler

source: Settings
ca: Ajustos
es: Ajustes
gl: Definicións
it: Impostazioni
pt: Configurações
tr: Ayarlar

source: How is the file .csv?
ca: Com crear el fitxer .csv?
es: ¿Cómo crear el fichero .csv?
it: Cos'è il file .csv?
pt: Como é o arquivo .csv?
tr: Dosya .csv nasıl?

source: You must to write only the number of your students' projects. Easy, isn't it?
ca: Només cal que escriguis els números de projectes dels teus estudiants. Oi que és senzill?
es: Puedes escribir sólo el número de proyecto de tus estudiantes. Fácil, ¿no?
it: Devi solo scrivere il numero dei progetti dei tuoi studenti. Facile, non è vero?
pt: Você deve escrever somente o número de projetos dos estudantes. Fácil, não é?
tr: Sadece öğrencilerinizin projelerinin sayısını yazmalısınız. Kolay, değil mi?

source: What is an url?
ca: Què és una url?
es: ¿Qué es una url?
it: Cos'è un url?
pt: O que é uma url?
tr: URL nedir?

source: How I can know my Scratch project's url?
ca: Com puc esbrinar la url del meu projecte de Scratch?
es: ¿Cómo puedo averiguar la url de mi proyecto en Scratch?
it: Come posso conoscere l'url del mio progetto Scratch?
pt: Como posso saber a url de meu projeto no Scratch
tr: Scratch projemin URL'sini nasıl öğrenebilirim?

source: <img class='framed' src='../static/app/images/url-en.png' />
ca: <img class='framed' src='../static/app/images/url-ca.png' />
es: <img class='framed' src='../static/app/images/url-es.png' />
it: <img class='framed' src='../static/app/images/url-it.png' />
pt: <img class='framed' src='../static/app/images/url-pt.png' />

source: I want to download my project from Scratch!
ca: Vull descarregar el meu projecte de Scratch!
es: ¡Quiero descargar mi proyecto de Scratch!
it: Voglio scaricare il mio progetto da Scratch!
pt: Quero fazer o download de meu projeto no Scratch
tr: Projemi Scratch'ten indirmek istiyorum!

source: How I can download my Scratch project to my computer?
ca: Com puc descarregar el meu projecte de Scratch al meu ordinador?
es: ¿Cómo puedo descargar mi proyecto de Scratch a mi ordenador?
it: Come posso scaricare il mio progetto Scratch sul mio computer?
pt: Como posso fazer o download de meu projeto no Scratch para meu computador?
tr: Scratch projemi bilgisayarıma nasıl indirebilirim?

source: <img class='framed' src='../static/app/images/project-en.png' />
ca: <img class='framed' src='../static/app/images/project-ca.png' />
es: <img class='framed' src='../static/app/images/project-es.png' />
it: <img class='framed' src='../static/app/images/project-it.png' />
pt: <img class='framed' src='../static/app/images/project-pt.png' />

source: Wait a moment, please.
ca: Espereu un moment, si us plau.
es: Espere un momento, por favor.
gl: Agarda un intre, por favor.
it: Attendi un attimo, per favore.
pt: Espere um pouco, por favor
tr: Bir dakika bekleyin, lütfen.

source: loading...
ca: carregant...
es: cargando...
gl: cargando...
it: caricamento in corso...
pt: carregando...
tr: yükleniyor...

source: Score
ca: Puntuació
es: Puntuación
gl: Puntuación
it: Punteggio
pt: Pontuação
tr: Puan

source: This section shows the total score.
ca: Aquesta secció mostra la puntuació total.
es: Esta sección muestra la puntuación total.
it: Questa sezione mostra il punteggio totale.
pt: Essa seção mostra a pontuação total.
tr: Bu bölüm toplam puanı gösterir.

source: Certificate
es: Diploma
it: Certificato
tr: Sertifika

source: Download your certificate!
es: ¡Descarga tu diploma!
it: Scarica il tuo certificato!
tr: Sertifikanızı indirin!

source: Score in detail
ca: Puntuació al detall
es: Puntuación en detalle:
gl: Puntuación en detalle
it: Il punteggio in dettaglio
pt: Pontuação em detalhes.
tr: Puan detayları

source: Here we show the score in each programming skill as well as links to sites that can help you to level up.
es: Ésta es la puntuación de cada habilidad de programación y enlaces a páginas que pueden ayudarte a mejorarla.
it: Qui mostriamo il punteggio in ogni abilità di programmazione, nonché i collegamenti alle pagine del sito che possono aiutarti a salire di livello.
tr: Burada her programlama becerisindeki puanı ve seviyenizi yükseltmenize yardımcı olabilecek sitelere bağlantıları gösteriyoruz.

source: Score:
ca: Puntuació:
es: Puntuación:
gl: Puntuación:
it: Punteggio:
pt: Pontuação:
tr: Puan:

source: I have just obtained %(points)s points analyzing my project in Dr. Scratch! Beat it! @DrScratchTool
ca: He aconseguit %(points)s punts analitzant el meu projecte a Dr. Scratch! Pots superar-ho? @DrScratchTool
es: He conseguido %(points)s puntos analizando mi proyecto en Dr. Scratch!¡A ver si lo superas! @DrScratchTool
gl: Conseguín %(points)s puntos analizando o meu proxecto en Dr. Scratch! A ver se o superas! @DrScratchTool
it: Ho appena ottenuto %(points)s punti analizzando il mio progetto in Dr. Scratch! Battilo! @DrScratchTool
pt: Acabei de ganhar %(points)s pontos analisando meu projeto no Dr.Scratch! Ganhe disso!@DrScratchTool
tr: Projemi Dr. Scratch'te analiz ederek %(points)s puan aldım! Bunu geç! @DrScratchTool

source: <h3 class='text-left dark-text'>The level of your project is... <strong>BASIC! </strong></h3>
es: <h3 class='text-left dark-text'>El nivel de tu proyecto es... <strong>¡BÁSICO! </strong></h3>
it: <h3 class='text-left dark-text'>Il livello del tuo progetto è... <strong>BASIC! </strong></h3>
tr: <h3 class='text-left dark-text'>Projenizin seviyesi... <strong>TEMEL! </strong></h3>

source: You're at the beginning of a <br>great adventure . . . Keep it up!
ca: Et trobes a l'inici d'una <br>gran aventura. . . Segueix així!
es: Estás al principio de una gran aventura. . . <br>¡Continúa así!
gl: Estás ao comezo dunha grande aventura... <br>Continúa así!
it: Sei all'inizio di una <br>grande avventura. . . Continua così!
pt: Você está no início de uma grande aventura . . . Continue assim!
tr: Başlangıç aşamasındasınız <br> büyük bir macera... Devam edin!

source: Come back to your Scratch project.
ca: Torna al teu projecte Scratch.
es: Vuelve a tu proyecto Scratch
gl: Voltar para o seu proxecto Scratch.
it: Torna al tuo progetto Scratch.
pt: Volte para o seu projecto Scratch.
tr: Scratch projenize geri dönün.

source: Project certificate
ca: Certificat del projecte
es: Certificado del proyecto
it: Certificato del progetto
tr: Proje sertifikası

source: Download
ca: Descarregar
es: Descargar
it: Scarica
tr: İndirmek

source: Level up
ca: Millora el teu nivell
es: Mejora tu nivel
gl: Mellora o teu nivel
it: Melhore o seu nível
pt: Melhore o seu nível
tr: Seviye atlamak

source: Your project does not have duplicated scripts, good job!
ca: El teu projecte no té programes duplicats, bon treball!
es: Tu proyecto no tiene código duplicado. ¡Buen trabajo!
gl: O teu proxecto non ten programas duplicados, bo traballo!
it: Il tuo progetto non ha script duplicati, ottimo lavoro!
pt: Seu projeto não tem scripts duplicados, bom trabalho!
tr: Projenizde yinelenen betikler yok, iyi iş!

source: Sprite Naming
ca: Noms d'objectes
gl: Nomes de obxectos
it: Nome oggetto
pt: Nomes de objetos
tr: Sprite Adlandırma

source: Dead Code
ca: Codi Mort
gl: Código morto
it: Codice morto
pt: Código morto
tr: Ölü Kod

source: Your project does not have default sprite naming, good job!
ca: El teu projecte no té noms inadequats, bon treball!
es: Tu proyecto no tiene nombres de objectos inadecuados.¡Buen trabajo!
gl: O teu proxecto non ten nomes de obxectos non axeitados, bo traballo!
it: Il tuo progetto non ha nomi degli sprite predefiniti, ottimo lavoro!
pt: Seu projeto não possui nomes das personagens padrão, bom trabalho!
tr: Projenizde varsayılan sprite adlandırması yok, iyi iş!

source: Your project does not have default backdrop naming, good job!
ca: El teu projecte no té noms d'escenaris inadequats, bon treball!
es: Tu proyecto no tiene nombres de escenarios inadecuados.¡Buen trabajo!
gl: O teu proxecto non ten nomes dos escenarios non axeitados, bo traballo!
it: Il tuo progetto non ha denominazione degli sfondo predefiniti, ottimo lavoro!
pt: Seu projeto não possui nomes de cenário padrão, bom trabalho!
tr: Projenizde varsayılan arka plan adlandırması yok, iyi iş!

source: Your project does not have dead code, good job!
ca: El teu projecte no té codi mort, bon treball!
es: Tu proyecto no tiene código muerto. ¡Buen trabajo!
gl: O teu proxecto non ten código morto, bo traballo!
it: Il tuo progetto non ha dead code (codice inutilizzato), ottimo lavoro!
pt: Seu projeto não tem código morte, bom trabalho!
tr: Projenizde ölü kod yok, iyi iş!

source: Duplicated Scripts
ca: Programas duplicats
gl: Programas duplicados
it: Scripts duplicati
pt: Programas duplicados
tr: Yinelenen Betikler

source: You're doing a great job. Keep it up!!!
ca: Estàs fent una gran feina. Continua així!
gl: Estás a facer un gran traballo. Continúa así!
it: Stai facendo un ottimo lavoro. Continua così!!!
pt: Estás fazendo um ótimo trabalho. Continue assim!
tr: Harika bir iş çıkarıyorsunuz. Devam edin!!!

source: Bad habits
ca: Mals hàbits
es: Malos hábitos
gl: Malos hábitos
it: Cattive abitudini
pt: Maus hábitos
tr: Kötü Alışkanlıklar

source: duplicated scripts.
ca: programes duplicats.
es: programas duplicados.
gl: programas duplicados.
it: script duplicati.
pt: scripts duplicados.
tr: Yinelenen betikler.

source: sprite naming.
ca: noms inadequats.
es: nombres de objetos inadecuados.
gl: nomes de obxectos non axeitados.
it: denominazione degli sprite.
pt: nomeação das personagens.
tr: Sprite adlandırma.

source: Backdrop naming
ca: Noms poc encertats
es: Nombres de escenarios
gl: Nomes non axeitados
it: Denominazione degli sfondo
pt: Nomeação de cenário
tr: Arka plan adlandırma

source: backdrop naming.
ca: noms d'escenaris inadequats.
es: nombres de escenarios inadecuados.
gl: nomes dos escenarios non axeitados.
it: denominazione degli sfondo.
pt: nomeação de cenário.
tr: Arka plan adlandırma

source: dead code.
ca: codi mort.
es: código muerto.
gl: código morto.
it: dead code (codice inutilizzato).
pt: código morto.
tr: Ölü kod.

source: <h3 class='text-left dark-text'>The level of your project is... <strong> MASTER! </strong></h3>
es: <h3 class='text-left dark-text'>El nivel de tu proyecto es... <strong> ¡ALTO!</strong></h3>
it: <h3 class='text-left dark-text'>Il livello del tuo progetto è... <strong> MASTER! </strong></h3>
tr: <h3 class='text-left dark-text'>Projenizin seviyesi... <strong> USTA! </strong></h3>

source: You're the master of the universe!!!
ca: Ets el màster de l'univers!!!
es: ¡¡¡Eres el master del universo!!!
gl: Es o amo do universo!!!
it: Sei il master dell'universo !!!
pt: Você é o mestre do universo!!!
tr: Evrenin ustasısınız!!!

source: Bad habits in programming
ca: Mals hàbits en programació
es: Malos hábitos en programación
it: Cattive abitudini di programmazione
pt: Maus hábitos em programação
tr: Programlamadaki kötü alışkanlıklar

source: If you correct your bad habits in programming, you will avoid problems in the future.
ca: Si corregeixes ara els teus mals hàbits en programació, evitaràs problemes en el futur.
es: Si corriges ahora tus malos hábitos en programación, evitarás problemasen el futuro.
it: Se correggi le cattive abitudini di programmazione, eviterai problemi in futuro.
pt: Se você corrigir seus maus hábitos de programação, você evitará problemas no futuro.
tr: Programlamadaki kötü alışkanlıklarınızı düzeltirseniz, gelecekteki sorunlardan kaçınabilirsiniz.

source: <h3 class='text-left dark-text'>The level of your project is... <strong>DEVELOPING! </strong></h3>
es: <h3 class='text-left dark-text'>El nivel de tu proyecto es... <strong>¡MEDIO! </strong></h3>
it: <h3 class='text-left dark-text'>Il livello del tuo progetto è... <strong>DEVELOPING! </strong></h3>
tr: <h3 class='text-left dark-text'>Projenizin seviyesi... <strong>GELİŞEN! </strong></h3>

source: You're doing a great job. Keep it up!!!
ca: Estàs fent un gran treball. Segueix així!!!
es: Estás haciendo un gran trabajo. ¡Sigue así!
gl: Estás a facer un bo traballo. Segue así!!!
it: Stai facendo un ottimo lavoro. Continua così!!!
pt: Você está fazendo um ótimo trabalho. Continue assim!!!
tr: Harika bir iş çıkarıyorsunuz. Devam edin!!!

source: Sprites attributes
ca: Atributs no inicialitzats correctament
es: Atributos no inicializados correctamente
gl: Atributos non inicializados correctamente
it: Attributi degli sprite
pt: Atributos das personagens
tr: Sprite özellikleri

source: Your project does not have uninitialized attributes, good job!
ca: El teu projecte no té atributs sense inicialitzar, bon treball!
es: Tu proyecto no tiene atributos sin inicializar. ¡Buen trabajo!
gl: O teu proxecto non ten atributos non inicializados correctamente, bo traballo!
it: Il tuo progetto non ha attributi non inizializzati, ottimo lavoro!
pt: Seu projeto não tem atributos não inicializados, bom trabalho!
tr: Projenizde başlatılmamış özellikler yok, iyi iş!

source: sprite attributes.
ca: atribuits no inicialitzats correctament.
es: atributos no inicializados correctamente.
gl: atributos non inicializados correctamente.
it: attributi degli sprite.
pt: atributos das personagens.
tr: Sprite özellikleri.

source: Download my CSV files.
ca: Descarregar el fitxer .csv
es: Descargar el fichero .csv
it: Scarica i miei file CSV.
pt: Fazer o download do arquivo. .csv
tr: CSV dosyalarımı indir.

source: Here you can download the CSV files previously analyzed.
ca: Pots descarregar els teus fitxers analitzats prèviament.
es: Puedes descargar los ficheros .csv que se han analizado previamente.
it: Qui è possibile scaricare i file CSV precedentemente analizzati.
pt: Aqui você pode baixar os arquivos CSV previamente analisadas.
tr: Buradan daha önce analiz edilen CSV dosyalarını indirebilirsiniz.

source: Date
ca: Data
es: Fecha
it: Data
pt: Data
tr: Tarih

source: Downloads
ca: Descàrregues
es: Descargas
gl: Transferencias
it: Download
tr: İndirilenler

source: New coder in Dr. Scratch!
es: ¡Nuevo programador en Dr. Scratch!
it: Nuovo programmatore in Dr. Scratch!
tr: Dr. Scratch'te yeni kodlayıcı!

source: You're receiving this email because you have successfully signed up in Dr. Scratch.
es: Estas recibiendo este email porque te has registrado con éxito en Dr. Scratch.
it: Ricevi questa mail per esserti correttamente registrato in Dr Scratch.
tr: Bu e-postayı, Dr. Scratch'te başarılı bir şekilde kaydolduğunuz için alıyorsunuz.

source: Thanks for using our website!
ca: Gràcies per utilitzar la nostra web!
es: ¡Gracias por usar nuestra web!
it: Grazie per aver utilizzato il nostro sito!
pt: Obrigado por utilizar nosso website:
tr: Web sitemizi kullandığınız için teşekkürler!

source: The Dr. Scratch team
ca: L'equip de Dr. Scratch
es: El equipo de Dr. Scratch
gl: O equipo de Dr. Scratch
it: Il team di Dr Scratch
pt: A equipe de Dr. Scratch
tr: Dr. Scratch ekibi

source: Do you want to analyze one project?
ca: Vols analitzar un projecte?
es: ¿Quieres analizar un proyecto?
gl: Unha ferramenta poderosa para analizar os teus proxectos Scratch
it: Vuoi analizzare un progetto?
pt: Você quer analisar um projeto?
tr: Bir projeyi analiz etmek ister misiniz?

source: There are two options to analyze your Scratch project now!
ca: Hi ha dues opcions per analitzar un projecte de Scratch amb Dr. Scratch
es: Hay dos opciones para analizar un proyecto de Scratch con Dr. Scratch
gl: Hai dúas opcións para analizar un proxecto Scratch con Dr.Scratch
it: Ci sono due modi per analizzare il tuo progetto di Scratch, ora!
pt: Há duas opções para analisar um projeto do Scratch com Dr.Scratch!
tr: Şu anda Scratch projenizi analiz etmek için iki seçeneğiniz var!

source: 1. Introduce the <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> of your Scratch project, you don't have to download it:
ca: 1. Introdueix la <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> del teu projecte Scratch, no hauràs de descarregar-lo:
es: 1. Introduce la <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> de tu proyecto Scratch, no tendrás que descargarlo:
gl: 1. Introduza o <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> do seu proxecto, non é preciso facer a descarga:
it: 1. Inserisci l'<span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> del tuo progetto Scratch se non lo hai scaricato sul tuo pc:
pt: 1. Introduza a <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> de seu projeto no Scratch, assim você não precisa fazer seu download:
tr: 1. Giriş yapın <span class='colored-text'><a data-toggle='modal' href='#modalUrl'>url</a></span> Scratch projenizin, indirmeniz gerekmeden:

source: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/your_number" type="text">
ca: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http://scratch.mit.edu/projects/el_teu_número" type="text">
es: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http://scratch.mit.edu/projects/tu_número" type="text">
gl: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/seu_número" type="text">
it: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/tuo_numero_progetto" type="text">
tr: <input name="urlProject" id="cf-name" class="form-control input-box placeholder" placeholder="http:/scratch.mit.edu/projects/numaranız" type="text">

source: Analyze by url
ca: Analitzar per url
es: Analizar por url
gl: Analizar url
it: Analizza da url
pt: Analise a partir da url
tr: URL ile analiz et

source: 2. If you have your <span class='colored-text'><a data-toggle='modal' href='#modalProject'>project</a></span> downloaded in the computer you can analyze it here:
ca: 2. Si tens el teu <span class='colored-text'><a data-toggle='modal' href='#modalProject'>projecte</a></span> descarregat al teu ordinador, podràs analitzar-lo aquí:
es: 2. Si tienes tu <span class='colored-text'><a data-toggle='modal' href='#modalProject'>proyecto</a></span> descargado en tu ordenador, podrás analizarlo aquí:
gl: 2. Se ten descargado o seu <span class='colored-text'><a data-toggle='modal' href='#modalProject'>proxecto</a></span> para o ordenador, pode analiza-lo aquí:
it: 2. Se hai il tuo<span class='colored-text'><a data-toggle='modal' href='#modalProject'>progetto</a></span> scaricato sul computer, puoi analizzarlo qui:
pt: 2. Se você tem seu <span class='colored-text'><a data-toggle='modal' href='#modalProject'>project</a></span> em seu computador, você pode analisá-lo aqui:
tr: 2. Bilgisayarınıza indirdiğiniz <span class='colored-text'><a data-toggle='modal' href='#modalProject'>proje</a></span> ile burada analiz edebilirsiniz:
