Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: There are several events more that can achieve parallelism:
ca: Existeixen altres esdeveniments que permeten aconseguir paral·lelisme:
es: Existen varios eventos más que permiten conseguir paralelismo:
gl: Existen moitos máis casos nos que se pode acadar paralelismo:
it: Ci sono diversi eventi che possono realizzare il parallelismo:
pt: Há muitos outros evento que podem ser colocados em paralelo:
tr: Paralellik sağlamak için kullanılabilecek birkaç diğer olay da vardır:

source: when backdrop switches to [backdrop1 v]
ca: quan l'escenari canviï al fons [backdrop1 v]
es: cuando el fondo cambie a [backdrop1 v]
gl: Ao mudar o fondo a [fondo1 v]
it: quando lo sfondo passa a [sfondo1 v]
pt: Quando o cenário mudar para [backdrop1 v]

source: when I receive [message1 v]
ca: quan rebi [message1 v]
es: al recibir [message1 v]
gl: ao recibir [message1 v]
it: quando ricevo [messaggio1 v]
pt: Quando receberes a mensagem [mensagem1 v]

source: when [loudness v] &gt; (10)
ca: quan [volum del so v] &gt; (10)
es: cuando [volumen del sonido v] &gt; (10)
gl: Cando [volume do son v] &gt; (10)
it: quando [volume microfono v] &gt; (10)
pt: Quando o valor do sensor [o volume v] exceder (10)

source: when [video motion v] &gt; (2)
ca: quan [moviment de vídeo v] &gt; (2)
es: cuando [movimiento del video v] &gt; (2)
gl: Cando [movemento do vídeo v] &gt; (2)
it: quando [movimento del video v] &gt; (2)
pt: Quando o valor do sensor [o movimiento do vídeo v] exceder (2)

source: when [timer v] &gt; (45)
ca: quan [cronòmetre v] &gt; (2)
es: cuando [cronómetro v] &gt; (45)
gl: Cando [cronómetro v] &gt; (45)
it: quando [cronometro v] &gt; (45)
pt: Quando o valor do sensor [o valor do cronómetro v] exceder (45)

source: As you see, you could create several programs that begin to run when changing the background to a given scenario, or to receive a particular message, or when the room volume exceeds a certain threshold, when the video motion is greater than a number pixel concrete or when the timer has exceeded the value you want. Therefore, there are many possibilities to make things happen in your programs simultaneously. Do you dare to investigate how works?
ca: Com veus, podries crear diferents programes que comencin a executar-se al canviar l'escenari a un determinat fons, o al rebre un missatge concret, o quan el volum de l'ambient sigui superior a un determinat llindar, quan el moviment de vídeo sigui major que un nombre de pixels concret o quan el cronòmetre hagi superat el valor que tu vulguis. Per tant, existeixen moltes possibilitats per aconseguir que en els teus programes es donin diferents fets alhora. T'animes a provar algunes d'elles?
es: Como ves, podrías crear varios programas que comenzaran a ejecutarse al cambiar el fondo a un determinado escenario, o al recibir un mensaje concreto, o cuando el volumen del ambiente sea superior a un determinado umbral, cuando el movimiento del vídeo se mayor que un número de pixels concreto o cuando el cronómetro haya superado el valor que tú quieras. Por tanto, existen muchas posibilidades para conseguir que en tus programas ocurran cosas al mismo tiempo. ¿Te animas a probar algunas de ellas?
gl: Como ves, poderías crear moitos programas que comecen a executarse cando se cambia o fondo a un escenario dado, ou ao recibir unha mensaxe particular, ou cando o volume do espazo sobrepasa un certo limiar, cando o movemento de vídeo é maior ca un número de píxeles concreto ou cando o contador de tempo pasa do valor que ti queiras. Polo tanto, hai moitas posibilidades de facer que as cousas ocorran simultaneamente nos teus programas. Anímaste a probar como funciona?
it: Come vedi, puoi creare diversi programmi che iniziano l'esecuzione quando si cambia lo sfondo di uno scenario specifico, o quando si riceve un particolare messaggio, quando il volume della stanza supera una determinata soglia, quando il movimento del video è maggiore di un numero reale di pixel o quando il cronometro ha superato il valore desiderato. Pertanto, ci sono molte possibilità per fare accadere contemporaneamente le cose nei tuoi programmi. Hai il coraggio di capire di più su come funziona?
pt: Como você vê, você pode criar vários programas que começam a rodar quando se muda o fundo de um cenário ou para receber uma mensagem específica ou quando o volume da sala ultrapassas um certo valor (limiar) quando o movimento do vídeo é maior que um número de pixels ou ainda quando o timer passa do valor que você quer. Assim, há muitas possibilidades de fazer coisas acontecerem simultaneamente em seus programas. Você gostaria de investigar como isso funciona?
tr: Gördüğünüz gibi, belirli bir senaryoya arka plan değiştiğinde, belirli bir mesaj aldığında, ses seviyesi belirli bir eşiği aştığında, video hareketi belirli bir piksel sayısından fazla olduğunda veya zamanlayıcı istediğiniz değeri geçtiğinde çalışmaya başlayan birkaç program oluşturabilirsiniz. Dolayısıyla, programlarınızda aynı anda birden fazla şeyin gerçekleşmesini sağlamak için birçok seçenek vardır. Nasıl çalıştığını araştırmaya cesaret edebilir misiniz?

source: Personalized Mode
ca: Mode Personalitzat
gl: Modo Personalizado
it: Modalità personalizzata
pt: Modo Personalizado
tr: Özelleştirilmiş Modu

source: The functionality of this mode is divided in 3 steps:
ca: El funcionament d'aquest mode està dividit en 3 passos:
gl: O funcionamento deste modo está dividido en 3 pasos:
it: La funzionalità di questa modalità è divisa in 3 passaggi:
pt: O funcionamento deste modo está dividido em 3 passos:
tr: Bu modun işlevselliği 3 adıma ayrılmıştır:

source: 1. Creation of the Rubric with the grades of each dimension.
ca: 1. Creació de la Rúbrica amb els graus de cada dimensió.
gl: 1. Creación da Rúbrica cos graos de cada dimensión.
it: 1. Creazione della rubrica con i voti di ciascuna dimensione.
pt: 1. Criação da Rubrica com os graus de cada dimensão.
tr: 1. Her boyutun notlarıyla birlikte Rubrik'in oluşturulması.

source: 2. Sharing the link to the Rubric created in the previous step.
ca: 2. Compartir l'enllaç a la rúbrica creada en el pas anterior.
gl: 2. Compartir a ligazón á rúbrica creada no paso anterior.
it: 2. Condivisione del link alla rubrica creata nel passaggio precedente.
pt: 2. Compartilhar o link para a rubrica criada no passo anterior.
tr: 2. Önceki adımda oluşturulan Rubrik'in bağlantısının paylaşılması.

source: 3. Upload of the projects via an url, .sb3 file or a .txt file with multiple projects.
ca: 3. Pujar el projecte a través d'una URL, un fitxer .sb3 o analitzar múltiples projectes mitjançant un fitxer .txt.
gl: 3. Cargar o proxecto a través dunha ligazón, un ficheiro .sb3 ou analizar múltiples proxectos mediante un ficheiro .txt.
it: 3. Caricamento dei progetti tramite un URL, un file .sb3 o un file .txt con più progetti.
pt: 3. Carregar o projeto através de um link, um arquivo .sb3 ou analisar múltiplos projetos por meio de um arquivo .txt.
tr: 3. Projelerin bir URL, .sb3 dosyası veya birden fazla proje içeren .txt dosyası aracılığıyla yüklenmesi.

source: Instructions related to synchronization <b>allow our characters to organize things happen in the order we want</b>.
ca: Les instruccions relacionades amb la sincronització <b>permeten organitzar els nostres personatges per a que les coses succeeixin en l'ordre que nosaltres desitgem</b>.
es: Las instrucciones relacionadas con la sincronización <b>permiten organizar a nuestros personajes para que las cosas ocurran en el orden que nosotros deseamos</b>.
gl: As instruccións relacionadas coa sincronización <b>permiten organizar os nosos personaxes para que as cousas acontezan na orde que nós queiramos</b>.
it: Istruzioni relative alla sincronizzazione <b>consente ai nostri personaggi di far accadere le cose nell'ordine che vogliamo</b>.
pt: Instruções relacionadas à sincronização <b>permitem que nossos personagens organizem a ordem em que as ações vão ocorrer</b>.
tr: Senkranizasyon ile ilgili talimatlar <b>karakterlerimizin olayları istediğimiz sıraya göre düzenlemesini sağlar</b>.

source: The easiest way to synchronize the behavior of your characters is using a <i>'wait'</i> block, which makes the character waits the number of seconds you write as a parameter block. An example of how this block can be used to synchronize two characters:
ca: La manera més senzilla de sincronitzar el comportament dels teus personatges és fent ús del bloc <i> "espera"</i>, el qual fa que el personatge esperi el nombre de segons que escriguem com a paràmetre del bloc. Vegem un exemple de com podem utilitzar aquest bloc per sincronitzar dos personatges:
es: La forma más sencilla de sincronizar el comportamiento de tus personajes es utilizando un bloque <i>“esperar”</i>, que hace que el personaje espere el número de segundos que escribamos como parámetro del bloque. Veamos un ejemplo de cómo puede utilizarse este bloque para sincronizar a dos personajes:
gl: O xeito máis sinxelo para sincronizar o comportamento dun personaxe é usar o bloque 'agardar', que fai que o personaxe agarde o número de segundos que escribas como parámetro do bloque. Un exemplo de como usar este bloque para sincronizar dous personaxes é este:
it: Il modo più semplice per sincronizzare il comportamento dei tuoi personaggi è quello di utilizzare un blocco <i>'attendi'</i>, il personaggio attende il numero di secondi che scrivi come parametro nel blocco. Un esempio di come questo blocco può essere utilizzato per sincronizzare due personaggi:
pt: A forma mais fácil de sincronizar o comportamento de seus personagens é usando um bloco <i>'espere'</i>, que faz o personagem esperar uma quantidade de segundos que você define como parâmetro do bloco. Um exemplo de como esse bloco pode ser usado para sincronizar dois personagens é:
tr: Karakterlerinizin davranışını senkronize etmenin en kolay yolu, karakterin parametre olarak yazdığınız süre kadar beklemesini sağlayan bir <i>'wait'</i> bloğu kullanmaktır. İşte bu bloğun iki karakteri senkronize etmek için nasıl kullanılabileceğine dair bir örnek:

source: say [Hello, how are you?] for (2) secs
ca: digues [Hola, com estàs?] durant (2) segons
es: decir [Hola, ¿cómo estás?] durante (2) segundos
gl: dicir [Ola cómo está?]
it: dire [Ciao, come stai?] per (2) secondi
pt: diz [Olá, como vai você?] durante (2) s

source: wait (2) secs
ca: espera (2) segons
es: esperar (2) segundos
gl: agardar (2) segundos
it: attendi (2) secondi
pt: espera (2) s

source: say [Well, do you want to play hide-and seek?] for (3) secs
ca: digues [Bé! Vols jugar a fet i amagar?]
es: decir [Bien! ¿Quieres jugar al escondite?]
gl: dicir [Quere xogar agachadas?] durante (3) segundos
it: dire [Bene, vuoi giocare a nascondino?] per (3) secondi
pt: diz [Bem, você quer brincar de esconde-esconde?] durante (3) s

source: say [Let's go] for (2) secs
ca: digues [Som-hi!] durant (2) segons
es: decir [Vamos!] durante (2) segundos
gl: dicir [Imos!] durante (2) segundos
it: dire [Andiamo] per (2) secondi
pt: diz [Vamos] durante (2) s

source: say [I'm fine, thanks!] for (2) secs
ca: digues [Estic bé, gràcies!] durant (2) segons
es: decir [Estoy bien, ¡gracias!] durante (2) segundos
gl: dicir [Eu estou ben,grazas!] durante (2) segundos
it: dire [Sto bene, grazie!] per (2) secondi
pt: diz [Eu estou bem, obrigado!] durante (2) s

source: wait (3) secs
ca: espera (3) segons
es: esperar (3) segundos
gl: agardar (3) segundos
it: attendi (3) secondi
pt: espera (3) s

source: say [Yes] for (1) secs
ca: digues [Sí] durant (2) segons
es: decir [Sí] durante (2) segundos
gl: dicir [Si] durante (1) segundos
it: dire [Sì] per (1) secondi
pt: diz [Sim] durante (1) s

source: In this case it uses blocks <i>'wait'</i> to synchronize these two characters to maintain a conversation, so that while one speaks, the other character waits, and vice versa. Note that the number of seconds that each character expected, are equal to the number of seconds that the other character speaks, so they never talk at the same time.
ca: En aquest cas s'han utilitzat els blocs <i>"espera"</i> per sincronitzar els dos personatges i que d'aquesta manera puguin mantenir una conversa en què mentre un parla l'altre espera i viceversa. Fixa't que el nombre de segons que cada personatge espera és igual al nombre de segons que l'altre personatge parla, de manera que mai intervenen alhora.
es: En este caso se han utilizado los bloques <i>“esperar”</i> para sincronizar a estos dos personajes para que mantengan una conversación, de forma que mientras uno habla, el otro espera, y viceversa. Fíjate en que el número de segundos que cada personaje espera, son iguales al número de segundos que el otro personaje habla, de manera que nunca hablan al mismo tiempo.
gl: Neste caso ustilízase o bloque <i>'agardar'</i> para sincronizar estes dous personaxes mantendo unha conversa, de xeito que cando un estea a falar, o outro personaxe agarda, e viceversa. Hai que ter en conta que o número de segundos que un personaxe agarda, é igual ao número de segundos que o outro personaxe fala, de xeito que nunca falan os dous ao mesmo tempo.
it: In questo caso si utilizzano i blocchi <i>'attendi'</i> per sincronizzare una conversazione tra questi due personaggi, in modo che mentre il primo parla l'altro personaggio attende e viceversa. Si noti che il numero di secondi che ogni personaggio attende sono uguali al numero di secondi in cui l'altro personaggio parla, quindi non parlano mai allo stesso tempo.
pt: Neste caso, são usados blocos <i>'espere'</i> para sincronizar esses dois personagens a manter uma conversa, de modo que quando um fala, o outro espera e vice-versa. Observe que o número de segundos que cada personagem espera é igual ao número de segundos que o outro fala. Assim, eles nunca falam ao mesmo tempo.
tr: Bu durumda, iki karakteri bir konuşmayı sürdürecek şekilde senkronize etmek için <i>'wait'</i> blokları kullanılır; böylece biri konuşurken diğeri bekler ve tam tersi. Her iki karakterin beklediği süre, diğer karakterin konuştuğu süreye eşittir, böylece hiçbiri aynı anda konuşmaz.

source: Synchronization using blocks <i>'wait'</i> is very simple when programs are small and have few characters, but when are larger, or when we have several characters, or when conditions to generate a reaction can not be measured previously, it is more efficient to use other modes of synchronization and messages. Here's an example:
ca: La sincronització per mitjà de blocs <i>"espera"</i> és molt senzilla quan els programes són petits i tenim pocs personatges, però quan són més grans, o quan tenim diversos personatges, o bé quan les condicions per generar una reacció no poden ser mesurades prèviament, és més eficient utilitzar altres modes de sincronització com són els missatges. Vegem un exemple:
es: La sincronización mediante bloques <i>“esperar”</i> es muy sencilla cuando los programas son pequeños y tenemos pocos personajes, pero cuando son más grandes, o cuando tenemos varios personajes, o cuando las condiciones para generar una reacción no pueden ser medidas previamente, es más eficiente utilizar otros modos de sincronización como los mensajes. Veamos un ejemplo:
gl: A sincronización usando bloques <i>'agardar'</i> é moi sinxela cando os programas son pequenos e teñen poucos personaxes, mais cando son largos ou teñen moitos personaxes, ou cando as condicións que xeran unha reacción non se poden medir previamente, é máis eficiente usar outros modos de sincronización e mensaxes. Velaquí un exemplo:
it: La sincronizzazione usando i blocchi <i>'attendi'</i> è molto semplice quando i programmi sono brevi e hanno pochi personaggi, ma quando il programma è più complesso o quando abbiamo diversi sprite o quando le condizioni per generare una reazione non possono essere calcolate in precedenza, è più efficiente utilizzare altri metodi di sincronizzazione e i messaggi. Ecco un esempio:
pt: Sincronização usando blocos <i>'espere'</i> é bem simples quando os programas são pequenos e tem poucos personagens. Mas, quando são maiores, ou tem muitos personagens, ou quando as condições para gerar uma reação não podem ser medidas previamente, é mais eficiente usar outros modos de sincronização e mensagens. Aqui tem um exemplo:
tr: Bloklar <i>'wait'</i> kullanarak senkronizasyon yapmak, programlar küçük ve birkaç karakter içerdiğinde çok basittir. Ancak programlar daha büyük olduğunda, birçok karakter bulunduğunda veya reaksiyon oluşturma koşulları önceden ölçülemiyorsa, diğer senkronizasyon yöntemlerini ve mesajları kullanmak daha verimli olur. İşte bir örnek:

source: if &lt; touching [mouse pointer v]?&gt;then
ca: si &lt; tocant [punter del ratolí v]? &gt; llavors
es: si &lt; ¿tocando [puntero del raton v]? &gt;entonces
gl: se &lt; toca [punteir do rato v]?&gt; entón
it: se &lt; sta toccando [puntatore del mouse v]?&gt;allora
pt: se &lt; estás a tocar em [o pointero do rato v]&gt; , então

source: broadcast [catched! v]
ca: envia a tots [atrapat! v]
es: enviar [¡pillado! v]
gl: emitir [atrapado! v]
it: invia a tutti [catturato! v]
pt: difunde a mensagem [apanhado! v]

source: when I receive [catched! v]
ca: quan rebi [atrapat! v]
es: al recibir [¡pillado! v]
gl: ao recibir [atrapado v]
it: quando ricevo [catturato! v]
pt: Quando receberes a mensagem [apanhado! v]

source: say [You have catched my friend] for (2) secs
ca: digues [Has atrapat el meu amic!] durant (2) segons
es: decir [¡Has pillado a mi amigo!] durante (2) segundos
gl: dicir [Vostede capturado ao meu amigo]
it: dire [Hai catturato il mio amico] per (2) secondi
pt: diz [Você pegou meu amigo] durante (2) s

source: say [Now, you have to catch me!] for (2) secs
ca: digues [Ara, m'has d'atrapar a mi!] durant (2) segons
es: decir [¡Ahora tienes que pillarme a mi!] durante (2) segundos
gl: dicir [Agora ten que collerme o meu!] durante (2) segundos
it: dire [Ora, devi catturare me!] per (2) secondi
pt: diz [Agora, você tem que me pegar!] durante (2) s

source: How do these syncblocks work? When a situation occurs in a character we want to cause a reaction in another character, we can use <b>messaging</b>. In the example, when the mouse touches the cat, the message 'Caught!', which will be sent to all the characters of the project is sent. Thus, when the butterfly receives the message 'Caught!', the instructions on the block <i>'when receive 'caught!'</i>'. Therefore, when the user touches the cat whit the mouse, butterfly says, 'You caught my companion. Now you have to catch me!'.
ca: Com funcionen aquests blocs de sincronització? Quan es produeix una situació en què volem que un personatge provoqui una reacció en un altre personatge, podem fer ús de l'<b>enviament de missatges</b>. En l'exemple, quan el ratolí toca el gat, s'envia el missatge "Atrapat!", que serà enviat a tots els personatges del projecte. Així, quan la papallona rebi el missatge "Atrapat", s'executaran les instruccions incloses sota el bloc <i>"quan rebi Atrapat!"</i>. Per tant, quan l'usuari toqui amb el ratolí el gat, la papallona dirà: "Has atrapat el meu amic. Ara m'has d'atrapar a mi".
es: ¿Cómo funciona estos bloques de sincronización? Cuando se produce una situación en un personaje que queremos que provoque una reacción en otro personaje, podemos hacer uso del <b>envío de mensajes</b>. En el ejemplo, cuando el ratón toca al gato, se envía el mensaje “Pillado”, que será enviado a todos los personajes del proyecto. Así, cuando la mariposa recibe el mensaje “Pillado”, se ejecutan las instrucciones incluidas bajo el bloque <i>“al recibir Pillado”</i>. Por tanto, cuando el usuario toque con el ratón al gato, la mariposa dirá: “Has pillado a mi compañero. Ahora tienes que pillarme a mí”.
gl: Como funcionan estes bloques de sincronización? Cando un personaxe se atopa nunha situación na que queremos desencadear unha reacción noutro, podemos usar a mensaxería. No exemplo, cando o rato toca ao gato, envíase a mensaxe 'Collido!' a todos os personaxes do proxecto. Desde xeito, cando a bolboreta recibe a mensaxe 'Collido!', as instrucción do bloque 'ao recibir 'Collido!'' se executan. Polo tanto, cando o usuario toca ao gato co rato, a bolboreta di 'Colleches ao meu compañeiro. Agora tes que me coller a min!'
it: Come funzionano questi blocchi sincronizzati? Quando una situazione si verifica in un personaggio che vogliamo sia causa di una reazione in un altro personaggio, possiamo utilizzare i <b>messaggi</b>. Nell'esempio, quando il topo tocca il gatto, viene inviato il messaggio 'Catturato!', che verrà inviato a tutti i personaggi del progetto. Così, quando la farfalla riceve il messaggio 'Catturato!', vengono attivate le istruzioni del blocco <i>'quando ricevo 'catturato!'.'</i> Quando l'utente tocca il gatto con il mouse, la farfalla dice: 'Hai preso il mio amico. Ora devi prendere me!'.
pt: Como esses blocos de sincronização funcionam? Quando queremos que uma situação em um personagem cause uma reação em outro, podemos usar <b>mensagens</b>. No exemplo, quando o mouse toca o gato, a mensagem 'Pego!' é enviada para todos os personagens do projeto. Então, quando a borboleta recebe a mensagem 'Pego!', as instruções no bloco <i>'quando recebe 'Pego!'</i> são executadas. Daí, a borboleta faal 'Você me pegou. Agora tem que me pegar!'
tr: Bu senkronizasyon blokları nasıl çalışır? Bir karakterde bir durum oluştuğunda başka bir karakterde bir reaksiyon oluşturmak istiyorsak, <b>mesajlaşmayı</b> kullanabiliriz. Örneğin, fare kediye dokunduğunda, projedeki tüm karakterlere gönderilecek olan 'Yakalandı!' mesajı gönderilir. Böylece, kelebek 'Yakalandı!' mesajını aldığında, <i>''yakalandı'' mesajını aldığında</i> bloğundaki talimatlar çalışır. Bu şekilde, kullanıcı fareyi kediye dokundurduğunda, kelebek 'Yoldaşımı yakaladınız. Şimdi beni yakalamalısınız!' der.

source: In addition to sending messages, you can synchronize characters to make things happen in the order we want, using other blocks, such as <i>'wait until'</i> or <i>'when the background changes to ...'</i>.
ca: A més de l'enviament de missatges, és possible sincronitzar personatges per tal que les accions succeeixin el l'ordre que nosaltres desitgem, tot utilitzant un altre tipus de blocs, com ara <i>"espera fins"</i> o <i>"quan l'escenari canviï al fons..."</i>.
es: Además del envío de mensajes, es posible sincronizar personajes para que las cosas ocurran en el orden que nosotros deseamos utilizando otro tipo de bloques, como <i>“esperar hasta que”</i> o <i>“cuando el fondo cambie a...”</i>.
gl: A máis do envío de mensaxes, podes sincronizar personaxes para facer cousas na orde desexada utilizando outros bloques, coma o <i>'agardar ata que'</i> ou <i>'cando o fondo cambia a</i> ...'
it: Oltre all'invio di messaggi, puoi sincronizzare i personaggi per far accadere le cose nell'ordine che vogliamo, utilizzando altri blocchi, ad esempio <i>'attendi fino a quando'</i> o <i>'quando lo sfondo passa a ... '</i>.
pt: Além de mandar mensagens, você pode sincronizar personagens para fazer coisas acontecerem na ordem que quiser, usando outros blocos, como <i>'espere até'</i> ou <i>'quando o fundo muda para...'</i>.
tr: Mesaj göndermenin yanı sıra, karakterleri senkronize ederek olayların istediğimiz sırayla gerçekleşmesini sağlamak için diğer blokları da kullanabilirsiniz, örneğin <i>'bekle ...' </i> veya <i>'arka plan ... değiştiğinde'</i> blokları.

source: wait until &lt;(lives) =[0]&gt;
ca: espera fins &lt;(vides) =[0]&gt;
es: esperar hasta que &lt;(vidas) =[0]&gt;
gl: agardar até &lt;(vides) =[0]&gt;
it: attendi fino a quando &lt;(vite) =[0]&gt;
pt: espera até que &lt;(vidas) =[0]&gt;

source: say [Game over] for (2) secs
ca: digues [Fi del joc] durant (2) segons
es: decir [Has perdido] durante (2) segundos
gl: dicir [Xogo rematado] durante (2) segundos
it: dire [Game over] per (2) secondi
pt: diz [Fim de jogo] durante (2) s
