Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Now that you know the instructions <i>if</i>, perhaps you can start using blocks <i>if / else</i>, which can be very practical in many types of projects. The blocks <i>if / else</i> are very similar to the block <i>if</i>, but contain two sets of blocks inside.
ca: Ara que coneixes les instruccions <i>si</i>, potser puguis començar a fer ús del blocs <i>si/si no</i>, que poden ser molt pràctics en molts tipus de projectes. Els blocs <i>si/si no</i> són molt semblants als blocs si, però contenen dos conjunts de blocs en el seu interior.
es: Ahora que conoces las instrucciones <i>si</i>, quizás puedas comenzar a utilizar bloques <i>si/sino</i>, que pueden ser muy prácticos en muchos tipos de proyectos. Los bloques <i>si/sino</i> son muy parecidos a los bloque si, pero contienen dos conjuntos de bloques en su interior.
gl: Agora que xa coñeces as instruccións <i>si</i>, quizáis podes comezar a usar os bloques <i>si / senón</i>, que poden ser moi prácticos en moitos tipos de proxectos. Os bloques se / senón son moi similares ao bloque <i>si</i>, pero conteñen dous conxuntos de bloques no seu interior.
it: Ora che conosci le istruzioni <i>se</i>, allora puoi iniziare a utilizzare i blocchi <i>se / altrimenti</i>, questo blocco può essere molto pratico in molti tipi di progetti. I blocchi <i>se / altrimenti</i> sono molto simili al blocco <i>se</i>, ma contengono due insiemi di blocchi all'interno.
pt: Agora que você conhece a instrução <i>se</i>, talvez você possa começar a usar blocos <i>se / senão</i>, que são muito práticos em vários tipos de projetos. Os blocos <i>se / senão</i> são bem parecidos com o bloco <i>se</i>, mas tem dois conjuntos de blocos dentro.
tr: Artık <i>if</i> talimatlarını bildiğinize göre, birçok proje türünde çok pratik olabilecek <i>if / else</i> bloklarını kullanmaya başlayabilirsiniz. <i>if / else</i> blokları, <i>if</i> bloğuna çok benzer, ancak içinde iki ayrı blok seti içerir.

source: if &lt; touching color [#0000FF]? &gt;then
ca: si &lt; tocant el color [#0000FF]? &gt;llavors
es: si &lt;¿tocando el color [#0000FF]? &gt;entonces
gl: se &lt; toca na cor [#0000FF]? &gt;entón
it: se &lt; sta toccando il colore [#0000FF]? &gt;allora
pt: se &lt; estás a tocar na cor [#0000FF] &gt; , então

source: else
ca: si no
es: si no
gl: se non
it: altrimenti
pt: senão,

source: How this block works? When execution reaches this point, the condition on the block is evaluated, and if this is true, the set of blocks that are within the 'if' is executed, but if the condition is false, then the set of blocks that are within the 'else' is executed.
ca: Com funciona aquest bloc? Quan l'execució arriba a aquest punt, s'avalua la condició que apareix en el bloc, i si aquesta és certa, s'executa el conjunt de blocs que estan dins d'aquesta; ara bé, en cas de ser falsa, aleshores s'executa el conjunt de blocs continguts en el "si no".
es: ¿Cómo funciona este bloque? Cuando la ejecución llega a este punto, se evalúa la condición que aparece en el bloque, y si ésta es verdadera, se ejecuta el conjunto de bloques que están dentro del si.
gl: Como funciona este bloque? Cando a execución acada este punto, a condición se evalúa, e se é verdadeira, o conxunto de bloques que están dentro do 'se' se executan, mais se a condición é falsa, entón o conxunto de bloques que están dentro do 'senón' se executan.
it: Come funziona questo blocco? Quando l'esecuzione raggiunge questo punto, viene valutata la condizione del blocco e, se questa è vera, viene eseguito l'insieme dei blocchi che si trovano all'interno di 'se', ma se la condizione è falsa, allora viene eseguito l'insieme dei blocchi che si trovano all'interno di 'altrimenti'.
pt: Como esse bloco funciona? Quando a execução atinge esse ponto, a condição no bloco é avaliada e se for verdadeira, o conjunto de blocos dentro do 'Se' é executado. Se a condição for falsa, então o conjunto de blocos dentro do 'Senão' é executado.
tr: Bu blok nasıl çalışır? Yürütme bu noktaya geldiğinde, bloktaki koşul değerlendirilir ve eğer bu koşul doğruysa, 'if' içindeki bloklar çalıştırılır; ancak koşul yanlışsa, o zaman 'else' içindeki bloklar çalıştırılır.

source: In the example, if the character is touching the blue color, he says 'I reached the goal!', but ,if you are not touching the purple color, says 'I have not reached the goal'.
ca: En l'exemple, si el personatge està tocant el color blau diria "He arribat a la meta!", però si no ho està diria "Encara no he arribat".
es: En el ejemplo, si el personaje está tocando el color azul diría “Llegué a la meta”,pero si no está tocando el color morado diría “Aún no he llegado a la meta”
gl: No exemplo, se o personaxe toca a cor azul, di 'Acadei o obxectivo', mais se non está a tocar a cor morada, di 'Non acadei o obxectivo'.
it: Nell'esempio, se il personaggio tocca il colore blu, dice "Ho raggiunto l'obiettivo!" ma, se non tocca il colore blu, dice 'non ho raggiunto l'obiettivo'.
pt: No exemplo, se o personagem estiver tocando a cor azul, ele fala 'Eu atingi o objetivo!', mas se não estiver tocando a cor roxa, fala 'Eu não atingi o objetivo'.
tr: Örnekte, eğer karakter mavi renge dokunuyorsa, 'I reached the goal!' der; ancak mor renge dokunmuyorsa, 'I have not reached the goal' der.

source: To make decisions on some projects sometimes is necessary to evaluate more than one condition at the same time to know what to execute. In these situations it is very helpful to use <b>logical operations</b> that combine the conditions. Logical operations are available in Scratch <i>AND, OR and No</i>.
ca: Per prendre decisions en alguns projectes, de vegades es fa necessari avaluar més d'una condició al mateix temps per saber què cal executar. En aquestes situacions és molt útil emprar <b>operacions lògiques</b> que permetin combinar les condicions. Les operacions lògiques disponibles a Scratch són <i>I, O i No</i>.
es: Para tomar decisiones en algunos proyectos en ocasiones se requiere evaluar más de una condición al mismo tiempo para saber qué hay que ejecutar. En esas situaciones es muy útil utilizar <b>operaciones lógicas</b> que permiten combinar las condiciones. Las operaciones lógicas disponibles en Scratch son <i>Y, O y No</i>.
gl: Para tomar decisións sobre algúns proxectos, ás veces é necesario avaliar máis dunha condición ao mesmo tempo para saber cal executar. Nestas situacións é de moita axuda o uso de operacións lóxicas que combinen as condicións. As operacións lóxicas dispoñobles en Scratch son <i>E, OU e Non</i>.
it: Per prendere decisioni in alcuni progetti, talvolta, è necessario valutare più di una condizione allo stesso tempo per sapere cosa eseguire. In queste situazioni è molto utile utilizzare <b>operazioni logiche</b> che combinano più condizioni. Le operazioni logiche disponibili in Scratch sono: <i> E, O e NON</i>.
pt: Para tomar decisões em alguns projetos, às vezes, é necesário avaliar mais de uma condição ao mesmo tempo, para saber o que executar. Nessas situações, é muito útil usar <b>operaões lógicas</b> que combinam as condições. As operações lógicas disponíveis no Scratch são <i>E, OU e NÃO</i>.
tr: Bazı projelerde karar vermek için bazen aynı anda birden fazla koşulu değerlendirmek gerekebilir. Bu tür durumlarda, <b>koşulları birleştiren mantıksal işlemleri</b> kullanmak çok yardımcı olur. Scratch'te mantıksal işlemler <i>AND, OR ve NOT</i> olarak mevcuttur.

source: if &lt;&lt; touching [Enemy v]? &gt; and &lt;(lives) = [0]&gt;&gt; then
ca: si &lt;&lt; tocant [Enemic v]? &gt; i &lt; (vides) = [0]&gt;&gt; llavors
es: si &lt;&lt; ¿tocando [Enemigo v]? &gt; y &lt; (vidas) = [0]&gt;&gt; entonces
gl: se &lt;&lt; toca [Inimigo v]? &gt; e &lt;(vidas) = [0]&gt;&gt; entón
it: se &lt;&lt; sta toccando [Nemico v]? &gt; e &lt;(vite) = [0]&gt;&gt; allora
pt: se &lt;&lt; estás a tocar em [Enemy v]? &gt; e &lt;(lives) = [0]&gt;&gt; , então

source: say [Game over]
ca: digues [Fi del joc]
es: decir [Has perdido]
gl: dicir [Perdeu]
it: dire [Game over]
pt: diz [Fim de jogo]

source: stop [all v]
ca: atura [tot v]
es: detener [todos v]
gl: parar. [todo v]
it: ferma [tutto v]
pt: pára [tudo v]

source: if &lt;&lt; touching [edge v]? &gt; or &lt; touching [Enemy v]? &gt;&gt;then
ca: si &lt;&lt; tocant [vora v]? &gt; o &lt; tocant [Enemic v]? &gt;&gt;llavors
es: si &lt;&lt; ¿tocando [borde v]? &gt; o &lt; ¿tocando [Enemigo v]? &gt;&gt;entonces
gl: se &lt;&lt; toca [bordo v]? &gt; ou &lt; toca [Inimigo v]? &gt;&gt;entón
it: se &lt;&lt; sta toccando [bordo v]? &gt; o &lt; sta toccando [Nemico v]? &gt;&gt;allora
pt: se &lt;&lt; estás a tocar em [a borda v]? &gt; ou &lt; estás a tocar em [Enemy v]? &gt; &gt; , então

source: change [lives v] by (-1)
ca: augmenta [vides v] en (-1)
es: sumar a [vidas v] (-1)
gl: sumarlle (-1) a [vidas v]
it: cambia [vite v] di (-1)
pt: adiciona a [vidas v] o valor (-1)

source: if &lt; not &lt;(level)=(5)&gt;&gt;then
ca: si &lt;no&lt; (nivell) = (5)&gt;&gt;llavors
es: si &lt;no&lt; (nivel) = (5)&gt;&gt;entonces
gl: se &lt;non&lt; (vidas) = (5)&gt;&gt;entón
it: se &lt;non&lt; (livello) = (5)&gt;&gt;allora
pt: se &lt; é falso que &lt; (nível) = (5)&gt;&gt; , então

source: say [You still have undiscovered levels] for (2) secs
ca: digues [Encara tens nivells per descobrir] durant (2) segons
es: decir [Aún tienes niveles por descubrir] durante (2) segundos
gl: dicir [Aínda ten que descubrir niveis]
it: dire [Hai ancora livelli da esplorare] per (2) secondi
pt: diz [Você ainda tem níveis não descobertos] durante (2) s

source: The operation <i>AND</i> is true when both conditions are true evaluated. The <i>OR</i> operation is true when one of two conditions are true evaluated. And the operation otherwise not worth the condition, ie, if the condition is true, not returns false and vice versa.
ca: L'operació <i>I</i> és certa quan les dues condicions avaluades són certes. L'operació <i>O</i> és certa quan una de les dues condicions avaluades són certes. I l'operació <i>No</i> valdrà el contrari de la condició, és a dir, si la condició és certa, <i>No</i> retorna fals i al contrari.
es: La operación <i>Y</i> es verdadera cuando las dos condiciones de evaluadas son verdaderas. La operación <i>O</i> es verdadera cuando una de las dos condiciones evaluadas son verdaderas. Y la operación <i>No</i> valdrá lo contrario de la condición, es decir, si la condición es verdadera, <i>No</i> devuelve falso y viceversa.
gl: A operación <i>E</i> é certa cando as dúas condicións son avaliadas certas. A operación <i>OU</i> é certa cando unha das dúas condición é avaliada certa. E a operación Non vale o contrario da condición, é dicir, se a condición é verdadeira Non devolve falso e viceversa.
it: L'operazione <i>E</i> è vera quando entrambe le condizioni sono vere. L'operazione <i>O</i> è vera se una delle due condizioni è vera. E l'operazione NON non prende il valore della condizione, vale a dire, se la condizione è vera, NON restituisce falso e viceversa.
pt: A operação <i>E</i> é verdadeira quando ambas as condições forem verdadeiras. A operação <i>OU</i> é verdadeira quando uma das duas condições for verdadeira. E a operação NÃO vai negar a condição, ou seja, se a condição for verdadeira, NÃO vai retornar falso e vice-versa.
tr: <i>AND</i> işlemi, her iki koşul da doğru olduğunda doğrudur. <i>OR</i> işlemi ise iki koşuldan biri doğru olduğunda doğrudur. <i>NOT</i> işlemi ise koşul tersini döndürür; yani, eğer koşul doğruysa, yanlış döner ve tam tersi de geçerlidir.

source: In most Scratch creations a certain level of parallelism is required. But what means parallelism? <b>Parallelism is the possibility that several things occur simultaneously.</b> For example, two characters perform an action while a character or do several things at once.
ca: En la majoria de les creacions Scratch es fa necessari un cert nivell de paral·lelisme. Però, què és el paral·lelisme? <b> El paral·lelisme és la possibilitat de que diverses circumstàncies succeeixin alhora.</b> Per exemple, que dos personatges realitzin una acció al mateix temps, o que un personatge dugui a terme múltiples fets alhora.
es: En la mayoría de las creaciones Scratch se requiere un cierto nivel de paralelismo. Pero, ¿qué es el paralelismo? <b>El paralelismo es la posibilidad de que varias cosas ocurran al mismo tiempo.</b> Por ejemplo, que dos personajes realicen una acción al mismo tiempo, o que un personaje haga varias cosas a la vez.
gl: En moitas creacións de Scratch é necesario un certo nivel de paralelismo. Pero, que significa paralelismo? Paralelismo é a posibilidade de que varias cousas acontezan simultaneamente. Por exemplo, dous personaxes realizan unha acción no mesmo momento ou un personaxe realiza varias acción ao tempo.
it: Nella maggior parte delle creazioni di Scratch occorre un certo livello di parallelismo. Ma che significa parallelismo? <b>Il parallelismo è la possibilità che diverse cose si verificano contemporaneamente.</b> Ad esempio, due personaggi eseguono un'azione mentre un altro fa più cose contemporaneamente.
pt: Em muitas criações com Scratch um certo nível de paralelismo é necessário. Mas, o que quer dizer paralelismo? <b>É a possibilidade de que várias coisas ocorram simultaneamente, ou seja, ao mesmo tempo.</b> Por exemplo, um personagem fazem uma ação enquanto outro está fazendo outra coisa.
tr: Çoğu Scratch yaratımında belirli bir seviyede paralellik gereklidir. Ama paralellik ne anlama gelir? <b>Paralellik, birden fazla şeyin aynı anda gerçekleşme olasılığıdır.</b> Örneğin, iki karakter bir eylemi gerçekleştirirken diğer bir karakter birden fazla şey yapabilir.

source: The most basic and most obvious way to achieve parallelism is to have several programs that start with <i>'When green flag is clicked'</i>:
ca: La manera més bàsica i més evident d'aconseguir paral·lelisme és tenir diversos programes que s'iniciïn alhora amb <i> "Quan la bandera verda es premi"</i>:
es: La forma más básica y más evidente de conseguir paralelismo es tener varios programas que comienzan con <i>“Al presionar la bandera verde”</i>:
gl: O xeito máis básico e máis obvio de acadar paralelismo é ter varios programas que empecen con <i>'Cando se preme na bandeira verde'</i>:
it: Il modo più semplice e più ovvio per ottenere il parallelismo è quello di avere diversi script che iniziano con <i>'Quando si clicca su bandierina verde'</i>:
pt: A forma mais simples e direta de criar paralelismo é fazer que vários programas comecem com <i>'Quando a bandeira verde for clicada'</i>:
tr: Paralelliği sağlamak için en temel ve en bariz yöntem, birden fazla programın <i>'When green flag is clicked'</i> ile başlamasıdır:

source: Thus, when the user clicking on the green flag, all programs that start with this block would begin to run simultaneously, or in parallel, as can also be said. You could have several programs that start with this block in the same character, if you want it to do several things at once, or in programs of different characters, if you want everyone to undertake an action at beginning of execution.
ca: Així, quan l'usuari cliqui damunt la bandera verda, tots els programes que comencen amb aquest bloc passaran a executar-se al mateix temps o, com també podem dir, en paral·lel. Podries tenir diferents programes que comencin amb aquest bloc en un mateix personatge, si vols que faci diverses accions alhora, o en programes de diferents personatges, si vols que tots comencin a realitzar una acció quan iniciem l'execució.
es: De este modo, cuando el usuario pinchase sobre la bandera verde, todos los programas que comienzan con este bloque comenzarían a ejecutarse al mismo tiempo, o en paralelo, como también puede decirse. Podrías tener varios programas que comiencen con este bloque en un mismo personaje, si quieres que haga varias cosas a la vez, o en programas de diferentes personajes, si quieres que todos comiencen a realizar una acción al comenzar la ejecución.
gl: Deste xeito, cando o usuario preme na bandeira verde, todos os programas que empezan con este bloque comezarían simultaneamente, ou en paralelo, como se pode dicir tamén. Poderías ter varios programas que empecen con este bloque no mesmo personaxe se queres que faga varias cousa ao tempo, ou en programas de diferentes personaxes se queres que todo o mundo realice unha acción ao comezo da execución.
it: Così, quando l'utente fa clic sulla bandierina verde, tutti gli script che cominciano con questo blocco iniziano a funzionare simultaneamente o in parallelo come si dice. Puoi avere diversi script che iniziano con questo blocco nello stesso sprite, se vuoi che il tuo personaggio faccia diverse cose contemporaneamente, o in script di personaggi diversi, se vuoi che tutti intraprendano un'azione all'inizio dell'esecuzione.
pt: Assim, quando o usuário clica na bandeira verde, todos os programas que iniciam com esse bloco começam a rodar simultaneamente, ou em paralelo, como podemos também dizer. Você pode ter vários programas começando com esse bloco para o mesmo personagem, se você quiser que ele faça várias coisas ao mesmo tempo. Pode também fazer que vários personagens executem uma ação no início da execução.
tr: Böylece, kullanıcı yeşil bayrağa tıkladığında, bu blok ile başlayan tüm programlar aynı anda veya paralel olarak çalışmaya başlar. Bir karakterde birden fazla program bu blok ile başlayabilir, böylece karakterin birden fazla şey yapmasını sağlayabilirsiniz; ya da farklı karakterlerin programlarında, böylece herkesin yürütmeye başladığında bir eylem gerçekleştirmesini sağlayabilirsiniz.

source: Another way to achieve parallelism in your program is <b>doing several things occur when the user presses a key or clicks on an object</b>. Consider a couple of examples:
ca: Una altra manera d'aconseguir paral·lelisme en els teus programes és <b>fent que succeeixin diverses circumstàncies quan l'usuari prem una tecla o clica sobre un personatge</b>. Vegem un parell d'exemples:
es: Otra forma de conseguir paralelismo en tus programas es <b>haciendo que ocurran varias cosas cuando el usuario presiona una tecla o hace click sobre un objeto</b>. Veamos un par de ejemplos:
gl: Outro xeito de conseguir paralelismo nos teus programas é facer que varias cousas acontezan cando o usuario preme unha tecla ou nun obxecto. Vexamos un par de exemplos:
it: Un altro modo per ottenere il parallelismo nel tuo programma è <b>far fare diverse cose quando l'utente preme un tasto o fa clic su un oggetto</b>. Consideriamo un paio di esempi:
pt: Outra forma de obter paralelismo em seu programa é <b>fazer que várias coisas aconteçam quando o usuário pressiona uma tecla ou clica em um objeto na tela</b>. Considere alguns exemplos:
tr: Programınızda paralellik sağlamak için bir diğer yol, <b>kullanıcı bir tuşa bastığında veya bir nesneye tıkladığında birden fazla şeyin gerçekleşmesini sağlamaktır</b>. İşte birkaç örnek:

source: when [a v] key pressed
ca: quan la tecla [a v] es premi
es: al presionar tecla [A v]
gl: ao premer a tecla [a v]
it: quando si preme il tasto [a v]
pt: Quando alguém pressionar a tecla [a v]

source: say [A] for (2) secs
ca: digues [A] durant (2) segons
es: decir [A] durante (2) segundos
gl: dicir [A v] durante (2) segundos
it: dire [A] per (2) secondi
pt: diz [A] durante (2) s

source: when this sprite clicked
ca: quan es cliqui aquest personatge
es: al hacer clic en este objeto
gl: ao premer nesta figura
it: quando si clicca questo sprite
pt: Quando alguém clicar em ti

source: if &lt;touching [the mouse pointer v]? &gt; then
ca: si &lt; tocant [punter del ratolí v]? &gt; llavors
gl: se &lt;toca [punteiro do rato v]? &gt; entón
it: se &lt;sta toccando [puntatore del mouse v] &gt; allora
pt: se &lt; estás a tocar em [o ponteiro do rato v] &gt; , então

source: turn cw (30) degrees
ca: gira ↺ (30) graus
es: girar ↺ (30) grados
gl: xirar ↻ (30) graos
it: ruota in senso orario di (30) gradi
pt: gira ↻ (30) °

source: How these blocks works?
ca: Com funcionen aquests blocs de control?
es: ¿Cómo funcionan estos bloques de control?
gl: Como funcionan estes bloques?
it: Come lavora questo blocco?
pt: Como estes blocos funcionam?
tr: Bu bloklar nasıl çalışır?

source: In the first example, we see two different characters that, when a key is pressed, perform a certain action. Therefore, when the user press the a key, in this case, both the cat and the child run at the same time <i>'say A for 2 seconds'</i>
ca: En el primer exemple veiem que hi ha dos personatges diferents que, quan es prem una tecla, realitzen una determinada acció. Per tant, quan l'usuari premi, en aquest cas, la tecla a, tant el gat com el nen executaran alhora <i>"digues A durant 2 segons"</i>.
es: En el primer ejemplo, vemos que hay dos personajes diferentes que, cuando se pulsa una tecla, realizan una determinada acción. Por tanto, cuando el usuario pulse la tecla a, en este caso, tanto el gato como el niño ejecutarán al mismo tiempo <i>“decir A por 2 segundos”</i>.
gl: Neste primeiro exemplo, vemos dous personaxes diferentes que, cando se preme a tecla da letra a, realizan unha certa acción. Polo tanto, cando o usuario preme a letra a, neste caso, tanto o gato coma o neno executan ao mesmo tempo <i>'dicir A durante 2 segundos'</i>
it: Nel primo esempio, vediamo che per due personaggi differenti quando viene premuto il tasto a, viene eseguita una certa azione. Pertanto, quando l'utente premere il tasto a, in questo caso, sia il gatto che l'altro personaggio eseguono contemporaneamente <i>'dire A per 2 secondi'</i>
pt: No primeiro exemplo, vemos dois personagens diferentes que fazem uma certa ação quando uma tecla é pressionada. Assim, quando o usuário pressiona a tecla 'a', o gato e a criança executam ao mesmo tempo <i>'diga A por 2 segundos'</i>
tr: İlk örnekte, bir tuşa basıldığında belirli bir eylemi gerçekleştiren iki farklı karakter görüyoruz. Bu nedenle, kullanıcı bir tuşa bastığında, bu durumda hem kedi hem de çocuk aynı anda <i>'say A for 2 seconds'</i> komutunu çalıştırır.

source: In the second example we see that a character has two programs that begin with <i>'when clicking this object'</i>. Therefore, when the user clicks on this character, both programs will begin to run simultaneously, in parallel.
ca: En el segon exemple veiem que un personatge té dos programes que comencen amb <i>"quan es cliqui aquest personatge"</i>. Per tant, quan l'usuari faci clic sobre aquest personatge, tots dos programes començaran a executar-se alhora, en paral·lel.
es: En el segundo ejemplo vemos que un personaje tiene dos programas que comienzan con <i>“al clickear este objeto”</i>. Por tanto, cuando el usuario haga click sobre este personaje, ambos programas comenzarán a ejecutarse al mismo tiempo, en paralelo.
gl: No segundo exemplo vemos que o personaxe ten dous programas que comezan con <i>'cando se prema neste obxecto'</i>. Polo tanto, cando o usuario preme neste personaxe, ámbolos dous programas se excecutarán simultaneamente, en paralelo.
it: Nel secondo esempio vediamo che un personaggio ha due script che iniziano con <i>'quando si clicca questo sprite'</i>. Pertanto, quando l'utente fa clic su questo sprite, entrambi gli script iniziano a funzionare contemporaneamente, in parallelo.
pt: No segundo exemplo, vemos que um personagem tem dois programas que começam com <i>'quando clica neste objeto'</i>. Assim, quando o usuário clica neste personagem, ambos os programas começarão a ser executados simultaneamente.
tr: İkinci örnekte, bir karakterin <i>'when clicking this object'</i> ile başlayan iki programı olduğunu görüyoruz. Bu nedenle, kullanıcı bu karaktere tıkladığında, her iki program da aynı anda, paralel olarak çalışmaya başlayacaktır.
