Repository: Daniesmor/Dr.Scratch-Northeastern
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca, es, gl, it, pt, tr

source: Data representation is important. Proper design of data structure facilitates code understanding and maintenance.
ca: La representació de dades és important. Un disseny adequat de l'estructura de dades facilita la comprensió i el manteniment del codi.
es: La representación de datos es importante. Un diseño adecuado de la estructura de datos facilita la comprensión y el mantenimiento del código.
gl: A representación dos datos é importante. Un deseño adecuado da estrutura de datos facilita a comprensión e o mantemento do código.
it: La rappresentazione dei dati è importante. Un corretto design della struttura dati facilita la comprensione e la manutenzione del codice.
pt: A representação dos dados é importante. Um design adequado da estrutura de dados facilita a compreensão e a manutenção do código.
tr: Veri temsili önemlidir. Veri yapısının doğru tasarımı, kodun anlaşılmasını ve bakımını kolaylaştırır.

source: Data representation is crucial. It is essential for optimizing code performance and scalability.
ca: La representació de dades és crucial. És essencial per optimitzar el rendiment i l'escalabilitat del codi.
es: La representación de datos es crucial. Es esencial para optimizar el rendimiento y la escalabilidad del código.
gl: A representación dos datos é crucial. É esencial para optimizar o rendemento e a escalabilidade do código.
it: La rappresentazione dei dati è cruciale. È essenziale per ottimizzare le prestazioni del codice e la scalabilità.
pt: A representação dos dados é crucial. É essencial para otimizar o desempenho e a escalabilidade do código.
tr: Veri temsili çok önemlidir. Kodun performansını ve ölçeklenebilirliğini optimize etmek için gereklidir.

source: Data representation is absolutely vital. Poor data representation can lead to critical errors.
ca: La representació de dades és absolutament vital. Una representació deficient de les dades pot provocar errors crítics.
es: La representación de datos es absolutamente vital. Una representación deficiente de los datos puede provocar errores críticos.
gl: A representación dos datos é absolutamente vital. Unha representación deficiente dos datos pode provocar erros críticos.
it: La rappresentazione dei dati è assolutamente vitale. Una rappresentazione dei dati scarsa può portare a errori critici.
pt: A representação dos dados é absolutamente vital. Uma representação deficiente dos dados pode provocar erros críticos.
tr: Veri temsili kesinlikle hayati önem taşır. Kötü veri temsili kritik hatalara yol açabilir.

source: Math Operators
ca: Operadors Matemàtics
es: Operadores Matemáticos
gl: Operadores Matemáticos
it: Operatori matematici
pt: Operadores Matemáticos
tr: Matematiksel Operatörler

source: Mathematical operators are not crucial at this moment. Performing complex mathematical operations is not required.
ca: Els operadors matemàtics no són crucials en aquest moment. No és necessari realitzar operacions matemàtiques complexes.
es: Los operadores matemáticos no son cruciales en este momento. No es necesario realizar operaciones matemáticas complejas.
gl: Os operadores matemáticos non son cruciais neste momento. Non é necesario realizar operacións matemáticas complexas.
it: Gli operatori matematici non sono cruciali in questo momento. Non è necessario eseguire operazioni matematiche complesse.
pt: Os operadores matemáticos não são cruciais neste momento. Não é necessário realizar operações matemáticas complexas.
tr: Matematiksel operatörler şu anda kritik değildir. Karmaşık matematiksel işlemler gerçekleştirmek gerekmemektedir.

source: The use of mathematical operators is minimal. Only basic operations are needed for simple calculations.
ca: L'ús d'operadors matemàtics és mínim. Només es necessiten operacions bàsiques per a càlculs senzills.
es: El uso de operadores matemáticos es mínimo. Solo se necesitan operaciones básicas para cálculos simples.
gl: O uso de operadores matemáticos é mínimo. Só se necesitan operacións básicas para cálculos sinxelos.
it: L'uso degli operatori matematici è minimo. Sono necessarie solo operazioni di base per calcoli semplici.
pt: O uso de operadores matemáticos é mínimo. Só se necessitam operações básicas para cálculos simples.
tr: Matematiksel operatörlerin kullanımı minimaldir. Sadece basit hesaplamalar için temel işlemler gerekmektedir.

source: Mathematical operators have some importance. Basic operations are required to perform some tasks.
ca: Els operadors matemàtics tenen certa importància. Es requereixen operacions bàsiques per realitzar algunes tasques.
es: Los operadores matemáticos tienen cierta importancia. Se requieren operaciones básicas para realizar algunas tareas.
gl: Os operadores matemáticos teñen certa importancia. Requírense operacións básicas para realizar algunhas tarefas.
it: Gli operatori matematici hanno una certa importanza. Sono necessarie operazioni di base per svolgere alcune attività.
pt: Os operadores matemáticos têm certa importância. São necessárias operações básicas para realizar algumas tarefas.
tr: Matematiksel operatörlerin bazı önemi vardır. Bazı görevleri yerine getirmek için temel işlemler gereklidir.

source: Mathematical operators are important. They are used to perform essential calculations that directly affect functionality.
ca: Els operadors matemàtics són importants. S'utilitzen per realitzar càlculs essencials que afecten directament a la funcionalitat.
es: Los operadores matemáticos son importantes. Se utilizan para realizar cálculos esenciales que afectan directamente a la funcionalidad.
gl: Os operadores matemáticos son importantes. Utilízanse para realizar cálculos esenciais que afectan directamente á funcionalidade.
it: Gli operatori matematici sono importanti. Vengono utilizzati per eseguire calcoli essenziali che influenzano direttamente la funzionalità.
pt: Os operadores matemáticos são importantes. São utilizados para realizar cálculos essenciais que afetam diretamente à funcionalidade.
tr: Matematiksel operatörler önemlidir. İşlevselliği doğrudan etkileyen temel hesaplamaları yapmak için kullanılırlar.

source: Mathematical operators are crucial. Their correct usage is fundamental to ensure accuracy and consistency in calculations.
ca: Els operadors matemàtics són crucials. El seu ús correcte és fonamental per garantir la precisió i la consistència en els càlculs.
es: Los operadores matemáticos son cruciales. Su uso correcto es fundamental para garantizar la precisión y la consistencia en los cálculos.
gl: Os operadores matemáticos son cruciais. O seu uso correcto é fundamental para garantir a precisión e a consistencia nos cálculos.
it: Gli operatori matematici sono cruciali. Il loro corretto utilizzo è fondamentale per garantire precisione e coerenza nei calcoli.
pt: Os operadores matemáticos são cruciais. O seu uso correto é fundamental para garantir a precisão e a consistência nos cálculos.
tr: Matematiksel operatörler kritik öneme sahiptir. Doğru kullanımları, hesaplamalarda doğruluk ve tutarlılığı sağlamak için temel gereklidir.

source: Mathematical operators are absolutely vital. They are indispensable for operations that determine the final result.
ca: Els operadors matemàtics són absolutament vitals. Són indispensables per a les operacions que determinen el resultat final.
es: Los operadores matemáticos son absolutamente vitales. Son indispensables para las operaciones que determinan el resultado final.
gl: Os operadores matemáticos son absolutamente vitais. Son indispensables para as operacións que determinan o resultado final.
it: Gli operatori matematici sono assolutamente vitali. Sono indispensabili per le operazioni che determinano il risultato finale.
pt: Os operadores matemáticos são absolutamente vitais. São indispensáveis para as operações que determinam o resultado final.
tr: Matematiksel operatörler kesinlikle hayati öneme sahiptir. Sonuçları belirleyen işlemler için vazgeçilmezdirler.

source: Motion Operators
ca: Operadors de Moviment
es: Operadores de Movimiento
gl: Operadores de Movemento
it: Operatori del movimento
pt: Operadores de Movimento
tr: Hareket Operatörleri

source: Motion operators are not crucial at this moment. Extensive manipulation of movements in the code is not required.
ca: Els operadors de moviment no són crucials en aquest moment. No es requereix una manipulació extensa de moviments en el codi.
es: Los operadores de movimiento no son cruciales en este momento. No se requiere una manipulación extensa de movimientos en el código.
gl: Os operadores de movemento non son cruciais neste momento. Non se require unha manipulación extensa de movementos no código.
it: Gli operatori di movimento non sono cruciali in questo momento. Non è necessaria una manipolazione estensiva dei movimenti nel codice.
pt: Os operadores de movimento não são cruciais neste momento. Não é necessária uma manipulação extensa de movimentos no código.
tr: Hareket operatörleri şu anda kritik değil. Kodda geniş çaplı hareket manipülasyonlarına ihtiyaç duyulmamaktadır.

source: Motion operators are minimal. There is no significant need for motion control in the code.
ca: Els operadors de moviment són mínims. No hi ha una necessitat significativa de control de moviment en el codi.
es: Los operadores de movimiento son mínimos. No hay una necesidad significativa de control de movimiento en el código.
gl: Os operadores de movemento son mínimos. Non hai unha necesidade significativa de control de movemento no código.
it: Gli operatori di movimento sono minimi. Non c'è un bisogno significativo di controllo del movimento nel codice.
pt: Os operadores de movimento são mínimos. Não há uma necessidade significativa de controle de movimento no código.
tr: Hareket operatörleri minimum düzeyde. Kodda hareket kontrolü için belirgin bir ihtiyaç bulunmamaktadır.

source: Motion operators have some importance. There is a moderate need for movement manipulation in the code.
ca: Els operadors de moviment tenen certa importància. Hi ha una necessitat moderada de manipulació de moviment en el codi.
es: Los operadores de movimiento tienen cierta importancia. Existe una necesidad moderada de manipulación de movimiento en el código.
gl: Os operadores de movemento teñen certa importancia. Hai unha necesidade moderada de manipulación de movemento no código.
it: Gli operatori di movimento hanno una certa importanza. C'è un bisogno moderato di manipolazione del movimento nel codice.
pt: Os operadores de movimento têm certa importância. Há uma necessidade moderada de manipulação de movimento no código.
tr: Hareket operatörlerinin bir miktar önemi vardır. Kodda hareket manipülasyonu için orta düzeyde bir ihtiyaç bulunmaktadır.

source: Motion operators are important. Proper motion control is necessary for the functionality of the code.
ca: Els operadors de moviment són importants. És necessari un control adequat del moviment per a la funcionalitat del codi.
es: Los operadores de movimiento son importantes. Es necesario un control adecuado del movimiento para la funcionalidad del código.
gl: Os operadores de movemento son importantes. É necesario un control adecuado do movemento para a funcionalidade do código.
it: Gli operatori di movimento sono importanti. Un adeguato controllo del movimento è necessario per la funzionalità del codice.
pt: Os operadores de movimento são importantes. É necessário um controle adequado do movimento para a funcionalidade do código.
tr: Hareket operatörleri önemlidir. Kodun işlevselliği için uygun hareket kontrolü gereklidir.

source: Motion operators are crucial. Precise motion control is essential for the proper functioning of the code.
ca: Els operadors de moviment són crucials. Un control precís del moviment és essencial per al funcionament adequat del codi.
es: Los operadores de movimiento son cruciales. Un control preciso del movimiento es esencial para el funcionamiento adecuado del código.
gl: Os operadores de movemento son cruciais. Un control preciso do movemento é esencial para o funcionamento adecuado do código.
it: Gli operatori di movimento sono cruciali. Un controllo preciso del movimento è essenziale per il corretto funzionamento del codice.
pt: Os operadores de movimento são cruciais. Um controle preciso do movimento é essencial para o funcionamento adequado do código.
tr: Hareket operatörleri kritik öneme sahiptir. Kodun doğru şekilde çalışması için hassas hareket kontrolü gereklidir.

source: Motion operators are absolutely vital. The ability to manipulate movements effectively is fundamental.
ca: Els operadors de moviment són absolutament vitals. La capacitat de manipular moviments de manera efectiva és fonamental.
es: Los operadores de movimiento son absolutamente vitales. La capacidad de manipular movimientos de manera efectiva es fundamental.
gl: Os operadores de movemento son absolutamente vitais. A capacidade de manipular movementos de maneira efectiva é fundamental.
it: Gli operatori di movimento sono assolutamente vitali. La capacità di manipolare i movimenti in modo efficace è fondamentale.
pt: Os operadores de movimento são absolutamente vitais. A capacidade de manipular movimentos de maneira efetiva é fundamental.
tr: Hareket operatörleri kesinlikle hayati öneme sahiptir. Hareketleri etkili bir şekilde manipüle etme yeteneği temeldir.

source: Generate rubric
ca: Generar rúbrica
es: Generar rúbrica
gl: Xerar rúbrica
it: Generare rubrica
pt: Gerar rubrica
tr: Rubrik oluştur

source: You can share this url:
ca: Pots compartir aquest enllaç:
es: Puedes compartir este link:
gl: Podes compartir este enlace:
it: È possibile condividere questo URL:
pt: Pode partilhar este link:
tr: Bu URL'yi paylaşabilirsiniz:

source: First fill the form
ca: Primer cal generar la rúbrica.
es: Pulsa generar rúbrica.
gl: Primeiro é necesario xerar a rúbrica.
it: Prima compila la rubrica
pt: Primeiro é necessário gerar a rubrica.
tr: Önce formu doldurun

source: Here there are some rubrics examples:
ca: Aquests són alguns exemples de rúbriques d'avaluació:
es: Estos son algunos ejemplos de evaluación:
gl: Estes son algúns exemplos de rúbricas de avaliación:
it: Ecco alcuni esempi di rubriche:
pt: Estes são alguns exemplos de rubricas de avaliação:
tr: İşte bazı rubrik örnekleri:

source: Arts
es: Artes
gl: Artes
it: Arti
pt: Artes
tr: Sanat

source: Music
ca: Música
es: Música
gl: Música
it: Musica
pt: Música
tr: Müzik

source: Animations
ca: Animacions
gl: Animacións
it: Animazioni
pt: Animações
tr: Animasyonlar

source: Stories
ca: Històries
es: Historias
gl: Historias
it: Storie
pt: Histórias
tr: Hikayeler

source: Games
ca: Jocs
es: Juegos
gl: Xogos
it: Giochi
pt: Jogos
tr: Oyunlar

source: 3. Upload projects with a <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span> file:
ca: 3. Analitzar projectes d'un fitxer <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span>:
es: 3. Analizar proyectos de un archivo <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span>:
gl: 3. Analizar proxectos dun ficheiro <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span>:
it: 3. Carica progetti con un file <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span>:
pt: 3. Analisar projetos de um arquivo <span class='colored-text'><a data-toggle='modal' href='#modalProject'>txt</a></span>:

source: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Choose txt'>
ca: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Escull un fitxer de text'>
es: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Elige Proyecto'>
gl: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Escolle un ficheiro de texto'>
it: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Scegliere il file txt'>
pt: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Escolha um arquivo de texto'>
tr: <input name='urlsFile' type='file' class='filestyle' data-buttonText='Txt'yi seçin'>

source: These statistics are update every night at 00.00h CEST.
ca: Aquestes estadístiques són actualitzades cada nit a les 00.00h CEST.
es: Estas estadísticas son actualizadas todas las noches a las 00.00h CEST.
it: Queste statistiche vengono aggiornate ogni notte alle 00.00h CEST.

source: <h3 class='text-left dark-text'>The level of your project is... <strong> MASTER! </strong></h3>
es: <h3 class='text-left dark-text'>El nivel de tu proyecto es... <strong>¡ALTO!</strong></h3>
it: <h3 class='text-left dark-text'>Il livello del tuo progetto è... <strong> MASTER! </strong></h3>

source: New organization in Dr. Scratch!
ca: Nova organització a Dr. Scratch!
es: ¡Nueva organización en Dr. Scratch!
it: Nuova organizzazione in Dr Scratch!
pt: Nova organização no Dr Scratch!

source: You're receiving this email because you have successfully signed up in Dr. Scratch for organizations.
ca: Estàs rebent aquest correu electrònic perquè has sol·licitat restablir el teu compte a Dr. Scratch.
es: Estas recibiendo este email porque has pedido restaurar tu cuenta en Dr. Scratch.
it: Ricevi questa e-mail perché hai fatto la registrazione su Dr. Scratch come organizzazione.
pt: Você está recebendo esse e-mail porque entrou com êxito em sua conta Dr. Scratch para organizações.

source: Do you want to analyze many projects?
ca: Vols analitzar molts projectes?
es: ¿Quieres analizar muchos proyectos?
gl: Unha ferramenta poderosa para analizar os teus proxectos Scratch
it: Vuoi analizzare molti progetti?
pt: Você quer analisar muitos projetos?

source: Dr. Scratch for organizations
ca: Dr. Scratch per a organitzacions
es: Dr. Scratch para organizaciones
it: Dr Scratch per le organizzazioni
pt: Dr. Scratch para instituições

source: Welcome to the organizations version of Dr. Scratch
ca: Benvingut a la versió de Dr. Scratch per a organitzacions
es: Bienvenido a la versión de Dr. Scratch para organizaciones
it: Benvenuti nella versione di Dr Scratch per le organizzazioni
pt: Bem-vindo ao r. Scratch versão para organizações

source: Dr. Scratch for organizations is an analytical tool that can help you evaluate the Scratch projects of the students participating in your initiatives to asses their progression in terms of coding and computational thinking skills.
ca: Dr. Scratch per a organitzacions és una eina analítica que t'ajuda a avaluar els projectes Scratch dels estudiants que participen en les teves iniciatives i et permeten controlar el seu progrés posant el focus en el codi i en les habilitats de pensament computacional.
es: Dr. Scratch para organizaciones es una herramienta analítica que te ayuda a evaluar los proyectos Scratch de los estudiantes que participan en tus iniciativas y te permite controlar su progresión en relación a sus habilidades de programación y pensamiento computacional.
it: Dr Scratch per le organizzazioni è uno strumento analitico che può aiutare a valutare i progetti Scratch degli studenti che partecipano alle vostre iniziative per valutare la loro progressione in termini di codifica e capacità di pensiero computazionale.
pt: Dr. Scratch para organizações é uma ferramenta analítica que ajuda a avaliar projetos no Scratch dos estudantes de sua classe ou projeto para avaliar seu progresso em termos de habilidades de pensamento computacional e programação.

source: to join Dr. Scratch for organizations?
ca: gaudir de Dr. Scratch per a organitzacions.
es: disfrutar Dr. Scratch para organizaciones.
it: registrarsi a Dr Scratch per le organizzazioni?
pt: fazer parte do Dr. Scratch para organizações?

source: Would you like to be one of the 10 first organizations testing this new feature? Just drop us a line at
ca: Si vols ser una de les 10 primeres organitzacions que provin Dr. Scratch envia'ns un correu electrònic a:
es: Si quieres ser una de las 10 primeras organizaciones que prueban Dr. Scratch envíanos un email a
it: Vuoi essere una delle prime 10 organizzazioni che sperimentano questa nuova funzionalità? Basta scrivere due righe a
pt: Você gostaria de ser uma das 10 primeiras organizações a testar essa ferramenta? Deixe uma mensagem em

source: and we'll send you a hash key that will allow you to sign up in the web
ca: i et donarem una clau de pas per poder registrar-te a la web
es: y te daremos una clave para poder registrarte en la web
it: e ti invieremo un codice di controllo (hashkey) che ti permetterà di iscriverti al sito
pt: e enviaremos um código que permitirá que você se cadastre no site.

source: Organization's name
ca: Nom de l'organització
es: Nombre de la organización
it: Nome organizzazione
pt: Nome da organização

source: Hashkey
ca: Clau de pas
es: Clave
it: Codice di controllo - Hashkey
pt: Código

source: <input type='password' class='form-control' name='hashkey' placeholder='Password'>
it: <input type='password' class='form-control' name='hashkey' placeholder='Codice di controllo'>

source: This username already exists. Choose another, please.
es: Ese nombre ya existe. Elige otro, por favor.
it: Questo username esiste già. Scegline un altro, per favore.

source: This hashkey does not exist. Choose another, please.
es: Esta clave no existe. Elige otra, por favor.
it: Questo codice di controllo (hashkey) non esiste. Scrivine un altro, per favore.

source: Reset password
ca: Restablir la contrasenya
es: Reestablecer contraseña
it: Reimposta la password
pt: Reiniciar senha

source: You're receiving this email because you requested a password reset for your user account at Dr. Scratch.
ca: Has rebut aquest correu electrònic perquè has sol·licitat restablir el teu compte a Dr. Scratch.
es: Estas recibiendo este email porque has pedido restaurar tu cuenta en Dr. Scratch.
it: Ricevi questa email perché hai richiesto di reimpostare la password per il tuo account di Dr Scratch.
pt: Você está recebendo esse e-mail porque você solicitou a recuperação de senha em sua conta em Dr. Scratch.

source: Please, go to the following page and choose a new password:
ca: Si us plau, vés a la següent pàgina i tria una nova contrasenya:
es: Por favor, ve a la siguiente página y elige una nueva contraseña:
it: Per favore, vai alla pagina seguente e scegli una nuova password:
pt: Por favor, vá para a seguinte página e escolha uma nova senha:

source: Your username is:
ca: El teu nom d'usuari és:
es: Tu id es:
it: Il tuo username è:
pt: Seu usuário é:

source: We sended to you an email.
ca: T'hem enviat un correu electrònic.
es: Te hemos enviado un email.
it: Ti abbiamo inviato una email.
pt: Nós lhe enviamos um e-mail.

source: Check with your systems operator to see if the message was blocked.
ca: Comprova la carpeta de correu no desitjat del seu compte de correu.
es: Compruebe la carpeta de correo no deseado de su cuenta de correo.
it: Controlla con il tuo amministratore di sistemi per vedere se il messaggio è stato bloccato.
pt: Verifique suas configurações de e-mail e se a mensagem foi bloqueada.

source: Type your new password:
ca: Introdueix la teva nova contrasenya:
es: Introduce tu nueva contraseña:
it: Scrivi la nuova password:
pt: Insira sua nova senha:

source: Confirm your password:
ca: Confirma la teva contrasenya:
es: Confirma tu contraseña:
it: Conferma la password:
pt: Confirme sua senha:

source: The Password and Confirm password fields are not identical.
ca: Les dues contrasenyes no coincideixen.
es: Las dos contraseñas no coinciden.
it: I campi Password e Conferma password non sono identici.
pt: As senhas não são idênticas.
